using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace EduCompass.Migrations
{
    /// <inheritdoc />
    public partial class seeddata : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Answers",
                columns: new[] { "Id", "Answer1", "Answer2", "Answer3", "Answer4", "CorrectAnswer", "QuestionId" },
                values: new object[,]
                {
                    { 1, "Σωστό", "Λάθος", "", "", "Σωστό", 1 },
                    { 2, "Να δημιουργούν τάξεις, διεπαφές και αντικείμενα", "Να γνωρίζουν τις βασικές αρχές της γλώσσας C#", "Να μπορούν να αξιοποιήσουν τις βασικές αλγοριθμικές δομές σε γλώσσα C++", "Να μπορούν να υλοποιούν προγραμματισμό sockets (TCP sockets και UDP sockets).", "Να δημιουργούν τάξεις, διεπαφές και αντικείμενα", 2 },
                    { 3, "Να μπορούν να σχεδιάζουν και να υλοποιούν αλγόριθμους για την αποτελεσματική κατασκευή συνδυαστικών αντικειμένων.", "Να αναγνωρίζουν και να κατανοούν σύγχρονες τεχνικές σχεδίασης ολοκληρωμένων εφαρμογών λογισμικού με υπηρεσίες.", "Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", "Να σχεδιάζουν αρχιτεκτονικά σχέδια λογισμικού βασισμένα σε γλώσσες μοντελοποίησης και διαγράμματα.", "Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", 3 },
                    { 4, "Σωστό", "Λάθος", "", "", "Λάθος", 4 },
                    { 5, "Java", "", "", "", "Java", 5 },
                    { 6, "Ανάγνωση", "", "", "", "Ανάγνωση", 6 },
                    { 7, "Σωστό", "Λάθος", "", "", "Σωστό", 7 },
                    { 8, "Σωστό", "Λάθος", "", "", "Λάθος", 8 },
                    { 9, "Εξαιρέσεις", "", "", "", "Εξαιρέσεις", 9 },
                    { 10, "Αυτόνομη εργασία", "Αρχιτεκτονική Πελάτη-Εξυπηρετητή (Client-Server)", "Προσαρμογή σε νέες καταστάσεις", "Σχεδιασμός και διαχείριση έργων", "Αρχιτεκτονική Πελάτη-Εξυπηρετητή (Client-Server)", 10 },
                    { 11, "Σωστό", "Λάθος", "", "", "Σωστό", 11 },
                    { 12, "γραφικά", "", "", "", "γραφικά", 12 },
                    { 13, "ευφυών", "", "", "", "ευφυών", 13 },
                    { 14, "Υφή επιφάνειας αντικειμένων. Διαχείριση πηγών φωτός, ήχων, κάμερας. Animations.", "Ανάπτυξη εφαρμογών εικονικής πραγματικότητας στην πλατφόρμα Unity3D.", "Κόσμοι τρισδιάστατων γραφικών. Τρισδιάστατα μοντέλα αντικειμένων.", "Δομή και λειτουργία ενός ηλεκτρονικού παιχνιδιού.", "Δομή και λειτουργία ενός ηλεκτρονικού παιχνιδιού.", 14 },
                    { 15, "Σωστό", "Λάθος", "", "", "Λάθος", 15 },
                    { 16, "Unity3D", "", "", "", "Unity3D", 16 },
                    { 17, "Σωστό", "Λάθος", "", "", "Σωστό", 17 },
                    { 18, "συνιστώσες", "", "", "", "συνιστώσες", 18 },
                    { 19, "Μετρήσεις Αντικειμένου Εικόνας", "Εισαγωγή στα Γραφικά με Υπολογιστές, συστήματα απεικόνισης, χρώμα, γεωμετρικά σχήματα, μετασχηματισμοί, κίνηση.", "Δομή και την λειτουργία ενός ευφυούς πράκτορα μέσα σε ένα περιβάλλον.", "Αντιδρασιακοί πράκτορες (Reactive Agents) και Βουλητικοί πράκτορες (Deliberative Agents).", "Εισαγωγή στα Γραφικά με Υπολογιστές, συστήματα απεικόνισης, χρώμα, γεωμετρικά σχήματα, μετασχηματισμοί, κίνηση.", 19 },
                    { 20, "VRML: sensors και animation, γενικές αρχές μοντελοποίησης σκελετού, πρότυπα μοντελοποίησης κίνησης σώματος (H-Anim, κ.ά.), scripting, ενσωμάτωση σε εφαρμογές, PROTOs, προτεινόμενες πρακτικές σχεδιασμού και ανάπτυξης.", "VRML: σύνταξη, υλοποιήσεις, βασικά εργαλεία, γεωμετρία, μετασχηματισμοί, επαναχρησιμοποίηση κόμβων, εξωτερικές αναφορές, υλικά/χρώμα, φωτισμός, υφή, viewpoints, background, ήχος, κείμενο, billboards, HUDs.", "Γράφημα σκηνής, υλοποιήσεις (Java3D, VRML/X3D, κ.ά.)", "Σχεδιασμός Κατανεμημένων Περιβαλλόντων Μάθησης", "Σχεδιασμός Κατανεμημένων Περιβαλλόντων Μάθησης", 20 },
                    { 21, "Να εφαρμόζουν πρακτικά τεχνολογίες ασφάλειας πληροφοριακών συστημάτων σε πραγματικές συνθήκες", "Να αναλύει και να συγκρίνει μοντέλα ανάπτυξης λογισμικού", "Να αναπτύσσει native mobile apps κάνοντας χρήση του Android SDK", "Να χρησιμοποιεί πρακτικά τις πλέον σύγχρονες υπηρεσίες Cloud και Mobile backend as a service που παρέχει η Firebase", "Να εφαρμόζουν πρακτικά τεχνολογίες ασφάλειας πληροφοριακών συστημάτων σε πραγματικές συνθήκες", 21 },
                    { 22, "Android Studio", "", "", "", "Android Studio", 22 },
                    { 23, "Να σχεδιάζει και να αναπτύσσει εφαρμογές για κινητές και φορητές συσκευές υλοποιώντας τις πλέον σύγχρονες τεχνικές προγραμματισμού.", "Να εκμεταλλεύεται τοπικές (SQLite) βάσεις δεδομένων.", "Να επιλέγει μοντέλα ανάπτυξης λογισμικού ανάλογα με τις ανάγκες και να τα χρησιμοποιεί.", "Να γνωρίζει τις τεχνικές σηματοδοσίας, διαχείρισης κινητικότητας και το πρωτόκολλο Mobile IP.", "Να γνωρίζει τις τεχνικές σηματοδοσίας, διαχείρισης κινητικότητας και το πρωτόκολλο Mobile IP.", 23 },
                    { 24, "Να διασφαλίζει την αποτελεσματικότητα των λογισμικών μέσω των προαναφερθέντων εφαρμογών.", "Να αναγνωρίζει αρχές σχεδίασης λογισμικού με REST.", "Να αξιοποιεί το εργαλείο Android Studio για την ανάπτυξη κινητών εφαρμογών.", "Να γνωρίζει τις πλέον σύγχρονες υπηρεσίες Cloud και Mobile backend as a service που παρέχει η Firebase", "Να αναγνωρίζει αρχές σχεδίασης λογισμικού με REST.", 24 },
                    { 25, "Σωστό", "Λάθος", "", "", "Σωστό", 25 },
                    { 26, "Σωστό", "Λάθος", "", "", "Λάθος", 26 },
                    { 27, "Δομημένη", "", "", "", "Δομημένη", 27 },
                    { 28, "Scrum", "Firebase", "Rational Unified Process", "DevOps", "Rational Unified Process", 28 },
                    { 29, "Σωστό", "Λάθος", "", "", "Σωστό", 29 },
                    { 30, "Cloud", "", "", "", "Cloud", 30 },
                    { 31, "Σωστό", "Λάθος", "", "", "Σωστό", 31 },
                    { 32, "αντιδρασιακός", "", "", "", "αντιδρασιακός", 32 },
                    { 33, "δομή", "", "", "", "δομή", 33 },
                    { 34, "Cleaning Agents", "Radioactive Agents", "Deliberative Agents", "Federal Agents", "Deliberative Agents", 34 },
                    { 35, "Σωστό", "Λάθος", "", "", "Σωστό", 35 },
                    { 36, "Unity3D", "", "", "", "Unity3D", 36 },
                    { 37, "Σωστό", "Λάθος", "", "", "Λάθος", 37 },
                    { 38, "ενεργώ", "", "", "", "ενεργώ", 38 },
                    { 39, "Maslow", "Khafre", "Djoser", "Cheops", "Maslow", 39 },
                    { 40, "Reactive Agents", "Deliberative Agents", "Κανένα από τα δύο", "Και τα δύο", "Και τα δύο", 40 },
                    { 41, "Σωστό", "Λάθος", "", "", "Σωστό", 41 },
                    { 42, "χαρακτηριστικά", "", "", "", "χαρακτηριστικά", 42 },
                    { 43, "υλοποίησης", "", "", "", "υλοποίησης", 43 },
                    { 44, "First Person", "Educational", "Role-playing", "Fourth Person", "Fourth Person", 44 },
                    { 45, "Σωστό", "Λάθος", "", "", "Σωστό", 45 },
                    { 46, "Unity3D", "", "", "", "Unity3D", 46 },
                    { 47, "Σωστό", "Λάθος", "", "", "Λάθος", 47 },
                    { 48, "C", "C++", "PythonFmu", "C#", "C#", 48 },
                    { 49, "3D μοντέλα", "bolts", "sprites", "animations", "bolts", 49 },
                    { 50, "Παίκτες", "Πράκτορες", "Κανένα από τα δύο", "Και τα δύο", "Και τα δύο", 50 },
                    { 51, "Σωστό", "Λάθος", "", "", "Σωστό", 51 },
                    { 52, "desktop", "", "", "", "desktop", 52 },
                    { 53, "Visual Studio Enterprise Edition", "IntelliJ IDEA", "Visual Studio Code", "QtSpim", "Visual Studio Enterprise Edition", 53 },
                    { 54, "Σωστό", "Λάθος", "", "", "Σωστό", 54 },
                    { 55, "λογισμικού", "", "", "", "λογισμικού", 55 },
                    { 56, "IDEs", "GUIs", "GNUs", "ICPs", "IDEs", 56 },
                    { 57, "Σωστό", "Λάθος", "", "", "Λάθος", 57 },
                    { 58, "αποσφαλμάτωση", "", "", "", "αποσφαλμάτωση", 58 },
                    { 59, "Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", "Να σχεδιάζουν αρχιτεκτονικά σχέδια λογισμικού βασισμένα σε γλώσσες μοντελοποίησης και διαγράμματα.", "Να μαθαίνουν, να αξιολογούν και να εντοπίζουν λογισμικό υλοποιημένο με εργαλεία οπτικού προγραμματισμού.", "Να αναγνωρίζουν και να κατανοούν σύγχρονες τεχνικές σχεδίασης ολοκληρωμένων εφαρμογών λογισμικού με υπηρεσίες.", "Να μαθαίνουν, να αξιολογούν και να εντοπίζουν λογισμικό υλοποιημένο με εργαλεία οπτικού προγραμματισμού.", 59 },
                    { 60, "αποδοτικό", "", "", "", "αποδοτικό", 60 }
                });

            migrationBuilder.InsertData(
                table: "Careers",
                columns: new[] { "Name", "CoefficientName", "NameInGreek" },
                values: new object[,]
                {
                    { "3D Artist/Animator", "ComputerVisionAndGraphics", "Σχεδιαστής Τρισδιάστατων Σχεδίων" },
                    { "Accessibility Specialist", "UI_UX", "Ειδικός Προσβασιμότητας" },
                    { "Android Developer", "MobileAppDev", "Προγραμματιστής Εφαρμογών για Android" },
                    { "Back-End Developer", "WebDev", "Προγραμματιστής Back-End" },
                    { "Big Data Engineer", "DatabaseEngineering", "Μηχανικός Δεδομένων Μεγάλου Όγκου" },
                    { "Cloud Data Engineer", "DatabaseEngineering", "Μηχανικός Δεδομένων Υπολογιστικής Νέφους" },
                    { "Computer Graphics Programmer", "ComputerVisionAndGraphics", "Προγραμματιστής Γραφικών" },
                    { "Computer Vision Engineer", "ComputerVisionAndGraphics", "Μηχανικός Γραφικών Υπολογιστών" },
                    { "Data Architect", "DatabaseEngineering", "Αρχιτέκτονας Δεδομένων" },
                    { "Data Scientist", "AI_ML", "Επιστήμονας Δεδομένων" },
                    { "Database Developer", "DatabaseEngineering", "Προγραμματιστής Βάσεων Δεδομένων" },
                    { "DevOps Engineer", "SoftwareEngineering", "Μηχανικός DevOps" },
                    { "Front-End Developer", "UI_UX", "Προγραμματιστής Front-End" },
                    { "Full-Stack Developer", "SoftwareEngineering", "Προγραμματιστής Full-Stack" },
                    { "Games Designer", "GameDev", "Σχεδιαστής Ηλεκτρονικών Παιχνιδιών" },
                    { "Games Programmer", "GameDev", "Προγραμματιστής Ηλεκτρονικών Παιχνιδιών" },
                    { "Incident Responder", "Security", "Ανταποκριτής Συμβάντων" },
                    { "iOS Developer", "MobileAppDev", "Προγραμματιστής Εφαρμογών για iOS" },
                    { "Level Designer", "GameDev", "Σχεδιαστής Επιπέδων Ηλεκτρονικών Παιχνιδιών" },
                    { "Machine Learning Engineer", "AI_ML", "Μηχανικός Μηχανικής Μάθησης" },
                    { "Mobile App Developer", "MobileAppDev", "Προγραμματιστής Εφαρμογών Κινητών Τηλεφώνων" },
                    { "Mobile UI/UX Designer", "MobileAppDev", "Σχεδιαστής UI/UX για Εφαρμογές Κινητών Τηλεφώνων" },
                    { "N.L.P. Engineer", "AI_ML", "Μηχανικός Επεξεργασίας Φυσικής Γλώσσας" },
                    { "Network Administrator", "ComputerNetworks", "Διαχειριστής Δικτύων" },
                    { "Network Engineer", "ComputerNetworks", "Μηχανικός Δικτύων" },
                    { "Network Security Specialist", "ComputerNetworks", "Ειδικός Ασφάλειας Δικτύων" },
                    { "Penetration Tester", "Security", "Ελεγκτής Διείσδυσης" },
                    { "Robotics Engineer", "AI_ML", "Μηχανικός Ρομποτικής" },
                    { "Security Analyst", "Security", "Αναλυτής Ασφαλείας" },
                    { "Security Engineer", "Security", "Μηχανικός Ασφαλείας" },
                    { "Software Consultant", "SoftwareEngineering", "Σύμβουλος Λογισμικού" },
                    { "Software Developer", "SoftwareEngineering", "Προγραμματιστής Λογισμικού" },
                    { "UI/UX Designer", "UI_UX", "Σχεδιαστής UI/UX" },
                    { "Virtual Reality Developer", "ComputerVisionAndGraphics", "Προγραμματιστής Εικονικής Πραγματικότητας" },
                    { "Visual Designer", "UI_UX", "Οπτικός Σχεδιαστής" },
                    { "Web App Developer", "WebDev", "Προγραμματιστής Διαδικτυακών Εφαρμογών" },
                    { "Web Designer", "WebDev", "Σχεδιαστής Ιστοσελίδων" }
                });

            migrationBuilder.InsertData(
                table: "Coefficients",
                columns: new[] { "Name", "NameInGreek" },
                values: new object[,]
                {
                    { "AI_ML", "Τεχνητή Νοημοσύνη και Μηχανική Μάθηση" },
                    { "ComputerNetworks", "Δίκτυα Υπολογιστών" },
                    { "ComputerVisionAndGraphics", "Ανάλυση Εικόνας και Γραφικών" },
                    { "DatabaseEngineering", "Ανάπτυξη Βάσεων Δεδομένων και Επιστήμη Δεδομένων" },
                    { "GameDev", "Ανάπτυξη Ηλεκτρονικών Παιχνιδιών" },
                    { "MobileAppDev", "Ανάπτυξη Εφαρμογών Κινητών Τηλεφώνων" },
                    { "Security", "Ασφάλεια" },
                    { "SoftwareEngineering", "Τεχνολογία Λογισμικού" },
                    { "UI_UX", "Αλληλεπίδραση Ανθρώπου-Υπολογιστή" },
                    { "WebDev", "Ανάπτυξη Διαδικτυακών Εφαρμογών" }
                });

            migrationBuilder.InsertData(
                table: "CourseHasCoefficients",
                columns: new[] { "CoefficientName", "CourseId", "Value" },
                values: new object[,]
                {
                    { "MobileAppDev", 1, 10 },
                    { "SoftwareEngineering", 1, 10 },
                    { "MobileAppDev", 2, 5 },
                    { "MobileAppDev", 3, 2 },
                    { "GameDev", 4, 6 },
                    { "AI_ML", 5, 10 },
                    { "GameDev", 5, 9 },
                    { "GameDev", 6, 10 },
                    { "Security", 7, 8 },
                    { "Security", 8, 10 },
                    { "ComputerNetworks", 9, 7 },
                    { "Security", 9, 10 },
                    { "ComputerNetworks", 10, 3 },
                    { "UI_UX", 10, 3 },
                    { "WebDev", 10, 5 },
                    { "UI_UX", 11, 10 },
                    { "AI_ML", 12, 7 },
                    { "ComputerVisionAndGraphics", 12, 6 },
                    { "AI_ML", 13, 8 },
                    { "AI_ML", 14, 9 },
                    { "DatabaseEngineering", 14, 10 },
                    { "DatabaseEngineering", 15, 6 },
                    { "DatabaseEngineering", 16, 10 },
                    { "WebDev", 17, 9 },
                    { "WebDev", 18, 10 },
                    { "ComputerNetworks", 19, 10 },
                    { "ComputerVisionAndGraphics", 20, 10 },
                    { "SoftwareEngineering", 21, 10 },
                    { "SoftwareEngineering", 22, 10 },
                    { "ComputerVisionAndGraphics", 23, 9 }
                });

            migrationBuilder.InsertData(
                table: "Courses",
                columns: new[] { "Id", "AudioFileName", "Content", "Description", "Name", "Semester", "UUID" },
                values: new object[,]
                {
                    { 1, "correct.mp3", "Αντικείμενο Μαθήματος:\r\n                        1. Μοντέλα ανάπτυξης λογισμικού: Μοντέλο καταρράκτη, Σπειροειδές μοντέλο, Μοντέλο Πρωτοτύπου, Rational Unified Process.\r\n                        2. Προϋπολογισμός κόστους λογισμικού.\r\n                        3. Ανάλυση απαιτήσεων: Δομημένη Ανάλυση και Αντικειμενοστρεφής Ανάλυση.\r\n                        4. Σχεδιασμός: Αρχιτεκτονικός σχεδιασμός, λεπτομερής σχεδιασμός, Δομημένος και Αντικειμενοστρεφής σχεδιασμός.\r\n                        5. Ανάπτυξη εφαρμογών, οι οποίες μπορούν να εκτελεστούν από σύγχρονες κινητές συσκευές (smartphones) με ενσωματωμένο λειτουργικό σύστημα. Οι εφαρμογές αυτές δύναται να λειτουργήσουν τόσο στα σύγχρονα «έξυπνα» τηλέφωνα \"smartphones\", όσο και σε άλλες «κινητές» συσκευές, οι οποίες έχουν κάνει την εμφάνισή τους τα τελευταία χρόνια και χρησιμοποιούν λειτουργικό σύστημα (Tablets, Wearables).\r\n\r\n                        Στο μάθημα αναλύονται περιληπτικά τα δημοφιλέστερα λειτουργικά συστήματα κινητών συσκευών, καθώς και τα εργαλεία ανάπτυξης εφαρμογών σε αυτά, ωστόσο η ύλη περιλαμβάνει κυρίως τη χρήση της αντικειμενοστρεφούς γλώσσας προγραμματισμού Java, για την ανάπτυξη εφαρμογών σε κινητές συσκευές υπό το λειτουργικό σύστημα Android. Ενδεικτικά, η ανάπτυξη των mobile apps υλοποιείται με τη χρήση του περιβάλλοντος ανάπτυξης λογισμικού Android Studio.\r\n                        Επιπλέον το μάθημα καλύπτει και την ύλη που αφορά στους αισθητήρες των κινητών συσκευών, στις υπηρεσίες γεοεντοπισμού και σε πλήθος άλλων προχωρημένων τεχνικών προγραμματισμού (asynchronous programming, android services, broadcast receivers, android intents).\r\n\r\n                        Μαθησιακά αποτελέσματα:\r\n                        • Να αναλύει και να συγκρίνει μοντέλα ανάπτυξης λογισμικού.\r\n                        • Να επιλέγει μοντέλα ανάπτυξης λογισμικού ανάλογα με τις ανάγκες και να τα χρησιμοποιεί.\r\n                        • Να αξιοποιεί το εργαλείο Android Studio για την ανάπτυξη κινητών εφαρμογών.\r\n                        • Να αναπτύσσει native mobile apps κάνοντας χρήση του Android SDK.\r\n                        • Να εκμεταλλεύεται τοπικές (SQLite) βάσεις δεδομένων.\r\n                        • Να γνωρίζει τις πλέον σύγχρονες υπηρεσίες Cloud και Mobile backend as a service που παρέχει η Firebase\r\n                        • Να χρησιμοποιεί πρακτικά τις πλέον σύγχρονες υπηρεσίες Cloud και Mobile backend as a service που παρέχει η Firebase\r\n                        • Να σχεδιάζει και να αναπτύσσει εφαρμογές για κινητές και φορητές συσκευές υλοποιώντας τις πλέον σύγχρονες τεχνικές προγραμματισμού.\r\n                        • Να διασφαλίζει την αποτελεσματικότητα των λογισμικών μέσω των προαναφερθέντων εφαρμογών.", "", "Σύγχρονα Θέματα Τεχνολογίας Λογισμικού", 7, "ΠΛΘΕΤΚΑΕ01" },
                    { 2, "correct.mp3", "Αντικείμενο του μαθήματος είναι η ανάπτυξη εφαρμογών βάσει του αντικειμενοστρεφούς μοντέλου ανάπτυξης λογισμικού. Η γλώσσα προγραμματισμού που χρησιμοποιείται ως βάση είναι η C#, που θεωρείται από τις πλέον σύγχρονες αντικειμενοστρεφείς γλώσσες. Στο πλαίσιο του μαθήματος δίνεται ιδιαίτερη έμφαση στα εργαλεία ανάπτυξης εφαρμογών, ολοκληρωμένα περιβάλλοντα ανάπτυξης (IDEs) και συγκεκριμένα το εργαλείο που χρησιμοποιείται είναι το Visual Studio Enterprise Edition. Με τη χρήση του Visual Studio και της C# ως γλώσσας προγραμματισμού, οι φοιτητές μαθαίνουν να αναπτύσσουν desktop, web, ή/και mobile εφαρμογές, γρήγορα, αποδοτικά και κυρίως με την όσο το δυνατόν μικρότερη πιθανότητα να κάνουν λάθη προγραμματισμού ή/και λογικής.\r\n\r\n                Μαθησιακά αποτελέσματα:\r\n                • Να χρησιμοποιεί ολοκληρωμένα περιβάλλοντα ανάπτυξης λογισμικού.\r\n                • Να παράγει εφαρμογές με αποδοτικό και ταχύ ρυθμό\r\n                • Να γνωρίζει τις βασικές αρχές της γλώσσας C#\r\n                • Να κάνει αποσφαλμάτωση λογισμικού με τα πλέον σύγχρονα εργαλεία\r\n                • Να αναπτύσσει λογισμικό για ένα μεγάλο πλήθος από πεδία, συμπεριλαμβανομένων των παραθυρικών εφαρμογών, των εφαρμογών κονσόλας, των εφαρμογών web και των mobile εφαρμογών\r\n                • Να εκτίθεται σε σύγχρονες τεχνικές προγραμματισμού με στόχο την ποιότητα του παραγόμενου λογισμικού, καθώς και την ταχύτητα ανάπτυξης σύνθετων και πολύπλοκων προγραμμάτων/έργων\r\n                • Να μαθαίνει να αξιολογεί και να εντοπίζει λογισμικό υλοποιημένο με εργαλεία οπτικού προγραμματισμού", "", "Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών", 3, "ΠΛΠΛΗ37-3" },
                    { 3, "correct.mp3", "Αντικείμενο μαθήματος:\r\n            1. Αναζήτηση, ανάλυση και σύνθεση δεδομένων και πληροφοριών, με τη χρήση και των απαραίτητων τεχνολογιών.\r\n            2. Αυτόνομη εργασία.\r\n            3. Ομαδική εργασία.\r\n            4. Σχεδιασμός και διαχείριση έργων.\r\n            5. Προσαρμογή σε νέες καταστάσεις.\r\n                Το κύριο αντικείμενο του μαθήματος είναι η εισαγωγή στον αντικειμενοστρεφή προγραμματισμό με πλήρη ανάλυση της γλώσσας προγραμματισμού JAVA. Βασικές δομές, κληρονομικότητα, εντολές, ειδικές κλάσεις, εξαιρέσεις, ειδικά θέματα, βιβλιοθήκες/διαπροσωπίες,  προσπέλαση αρχείων και Βάσεων, κα.  \r\n            Μαθησιακά αποτελέσματα:\r\n                • Να γνωρίζουν τις βασικές αρχές που διέπουν τον αντικειμενοστρεφή προγραμματισμό\r\n                • Να υλοποιούν αντικειμενοστρεφή προγράμματα\r\n                • Να σχεδιάζουν, να αναπτύσσουν και να υλοποιούν λογισμικό ως λύσεις σε προβλήματα, αποτελούμενο από αντικείμενα και αλλληλεπιδράσεις αυτών.\r\n                • Να δημιουργούν τάξεις, διεπαφές και αντικείμενα.\r\n                • Να χρησιμοποιούν σωστά τους modifiers της γλώσσας Java.\r\n                • Να διαχειρίζονται αποτελεσματικά και με χρήση των κατάλληλων εργαλείων τις εξαιρέσεις που ανακύπτουν\r\n                • Να χειρίζονται αρχεία προορισμένα για ανάγνωση και αποθήκευση δεδομένων\r\n                • Να συμβαδίζουν με τις εναλασσόμενες τεχνολογικές απαιτήσεις καθώς εκτίθενται σε σύγχρονες τεχνικές προγραμματισμού με στόχο την ποιότητα του λογισμικού τους\r\n                • Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", "", "Αντικειμενοστρεφής Προγραμματισμός", 2, "ΠΛΠΛΗ37-2" },
                    { 4, "correct.mp3", "Η Εικονική Πραγματικότητα είναι το επιστημονικό πεδίο με αντικείμενο την αναπαράσταση κόσμων με τη βοήθεια ηλεκτρονικών υπολογιστών. Τα γραφικά με υπολογιστές διαδραματίζουν βασικό ρόλο στην Εικονική Πραγματικότητα, ενώ άλλα θέματα εξ’ ίσου σημαντικά είναι ο ήχος και το υλικό αλληλεπίδρασης με τους χρήστες. Η Εικονική Πραγματικότητα, κυρίως μέσω των Ευφυών Εικονικών Συστημάτων, έχει πλήθος εφαρμογών στην εκπαίδευση, την ψυχαγωγία, την προσομοίωση, την αλληλεπίδραση ανθρώπου – υπολογιστή και την επιστημονική έρευνα.\r\n \r\nΣκοποί του μαθήματος:\r\nΣτόχος του μαθήματος είναι η εξοικείωση των φοιτητών με τις βασικές θεωρητικές αρχές στις οποίες στηρίζεται η Εικονική Πραγματικότητα, καθώς και με σύγχρονες τεχνολογίες, μεθόδους και εργαλεία για τη δημιουργία ολοκληρωμένων εφαρμογών Εικονικής Πραγματικότητας.\r\n \r\nΔομή του μαθήματος:\r\nΚατά τη διάρκεια του μαθήματος θα καλυφθούν οι παρακάτω διδακτικές ενότητες:\r\n•	Eισαγωγή στην Εικονική Πραγματικότητα, ιστορική αναδρομή, βασικές έννοιες, στόχοι, εφαρμογές.\r\n•	Εισαγωγή στα Γραφικά με Υπολογιστές, συστήματα απεικόνισης, χρώμα, γεωμετρικά σχήματα, μετασχηματισμοί, κίνηση.\r\n•	Γράφημα σκηνής, υλοποιήσεις (Java3D, VRML/X3D, κ.ά.)\r\n•	VRML: σύνταξη, υλοποιήσεις, βασικά εργαλεία, γεωμετρία, μετασχηματισμοί, επαναχρησιμοποίηση κόμβων, εξωτερικές αναφορές, υλικά/χρώμα, φωτισμός, υφή, viewpoints, background, ήχος, κείμενο, billboards, HUDs.\r\n•	VRML: sensors και animation, γενικές αρχές μοντελοποίησης σκελετού, πρότυπα μοντελοποίησης κίνησης σώματος (H-Anim, κ.ά.), scripting, ενσωμάτωση σε εφαρμογές, PROTOs, προτεινόμενες πρακτικές σχεδιασμού και ανάπτυξης.\r\n•	Συστήματα υλικού και λογισμικού Εικονικής Πραγματικότητας.\r\n•	Second Life και OpenSimulator.\r\n\r\n\r\nΑντικείμενο μαθήματος:\r\n1. Δομή και λειτουργία ενός συστήματος εικονικής πραγματικότητας. Υλικό, Λογισμικό.\r\n2. Κατηγορίες συστημάτων Εικονικής Πραγματικότητας.\r\n3. Κόσμοι τρισδιάστατων γραφικών. Τρισδιάστατα μοντέλα αντικειμένων.\r\n4. Υφή επιφάνειας αντικειμένων. Διαχείριση πηγών φωτός, ήχων, κάμερας. Animations.\r\n5. Το περιβάλλον Unity3D.\r\n6. Ανάπτυξη εφαρμογών εικονικής πραγματικότητας στην πλατφόρμα Unity3D.\r\n\r\nΜαθησιακά αποτελέσματα:\r\n• Γνωρίζει τις συνιστώσες ενός συστήματος Εικονικής Πραγματικότητας.\r\n• Κατανοεί τις παραμέτρους ανάπτυξης συστημάτων Εικονικής Πραγματικότητας στο περιβάλλον της Unity3D.\r\n• Αναπτύσσει και υλοποιεί εφαρμογές εικονικής πραγματικότητας στο περιβάλλον της Unity3D.\r\n• Κατανοεί τη διαχείριση τρισδιάστατων μοντέλων αντικειμένων, κάμερας, ήχου, διάφορα είδη υφής, animations, κ.λπ.\r\n• Ανακαλύπτει διάφορα μοντέλα εικονικής πραγματικότητας στο Διαδίκτυο.\r\n• Συνδυάζει και ενσωματώνει τα παραπάνω, σε ένα ολοκληρωμένο λειτουργικό σύστημα Εικονικής Πραγματικότητας.\r\n• Εντοπίζει και αξιολογεί τα δεδομένα τυχόν προβλημάτων σε λειτουργικό επίπεδο.\r\n• Εφευρίσκει τρόπους επίλυσης των προβλημάτων και βελτιστοποίησης των λειτουργιών στα εικονικά περιβάλλοντα.", "", "Εικονική Πραγματικότητα", 7, "ΠΛΕΙΚ03" },
                    { 5, "correct.mp3", "1. Δομή και την λειτουργία ενός ευφυούς πράκτορα μέσα σε ένα περιβάλλον.\r\n            2. Αντιδρασιακοί πράκτορες (Reactive Agents) και Βουλητικοί πράκτορες (Deliberative Agents).\r\n            3. Ο κύκλος αντιλαμβάνομαι-αποφασίζω-ενεργώ (Sense-Decide-Act).\r\n            4. Tο μοντέλο BDI (Belief-Desire-Intention), εύρεση μονοπατιού (path finding), αναπαράσταση ενεργειών (action representation).\r\n            5. O σχεδιασμός ενεργειών (plan generation), ο σχεδιασμός ενεργειών, βασισμένος σε κίνητρα και η πυραμίδα του Maslow.\r\n            6. Η συναισθηματική υπολογιστική σε ευφυείς πράκτορες.\r\n            7. Η ανάπτυξη σχετικών συστημάτων ευφυών πρακτόρων.\r\n            8. Οι εφαρμογές στην πλατφόρμα Unity3D.\r\n\r\n                Μαθησιακά αποτελέσματα:\r\n            Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος ο φοιτητής :\r\n                • κατανοεί την δομή ενός ευφυούς πράκτορα,\r\n                • αναγνωρίζει τα χαρακτηριστικά τη λειτουργίας ενός ευφυούς πράκτορα και τους τρόπους επικοινωνίας του με ένα περιβάλλον,\r\n                • διακρίνει και εκτιμά πότε είναι απαραίτητος ένας Αντιδρασιακός πράκτορας (Reactive Agent) και πότε Βουλητικός πράκτορας (Deliberative Agent),\r\n                • εφαρμόζει τα μοντέλα “αντιλαμβάνομαι-αποφασίζω-ενεργώ” (Sense-Decide-Act), BDI (Belief-Desire-Intention), σε διάφορες περιπτώσεις πρακτόρων,\r\n                • αναπτύσσει αλγορίθμους για εύρεση μονοπατιού (path finding), και σχεδιασμό ενεργειών (plan generation),\r\n                • αξιολογεί πότε είναι απαραίτητο να εφαρμοστεί σχεδιασμός ενεργειών βασισμένος σε κίνητρα και συναισθηματική υπολογιστική σε ευφυείς πράκτορες.", "", "Ευφυείς Πράκτορες", 8, "ΠΛΕΥΠΡ01" },
                    { 6, "correct.mp3", "1.	Ο ρόλος των παιχνιδιών ως εργαλείων εκπαίδευσης, απόκτησης δεξιοτήτων και προσομοίωσης σε διάφορους τομείς, όπως  εκπαίδευση, υγεία και επιχειρηματικές διεργασίες. \r\n2.	Τύποι και κατηγορίες ηλεκτρονικών παιχνιδιών. Shoot-them-up, Role-playing, Adventure, First Person, Third Person, Δικτυακά παιχνίδια πολλών Παικτών. MMORPGs, Serious Games, Educational Games\r\n3.	Τύποι και χαρακτηριστικά παιχνιδιών. Επισκόπηση χαρακτηριστικών παραδειγμάτων παιχνιδιών σοβαρού σκοπού που έχουν αναπτυχθεί για διάφορους τομείς.\r\n4.	Σχεδίαση ενός παιχνιδιού: ο κόσμος, οι χαρακτήρες (παίκτες και πράκτορες) και οι ενέργειες τους, τα επίπεδα του παιχνιδιού. Αρχές και μεθοδολογίες σχεδίασης. Παρουσίαση των σχετικών εννοιών μέσω της σχεδίασης ενός απλού εκπαιδευτικού παιχνιδιού σε ένα εκπαιδευτικό προγραμματιστικό περιβάλλον, όπως το Unity3D. Αξιολόγηση της ποιότητας σχεδίασης υπαρχόντων παιχνιδιών σοβαρού σκοπού. Εργαλεία, μηχανές και διασυνδέσεις προγραμματισμού παιχνιδιών.\r\n5.	Προγραμματισμός παιχνιδιών: ο βρόχος του παιχνιδιού, αρχιτεκτονική του παιχνιδιού, γραφική διασύνδεση, αλληλεπίδραση και χειρισμός συμβάντων, κείμενο, 2D/3D γραφικά και κίνηση, πίνακες και συλλογές αντικειμένων.\r\n6.	Σχεδίαση ενός παιχνιδιού σοβαρού σκοπού χρησιμοποιώντας σύγχρονες μηχανές παιχνιδιών/βιβλιοθήκες και προγραμματισμός του παιχνιδιού σε C#.\r\n7.	Το περιβάλλον Unity3D. Ανάπτυξη ηλεκτρονικών παιχνιδιών στην πλατφόρμα Unity3D.\r\n \r\nΜαθησιακοί στόχοι:\r\nΣτόχος του μαθήματος είναι να αποκτήσουν οι φοιτητές: \r\n(α) βασικές γνώσεις για τον ρόλο, τους τύπους και τα χαρακτηριστικά των παιχνιδιών, καθώς και για τη συνολική διαδικασία δημιουργίας ενός παιχνιδιού,\r\n(β) ικανότητες σχεδίασης και υλοποίησης παιχνιδιών αξιοποιώντας σύγχρονα εργαλεία, διασυνδέσεις και γλώσσες προγραμματισμού,\r\n(γ) γνώσεις και ικανότητες χρήσης/δημιουργίας μετρικών αξιολόγησης παιχνιδιών βάσει των στόχων που τέθηκαν κατά τη σχεδίασή τους.\r\n\r\nΜαθησιακά αποτελέσματα:\r\n• Αναγνωρίζει τις συνιστώσες ενός ηλεκτρονικού παιχνιδιού (Computer Game).\r\n• Κατανοεί τις συνιστώσες των σοβαρών και εκπαιδευτικών παιχνιδιών (serious games, educational games)\r\n• Συνοψίζει τις απαιτούμενες γνώσεις σχετικά με την ανάπτυξη ηλεκτρονικών παιχνιδιών στο περιβάλλον της Unity3D.\r\n• Αναπτύσει εφαρμογές ηλεκτρονικών παιχνιδιών στο περιβάλλον της Unity3D\r\n• Ανακαλύπτει τους τρόπους διαχείρισης των διαφόρων συστατικών ενός ηλεκτρονικού παιχνιδιού, κ.λπ.\r\n• Μαθαίνει να ανακαλύπτει διάφορα συστατικά ηλεκτρονικών παιχνιδιών στο Διαδίκτυο (π.χ. 3D μοντέλα, sprites, animations, κ.λπ.)\r\n• Συνδυάζει όλα τα παραπάνω στο πλαίσιο του σχεδιασμού και της ανάπτυξης ενός ολοκληρωμένου ηλεκτρονικού παιχνιδιού.", "", "Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών", 7, "ΠΛΤΑΗΠ01" },
                    { 7, "correct.mp3", "Η κρυπτογραφία αποτελεί τα θεμέλια της ασφάλειας υπολογιστικών συστημάτων. Βασικό σκοπός είναι οι φοιτητές να αποκτήσουν το απαραίτητοθεωρητικό υπόβαθρο για την κατασκευή προγραμμάτων ή συσκευών οι οποίες ανταλλάσσουν δεδομένα με ασφάλεια μέσα σε μη ασφαλείς χώρους όπως τοδιαδίκτυο.\r\n                Αντικείμενο μαθήματος:\r\n            1. Ιστορική εξέλιξη της κρυπτογραφίας\r\n            2. Επανάληψη του απαραίτητου μαθηματικού υπόβαθρου (Ομάδες, Πεπερασμένα σώματα, Δακτύλιοι Zp και Zn, Πράξεις με υπόλοιπα, Γενικευμένος αλγόριθμος του Ευκλείδη, συνάρτηση του Euler)\r\n            3. Αλγόριθμοι ιδιωτικού κλειδιού (Μονοαλφαβητική αντικατάσταση, One-Time-Pad, Αλγόριθμοι των : Καίσαρα, Vigenere, Hill)\r\n            4. Αλγόρθιμοι τμημάτων: καταστάσεις (cipher modes: ECB, CBC, OFB κτλ) DES, AES\r\n            5. Αλγόριθμοι ροής: PRNG vs TRNG, LFSR, RC4\r\n            6. Αλγόριθμοι δημοσίου κλειδιού (Αλγόριθμος RSA,Αλγόριθμος ελλειπτικών καμπυλών)\r\n            7. Ομομορφική κρυπτογραφία\r\n            8. Συναρτήσεις κατακερματισμού\r\n            9. Ψηφιακές Υπογραφές\r\n            10. Εφαρμογές της κρυπτογραφίας και πρωτόκολλα\r\n            11. Κρυπτανάλυση (Γραμμική και διαφορική κρυπτανάλυση, Αλγόριθμοι παραγοντοποίησης)\r\n            12. Θέματα υλοποίησης\r\n\r\n                Μαθησιακά αποτελέσματα:\r\n            Μετά την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα είναι σε θέση:\r\n                • Να αξιολογήσουν την ασφάλεια που προσφέρει ένας αλγόριθμος κρυπτογράφησης.\r\n                • Να διακρίνουν και να κατηγοριοποιούν τα είδη και τη χρήση των αλγόριθμων.\r\n                • Να επιλέξουν τον κατάλληλο αλγόριθμο και να διακρίνουν τις παραμέτρους της ορθής ταση λειτουργίας του για την επιτυχή εφαρμογή του.\r\n                • Να υλοποιήσουν έναν αλγόριθμο κρυπτογράφησης.\r\n                • Να κατανοούν σε βάθος τις εφαρμογές και τα πρωτόκολλα της κρυπτογραφίας.\r\n                • Να γνωρίζουν τις μεθόδους και παραμέτρους σχεδιασμού και ανάπτυξης πρωτοκόλλων.\r\n                • Να εντοπίζουν και να αξιολογούν πιθανά κενά ασφάλειας ενός πρωτοκόλλου.\r\n                • Να αξιοποιούν όλα τα παραπάνω για την ανάπτυξη και τον έλεγχο προγραμμάτων", "", "Κρυπτογραφία", 5, "ΠΛΚΡΥ01" },
                    { 8, "correct.mp3", "Αντικείμενο μαθήματος:\r\nΗ ασφάλεια της πληροφορίας, των συστημάτων και των εφαρμογών, αποτελεί βασική απαίτηση κατά την ανάπτυξη και λειτουργία πληροφοριακών συστημάτων. Το μάθημα καλύπτει βασικά ζητήματα της ασφάλειας πληροφοριακών συστημάτων και περιλαμβάνει τις εξής ενότητες:\r\n1. Εισαγωγικές έννοιες ασφάλειας συστημάτων.\r\n2. Συστήματα Διαχείρισης Ασφάλειας.\r\n3. Κρυπτογραφικά συστήματα.\r\n4. Υποδομή Δημόσιας Κλείδας.\r\n5. Έλεγχος προσπέλασης – Ιδιωτικότητα.\r\n6. Ασφάλεια στις Τεχνολογίες.\r\n7. Ασφαλείς η/κ-υπηρεσίες.\r\n8. Εισαγωγή στην ασφάλεια δικτύων.\r\n\r\nΜαθησιακά αποτελέσματα:\r\nΜε την ολοκλήρωση του μαθήματος οι φοιτητές θα μπορούν να:\r\n• Αναγνωρίζουν και να κατανοούν το περιεχόμενο των απαιτήσεων ασφάλειας πληροφοριακών συστημάτων σε όλο των κύκλο ζωής τους.\r\n• Αντιλαμβάνονται και να εντοπίζουν τα θεωρητικά και πρακτικά ζητήματα ασφάλειας πληροφοριακών συστημάτων.\r\n• Κατανοούν τα δομικά και λειτουργικά χαρακτηριστικά των κρυπτογραφικών συστημάτων.\r\n• Εμβαθύνουν σε βασικούς τομείς του πεδίου αυτού και να υλοποιούν (μέσω προσομοίωσης) τεχνικές ή εφαρμογές σε δεδομένες καταστάσεις απειλών ή κινδύνων.\r\n• Εφαρμόζουν πρακτικά τεχνολογίες ασφάλειας πληροφοριακών συστημάτων σε πραγματικές συνθήκες.\r\n• Σχεδιάζουν νέες εφαρμογές και να επεκτείνουν τις ήδη υπάρχουσες.\r\n• Διαχειρίζονται απειλές και κινδύνους στα πληροφοριακά συστήματα με κριτική, δημιουργική και ερευνητική διάθεση για την εξεύρεση λύσεων.", "", "Ασφάλεια Πληροφοριακών Συστημάτων", 7, "ΠΛΠΛΗ47" },
                    { 9, "correct.mp3", "Αντικείμενο μαθήματος:\r\nΣκοπός του μαθήματος είναι η θεωρητική και πρακτική μελέτη θεμάτων ασφάλειας σε όλα τα επίπεδα δικτύων. Στο πλαίσιο του μαθήματος θα αναλυθούν οι παρακάτω ενότητες:\r\n1. Εισαγωγή στην ασφάλεια δικτύων.\r\n2. Ασφάλεια Δρομολόγησης.\r\n3. Σχεδιασμός συστημάτων Firewall.\r\n4. Ιδιωτικά Εικονικά Δίκτυα (VPN).\r\n5. Ασφάλεια επιπέδου δικτύου (IPSec).\r\n6. Ασφάλεια επιπέδου συνόδου (SSL/TLS).\r\nΜαθησιακά αποτελέσματα:\r\nΜετά την ολοκλήρωση του μαθήματος οι φοιτητές θα είναι σε θέση:\r\n• Να κατανοούν βασικές εννοιών ασφάλειας σε όλα τα επίπεδα των υπολογιστικών δικτύων με έμφαση στα TCP/IP δίκτυα.\r\n• Να διακρίνουν τα τρωτά σημεία στα συστήματα αυτά.\r\n• Να προβλέπουν τυχόν αδυναμίες και αστοχίες.\r\n• Να αναζητούν και να εφευρίσκουν/ανακαλύπτουν τρόπους επίλυσης/διαχείρισης για την περιστολή των τρωτών σημείων.\r\n• Να σχεδιάζουν, λαμβάνοντας υπόψη την ανάλυση των δεδομένων, νέες τεχνικές/μεθόδους.\r\n• Να προχωρούν σε πρακτική εφαρμογή συστημάτων ασφάλειας δικτύων, με έμφαση στη χρήση ελεύθερου λογισμικού / λογισμικού ανοικτού κώδικα.", "", "Ασφάλεια Δικτύων", 8, "ΠΛΑΣΦΔ01" },
                    { 10, "correct.mp3", "Αντικειμενο μαθήματος:\r\n• Στο μάθημα αυτό περιγράφονται με εισαγωγικό, αλλά πλήρη, τρόπο οι τεχνολογίες και τα πρωτόκολλα πάνω στα οποία στηρίζονται το Διαδίκτυο και ο Παγκόσμιος Ιστός και αναλύονται με περισσότερη λεπτομέρεια η ανάπτυξη εφαρμογών με τη χρήση συγκεκριμένων εργαλείων/γλωσσών, οι οποίες εκτελούνται στην πλευρά του πελάτη ή/και στην πλευρά του εξυπηρετητή.\r\n\r\n• Μερικές από τις έννοιες οι οποίες αντιμετωπίζονται είναι: στοίβα πρωτοκόλλων TCP/IP, επίπεδο μεταφοράς και διαδικτύου, HTML5, CSS3, Javascript, jQuery, κλήση AJAX, PHP nodejs, XML και JSON.\r\n\r\nΜαθησιακά αποτελέσματα:\r\nΜε την επιτυχή ολοκλήρωση του μαθήματος ο φοιτητής / τρια θα είναι σε θέση να:\r\n• Αναγνωρίζει τις βασικές αρχές των πρωτοκόλλων που στηρίζουν το Διαδίκτυο, με έμφαση στο IP και το TCP.\r\n• Έχει κατανοήσει τα βασικά χαρακτηριστικά εφαρμογών του διαδικτύου, τη δομή τους, τους στόχους τους όπως και τη διασύνδεσή τους.\r\n• Έχει διακρίνει και εμβαθύνει στις των βασικές τεχνικές και εργαλεία, η αξιοποίηση των οποίων διασφαλίζει τον προγραμματισμό και τον άρτιο έλεγχο μιας τέτοιας εφαρμογής.\r\n• Αξιοποιείτις προγραμματιστικές τεχνικές σε συνδυασμό με τη θεωρία του μαθήματος για αποδοτικότερο σχεδιασμό, βελτιστοποίση απόδοσης και λειτουργική/αποτελεσματική δημιουργία εφαρμογών στο διαδίκτυο.\r\n• Αναλύει, συγκρίνει, αξολογεί και προτείνει εναλλακτικές σχετικά με υπάρχουσες διαδικτυακές εφαρμογές και πιθανά προβλήματα απόδοσής τους.και με παραδοσιακές μεθόδους/εργαλεία.\r\n• Συνεργάζεται με τους συμφοιτητές του στη δημιουργία και εκτέλεση απλών και σύνθετων εφαρμογών διαδικτύου.", "", "Τεχνολογίες Διαδικτύου", 1, "ΠΛΠΛΗ90" },
                    { 11, "correct.mp3", "", "", "Αλληλεπίδραση Ανθρώπου και Υπολογιστή", 5, "ΠΛΠΛΗ20" },
                    { 12, "correct.mp3", "", "", "Αναγνώριση Προτύπων", 5, "ΠΛΠΛΗ81-2" },
                    { 13, "correct.mp3", "", "", "Τεχνητή Νοημοσύνη και Έμπειρα Συστήματα", 6, "ΠΛΠΛΗ18-1" },
                    { 14, "correct.mp3", "", "", "Αναλυτική Δεδομένων", 6, "ΠΛΑΝΑΔΕ01" },
                    { 15, "correct.mp3", "", "", "Βάσεις Δεδομένων", 4, "ΠΛΠΛΗ30-1" },
                    { 16, "correct.mp3", "", "", "Συστήματα Διαχείρισης Βάσεων Δεδομένων", 5, "ΠΛΠΛΗ33-2" },
                    { 17, "correct.mp3", "", "", "Προγραμματισμός στο Διαδίκτυο και στον Παγκόσμιο Ιστό", 4, "ΠΛΔΠΙ01" },
                    { 18, "correct.mp3", "", "", "Πληροφοριακά Συστήματα στο Διαδίκτυο", 8, "ΠΛΣΥΔ01" },
                    { 19, "correct.mp3", "", "", "Δίκτυα Υπολογιστών", 4, "ΠΛΠΛΗ44" },
                    { 20, "correct.mp3", "", "", "Ανάλυση Εικόνας", 7, "ΠΛΕΙΚ01" },
                    { 21, "correct.mp3", "", "", "Τεχνολογία Λογισμικού", 6, "ΠΛΠΛΗ46" },
                    { 22, "correct.mp3", "", "", "Πρότυπα Ανάπυτξης Λογισμικού", 6, "ΠΛΠΡΑΝΑΛ01" },
                    { 23, "correct.mp3", "", "", "Συστήματα Πολυμέσων", 6, "ΠΛΠΛΗ48" }
                });

            migrationBuilder.InsertData(
                table: "PostGraduateInstitutionHasCoefficients",
                columns: new[] { "CoefficientName", "PostGraduateInstitutionId", "HasCoefficient" },
                values: new object[,]
                {
                    { "AI_ML", 1, true },
                    { "DatabaseEngineering", 1, true },
                    { "AI_ML", 2, true },
                    { "DatabaseEngineering", 2, true },
                    { "Security", 2, true },
                    { "AI_ML", 3, true },
                    { "SoftwareEngineering", 3, true },
                    { "Networks", 4, true },
                    { "Security", 4, true },
                    { "WebDev", 4, true },
                    { "Networks", 5, true },
                    { "Security", 5, true },
                    { "Security", 6, true },
                    { "WebDev", 6, true },
                    { "AI_ML", 7, true },
                    { "DatabaseEngineering", 7, true },
                    { "Networks", 8, true },
                    { "AI_ML", 9, true },
                    { "Networks", 9, true },
                    { "WebDev", 9, true },
                    { "AI_ML", 10, true },
                    { "DatabaseEngineering", 10, true },
                    { "SoftwareEngineering", 11, true },
                    { "ComputerVisionAndGraphics", 12, true },
                    { "GameDev", 12, true },
                    { "MobileAppDev", 13, true },
                    { "UI_UX", 13, true },
                    { "WebDev", 13, true },
                    { "UI_UX", 14, true }
                });

            migrationBuilder.InsertData(
                table: "PostGraduateInstitutions",
                columns: new[] { "Id", "Department", "Description", "Hyperlink", "Name", "Town" },
                values: new object[,]
                {
                    { 1, "Επιστήμη Δεδομένων και Μηχανική Μάθηση", "", "https://dsml.ece.ntua.gr/", "Εθνικό Μετσόβειο Πολυτεχνείο", "Αθήνα" },
                    { 2, "Κυβερνοασφάλεια και Επιστήμη Δεδομένων", "", "https://www.cs.unipi.gr/index.php?option=com_k2&view=item&layout=item&id=609&Itemid=813&lang=el", "Πανεπιστήμιο Πειραιώς", "Πειραιάς" },
                    { 3, "Προηγμένα Συστήματα Πληροφορικής - Ανάπτυξη Λογισμικού και Τεχνητής Νοημοσύνης", "", "https://www.cs.unipi.gr/index.php?option=com_k2&view=item&layout=item&id=626&Itemid=815&lang=el", "Πανεπιστήμιο Πειραιώς", "Πειραιάς" },
                    { 4, "Ψηφιακός Πολιτισμός, Έξυπνες Πόλεις, IoT και Προηγμένες Ψηφιακές Τεχνολογίες", "", "https://www.cs.unipi.gr/index.php?option=com_k2&view=item&layout=item&id=576&Itemid=814&lang=el", "Πανεπιστήμιο Πειραιώς", "Πειραιάς" },
                    { 5, "Προηγμένες Τεχνολογίες Πληροφορικής και Υπηρεσίες", "", "https://www.cs.unipi.gr/index.php?option=com_k2&view=item&layout=item&id=653&Itemid=812&lang=el", "Πανεπιστήμιο Πειραιώς", "Πειραιάς" },
                    { 6, "Ανάπτυξη και Ασφάλεια Πληροφοριακών Συστημάτων", "", "https://mscis.cs.aueb.gr/el/normal/home", "Οικονομικό Πανεπιστήμιο Αθηνών", "Αθήνα" },
                    { 7, "Επιστήμη Δεδομένων", "", "https://www.dept.aueb.gr/el/cs/content/%CF%80%CE%BC%CF%83-%CF%83%CF%84%CE%B7%CE%BD-%CE%B5%CF%80%CE%B9%CF%83%CF%84%CE%AE%CE%BC%CE%B7-%CE%B4%CE%B5%CE%B4%CE%BF%CE%BC%CE%AD%CE%BD%CF%89%CE%BD", "Οικονομικό Πανεπιστήμιο Αθηνών", "Αθήνα" },
                    { 8, "Μηχανική Υπολογιστών, Τηλεποικοινωνιών και Δικτύων", "", "https://www.di.uoa.gr/eng", "Εθνικό Καποδιστριακό Πανεπιστήμιο Αθηνών", "Αθήνα" },
                    { 9, "Τεχνολογίες Πληροφορικής και Τηλεποικοινωνιών", "", "https://www.di.uoa.gr/ict", "Εθνικό Καποδιστριακό Πανεπιστήμιο Αθηνών", "Αθήνα" },
                    { 10, "Data Science and Information Technologies", "", "https://dsit.di.uoa.gr/", "Εθνικό Καποδιστριακό Πανεπιστήμιο Αθηνών", "Αθήνα" },
                    { 11, "Προηγμένη Τεχνολογία Λογισμικού", "", "https://mai.uom.gr/frontend/articles.php?cid=41&t=Proigmeni-Texnologia-Logismikou", "Πανεπιστήμιο Μακεδονίας", "Θεσσαλονίκη" },
                    { 12, "Ανάπτυξη Ψηφιακών Παιχνιδιών και Πολυμεσικών Εφαρμογών", "", "https://gamedev.uowm.gr/", "Πανεπιστήμιο Μακεδονίας", "Θεσσαλονίκη" },
                    { 13, "Ανάπτυξη Εφαρμογών Ιστού και Κινητών Συσκευών", "", "https://mai.uom.gr/frontend/articles.php?cid=159&t=Anaptuksi-Efarmogwn-Istou-kai-Kinitwn-Suskeuwn", "Πανεπιστήμιο Μακεδονίας", "Θεσσαλονίκη" },
                    { 14, "Αλληλεπίδραση Ανθρώπου-Υπολογιστή", "", "https://hcimaster.upatras.gr/regulation/", "Πανεπιστήμιο Πατρών", "Πάτρα" }
                });

            migrationBuilder.InsertData(
                table: "PrerequisiteCourses",
                columns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                values: new object[,]
                {
                    { 1, 2 },
                    { 1, 22 },
                    { 2, 3 },
                    { 5, 6 },
                    { 5, 13 },
                    { 6, 4 },
                    { 8, 7 },
                    { 9, 8 },
                    { 9, 19 },
                    { 11, 10 },
                    { 13, 12 },
                    { 14, 13 },
                    { 14, 16 },
                    { 16, 15 },
                    { 17, 10 },
                    { 18, 17 },
                    { 19, 10 },
                    { 20, 23 },
                    { 22, 21 },
                    { 23, 12 }
                });

            migrationBuilder.InsertData(
                table: "Questions",
                columns: new[] { "Id", "Content", "CourseId" },
                values: new object[,]
                {
                    { 1, "Ένα από τα αντικέιμενα του μαθήματος Αντικειμενοστρεφής Προγραμματισμός η ομαδική εργασία.", 3 },
                    { 2, "Ποιο από τα παρακάτω αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Αντικειμενοστρεφής Προγραμματισμός;", 3 },
                    { 3, "Ποιο από τα παρακάτω αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Αντικειμενοστρεφής Προγραμματισμός;", 3 },
                    { 4, "Παρακολουθώντας το μάθημα Αντικειμενοστρεφής Προγραμματισμός, οι φοιτητές είναι ικανοί να θα παράγουν εφαρμογές πελάτη-εξυπηρετητή.", 3 },
                    { 5, "Το κύριο αντικείμενο του μαθήματος Αντικειμενοστρεφής Προγραμματισμός  είναι η εισαγωγή στον αντικειμενοστρεφή προγραμματισμό με πλήρη ανάλυση της γλώσσας προγραμματισμού ______.", 3 },
                    { 6, "Στα πλαίσια του μαθήματος Αντικειμενοστρεφής Προγραμματισμός οι φοιτητές μαθαίνουν να χειρίζονται αρχεία προορισμένα για _________ και αποθήκευση δεδομένων.", 3 },
                    { 7, "Στα πλαίσια του μαθήματος Αντικειμενοστρεφής Προγραμματισμός οι φοιτητές μαθαίνουν την έννοια της κληρονομικότητας.", 3 },
                    { 8, "Παρακολουθώντας το μάθημα Αντικειμενοστρεφής Προγραμματισμός, οι φοιτητές είναι ικανοί  να παράγουν εφαρμογές με αποδοτικό και ταχύ ρυθμό.", 3 },
                    { 9, "Στα πλαίσια του μαθήματος Αντικειμενοστρεφής Προγραμματισμός οι φοιτητές μαθαίνουν να διαχειρίζονται αποτελεσματικά και με χρήση των κατάλληλων εργαλείων τις ________ που ανακύπτουν.", 3 },
                    { 10, "Ποιο από τα παρακάτω ΔΕΝ ανήκει στο αντικείμενο του μαθήματος Αντικειμενοστρεφής Προγραμματισμός;", 3 },
                    { 11, "Η Εικονική Πραγματικότητα είναι το επιστημονικό πεδίο με αντικείμενο την αναπαράσταση κόσμων με τη βοήθεια ηλεκτρονικών υπολογιστών.", 4 },
                    { 12, "Τα ______ με υπολογιστές διαδραματίζουν βασικό ρόλο στην Εικονική Πραγματικότητα.", 4 },
                    { 13, "Η Εικονική Πραγματικότητα, κυρίως μέσω των _______ Εικονικών Συστημάτων, έχει πλήθος εφαρμογών στην εκπαίδευση, την ψυχαγωγία, την προσομοίωση, την αλληλεπίδραση ανθρώπου – υπολογιστή και την επιστημονική έρευνα", 4 },
                    { 14, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί αντικείμενο του μαθήματος Εικονική Πραγματικότητα;", 4 },
                    { 15, "Στόχος του μαθήματος Εικονική Πραγματικότητα είναι να αποκτήσουν οι φοιτητές γνώσεις και ικανότητες χρήσης/δημιουργίας μετρικών αξιολόγησης παιχνιδιών βάσει των στόχων που τέθηκαν κατά τη σχεδίασή τους.", 4 },
                    { 16, "Πως ονομάζεται το περιβάλλον με το οποίο θα εξοικιωθούν οι φοιτητές για την ανάπτηξη συστημάτων Εικονικής Πραγματικότητας;", 4 },
                    { 17, "Στόχος του μαθήματος Εικονική Πραγματικότητα είναι η εξοικείωση των φοιτητών με σύγχρονες τεχνολογίες, μεθόδους και εργαλεία για τη δημιουργία ολοκληρωμένων εφαρμογών Εικονικής Πραγματικότητας.", 4 },
                    { 18, "Μέσω της παρακολούθησης του μαθήματος Εικονική Πραγματικότητα ο φοιτητής γνωρίζει τις ________ ενός συστήματος Εικονικής Πραγματικότητας.", 4 },
                    { 19, "Ποιο από τα παρακάτω αποτελεί διδακτική ενότητα του μαθήματος Εικονική Πραγματικότητα;", 4 },
                    { 20, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί διδακτική ενότητα του μαθήματος Εικονική Πραγματικότητα;", 4 },
                    { 21, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού;", 1 },
                    { 22, "Η ανάπτυξη των mobile apps στο μάθημα Σύγχρονα Θέματα Τεχνολογίας Λογισμικού  υλοποιείται με τη χρήση του περιβάλλοντος ανάπτυξης λογισμικού ___________.", 1 },
                    { 23, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού;", 1 },
                    { 24, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού;", 1 },
                    { 25, "Tο μάθημα Σύγχρονα Θέματα Τεχνολογίας Λογισμικού καλύπτει και την ύλη που αφορά στους αισθητήρες των κινητών συσκευών, στις υπηρεσίες γεοεντοπισμού και σε πλήθος άλλων προχωρημένων τεχνικών προγραμματισμού.", 1 },
                    { 26, "Η ύλη του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού περιλαμβάνει κυρίως τη χρήση της αντικειμενοστρεφούς γλώσσας προγραμματισμού C#.", 1 },
                    { 27, "Ένα από τα αντκείμενα του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού είναι η “Ανάλυση απαιτήσεων: __________ Ανάλυση και Αντικειμενοστρεφής Ανάλυση”.", 1 },
                    { 28, "Ποιο από τα παρακάτω αποτελεί μοντέλο ανάπτυξης λογισμικού που αναλύεται στα πλαίσια του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού;", 1 },
                    { 29, "Ένα από τα αντικέιμενα του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού είναι προϋπολογισμός κόστους λογισμικού.", 1 },
                    { 30, "Παρακολουθώντας το μάθημα Σύγχρονα Θέματα Τεχνολογίας Λογισμικού, μπορεί κανείς να χρησιμοποιεί πρακτικά τις πλέον σύγχρονες υπηρεσίες ______ και Mobile backend as a service που παρέχει η Firebase.", 1 },
                    { 31, "Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες ο φοιτητής μπορεί να εφαρμόζει τα μοντέλα “αντιλαμβάνομαι-αποφασίζω-ενεργώ” (Sense-Decide-Act), BDI (Belief-Desire-Intention), σε διάφορες περιπτώσεις πρακτόρων.", 5 },
                    { 32, "Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες ο φοιτητής διακρίνει και εκτιμά πότε είναι απαραίτητος ένας _________ πράκτορας και πότε βουλητικός πράκτορας.", 5 },
                    { 33, "Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες ο φοιτητής κατανοεί την ____ ενός ευφυούς πράκτορα", 5 },
                    { 34, "Ποίο από τα παρακάτω αποτελεί είδος ευφυούς πράκτορα που μελετάται στο μάθυμα Ευφυείς Πράκτορες;", 5 },
                    { 35, "Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες  ο φοιτητής  αναπτύσσει αλγορίθμους για εύρεση μονοπατιού (path finding), και σχεδιασμό ενεργειών (plan generation)", 5 },
                    { 36, "Πως ονομάζεται το περιβάλλον με το οποίο θα εξοικιωθούν οι φοιτητές για την ανάπτηξη εφαρμογών ευφυή πρακτόρων;", 5 },
                    { 37, "Η συναισθηματική διαλεκτική σε ευφυείς πράκτορες αποτελεί αντικείμενο του μαθήματος Ευφυείς Πράκτορες.", 5 },
                    { 38, "Μέσω της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες ο φοιτητής μαθαίνει να εφαρμόζει το μοντέλο “αντιλαμβάνομαι-αποφασίζω-________”", 5 },
                    { 39, "Αντικείμενο του μαθήματος Ευφυείς Πράκτορες είναι  ο σχεδιασμός ενεργειών, βασισμένος σε κίνητρα και η πυραμίδα του ________.", 5 },
                    { 40, "Mε ποιο είδος πρακτόρων θα ασχοληθούν οι φοιτητές στα πλαίσια του μαθληματος Ευφυείς Πράκτορες;", 5 },
                    { 41, "Παρακολουθώντας το μάθημα Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών, οι φοιτητές θα μπορούν να αναπτύσουν εφαρμογές ηλεκτρονικών παιχνιδιών στο περιβάλλον της Python.", 6 },
                    { 42, "Στόχος του μαθήματος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών είναι να αποκτήσουν οι φοιτητές βασικές γνώσεις για τον ρόλο, τους τύπους και τα ________ των παιχνιδιών, καθώς και για τη συνολική διαδικασία δημιουργίας ενός παιχνιδιού.", 6 },
                    { 43, "Στόχος του μαθήματος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών είναι να αποκτήσουν οι φοιτητές ικανότητες σχεδίασης και _________ παιχνιδιών αξιοποιώντας σύγχρονα εργαλεία, διασυνδέσεις και γλώσσες προγραμματισμού,", 6 },
                    { 44, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί κατηγορία ηλεκτρονικών παιχνιδιών;", 6 },
                    { 45, "Στόχος του μαθήματος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών είναι να αποκτήσουν οι φοιτητές γνώσεις και ικανότητες χρήσης/δημιουργίας μετρικών αξιολόγησης παιχνιδιών βάσει των στόχων που τέθηκαν κατά τη σχεδίασή τους.", 6 },
                    { 46, "Στα πλάισια του μαθήαμτος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών ο φοιτητής μαθαίνει να συνοψίζει τις απαιτούμενες γνώσεις σχετικά με την ανάπτυξη ηλεκτρονικών παιχνιδιών στο περιβάλλον της ________", 6 },
                    { 47, "Στόχος του μαθήματος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών είναι η εξοικείωση των φοιτητών με σύγχρονες τεχνολογίες, μεθόδους και εργαλεία για τη δημιουργία ολοκληρωμένων διαδικτυακών εφαρμογών.", 6 },
                    { 48, "Το αντικείενο του μαθήματος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών περιλαμβάνει τη σχεδίαση ενός παιχνιδιού σε ________.", 6 },
                    { 49, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί συστατικά ηλεκτρονικών παιχνιδιών στο Διαδίκτυο;", 6 },
                    { 50, "Ο κόσμος ενός ηλεκτρονικού αποτελείται από χαρακτήρες που μπορεί να είναι...;", 6 },
                    { 51, "Η ύλη του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών περιλαμβάνει κυρίως τη χρήση της αντικειμενοστρεφούς γλώσσας προγραμματισμού C#.", 2 },
                    { 52, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθαίνουν να αναπτύσσουν _______, web, ή/και mobile εφαρμογές.", 2 },
                    { 53, "Ποιο εργαλείο ανάπτυξης εφαρμογών χρησιμοποιείται στα πλαίσια του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών;", 2 },
                    { 54, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθαίνουν να αναπτύσσουν λογισμικό για ένα μεγάλο πλήθος από πεδία, συμπεριλαμβανομένων των παραθυρικών εφαρμογών, των εφαρμογών κονσόλας, των εφαρμογών web και των mobile εφαρμογών.", 2 },
                    { 55, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές εκτίθονται σε σύγχρονες τεχνικές προγραμματισμού με στόχο την ποιότητα του παραγόμενου _________, καθώς και την ταχύτητα ανάπτυξης σύνθετων και πολύπλοκων προγραμμάτων/έργων.", 2 },
                    { 56, "Στο πλαίσιο του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών δίνεται ιδιαίτερη έμφαση στα ολοκληρωμένα περιβάλλοντα ανάπτυξης τα οποία ονομάζονται και:", 2 },
                    { 57, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθαίνουν να αναγνωρίζουν και να εξηγούν τι είναι γλώσσα και γραμματική και πώς συμβολίζονται.", 2 },
                    { 58, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθάινουν να κάνουν ________ λογισμικού με τα πλέον σύγχρονα εργαλεία.", 2 },
                    { 59, "Ποιο από τα παρακάτω αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών;", 2 },
                    { 60, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών , οι φοιτητές μαθάινουν να παράγουν εφαρμογές με _______ και ταχύ ρυθμό.", 2 }
                });
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 24);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 25);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 26);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 27);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 28);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 29);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 30);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 31);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 32);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 33);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 34);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 35);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 36);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 37);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 38);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 39);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 40);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 41);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 42);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 43);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 44);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 45);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 46);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 47);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 48);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 49);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 50);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 51);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 52);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 53);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 54);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 55);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 56);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 57);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 58);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 59);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 60);

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "3D Artist/Animator");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Accessibility Specialist");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Android Developer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Back-End Developer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Big Data Engineer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Cloud Data Engineer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Computer Graphics Programmer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Computer Vision Engineer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Data Architect");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Data Scientist");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Database Developer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "DevOps Engineer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Front-End Developer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Full-Stack Developer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Games Designer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Games Programmer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Incident Responder");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "iOS Developer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Level Designer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Machine Learning Engineer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Mobile App Developer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Mobile UI/UX Designer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "N.L.P. Engineer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Network Administrator");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Network Engineer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Network Security Specialist");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Penetration Tester");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Robotics Engineer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Security Analyst");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Security Engineer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Software Consultant");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Software Developer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "UI/UX Designer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Virtual Reality Developer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Visual Designer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Web App Developer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Web Designer");

            migrationBuilder.DeleteData(
                table: "Coefficients",
                keyColumn: "Name",
                keyValue: "AI_ML");

            migrationBuilder.DeleteData(
                table: "Coefficients",
                keyColumn: "Name",
                keyValue: "ComputerNetworks");

            migrationBuilder.DeleteData(
                table: "Coefficients",
                keyColumn: "Name",
                keyValue: "ComputerVisionAndGraphics");

            migrationBuilder.DeleteData(
                table: "Coefficients",
                keyColumn: "Name",
                keyValue: "DatabaseEngineering");

            migrationBuilder.DeleteData(
                table: "Coefficients",
                keyColumn: "Name",
                keyValue: "GameDev");

            migrationBuilder.DeleteData(
                table: "Coefficients",
                keyColumn: "Name",
                keyValue: "MobileAppDev");

            migrationBuilder.DeleteData(
                table: "Coefficients",
                keyColumn: "Name",
                keyValue: "Security");

            migrationBuilder.DeleteData(
                table: "Coefficients",
                keyColumn: "Name",
                keyValue: "SoftwareEngineering");

            migrationBuilder.DeleteData(
                table: "Coefficients",
                keyColumn: "Name",
                keyValue: "UI_UX");

            migrationBuilder.DeleteData(
                table: "Coefficients",
                keyColumn: "Name",
                keyValue: "WebDev");

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "MobileAppDev", 1 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "SoftwareEngineering", 1 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "MobileAppDev", 2 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "MobileAppDev", 3 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "GameDev", 4 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "AI_ML", 5 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "GameDev", 5 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "GameDev", 6 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "Security", 7 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "Security", 8 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "ComputerNetworks", 9 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "Security", 9 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "ComputerNetworks", 10 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "UI_UX", 10 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "WebDev", 10 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "UI_UX", 11 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "AI_ML", 12 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "ComputerVisionAndGraphics", 12 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "AI_ML", 13 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "AI_ML", 14 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "DatabaseEngineering", 14 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "DatabaseEngineering", 15 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "DatabaseEngineering", 16 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "WebDev", 17 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "WebDev", 18 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "ComputerNetworks", 19 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "ComputerVisionAndGraphics", 20 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "SoftwareEngineering", 21 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "SoftwareEngineering", 22 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "ComputerVisionAndGraphics", 23 });

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "AI_ML", 1 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "DatabaseEngineering", 1 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "AI_ML", 2 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "DatabaseEngineering", 2 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "Security", 2 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "AI_ML", 3 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "SoftwareEngineering", 3 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "Networks", 4 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "Security", 4 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "WebDev", 4 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "Networks", 5 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "Security", 5 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "Security", 6 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "WebDev", 6 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "AI_ML", 7 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "DatabaseEngineering", 7 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "Networks", 8 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "AI_ML", 9 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "Networks", 9 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "WebDev", 9 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "AI_ML", 10 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "DatabaseEngineering", 10 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "SoftwareEngineering", 11 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "ComputerVisionAndGraphics", 12 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "GameDev", 12 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "MobileAppDev", 13 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "UI_UX", 13 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "WebDev", 13 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "UI_UX", 14 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 1, 2 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 1, 22 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 2, 3 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 5, 6 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 5, 13 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 6, 4 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 8, 7 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 9, 8 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 9, 19 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 11, 10 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 13, 12 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 14, 13 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 14, 16 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 16, 15 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 17, 10 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 18, 17 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 19, 10 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 20, 23 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 22, 21 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 23, 12 });

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 24);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 25);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 26);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 27);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 28);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 29);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 30);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 31);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 32);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 33);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 34);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 35);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 36);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 37);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 38);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 39);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 40);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 41);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 42);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 43);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 44);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 45);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 46);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 47);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 48);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 49);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 50);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 51);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 52);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 53);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 54);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 55);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 56);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 57);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 58);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 59);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 60);
        }
    }
}
