using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace EduCompass.Migrations
{
    /// <inheritdoc />
    public partial class seeddata : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Answers",
                columns: new[] { "Id", "Answer1", "Answer2", "Answer3", "Answer4", "CorrectAnswer", "QuestionId" },
                values: new object[,]
                {
                    { 1, "Σωστό", "Λάθος", "", "", "Σωστό", 1 },
                    { 2, "Να δημιουργούν τάξεις, διεπαφές και αντικείμενα", "Να γνωρίζουν τις βασικές αρχές της γλώσσας C#", "Να μπορούν να αξιοποιήσουν τις βασικές αλγοριθμικές δομές σε γλώσσα C++", "Να μπορούν να υλοποιούν προγραμματισμό sockets (TCP sockets και UDP sockets).", "Να δημιουργούν τάξεις, διεπαφές και αντικείμενα", 2 },
                    { 3, "Να μπορούν να σχεδιάζουν και να υλοποιούν αλγόριθμους για την αποτελεσματική κατασκευή συνδυαστικών αντικειμένων.", "Να αναγνωρίζουν και να κατανοούν σύγχρονες τεχνικές σχεδίασης ολοκληρωμένων εφαρμογών λογισμικού με υπηρεσίες.", "Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", "Να σχεδιάζουν αρχιτεκτονικά σχέδια λογισμικού βασισμένα σε γλώσσες μοντελοποίησης και διαγράμματα.", "Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", 3 },
                    { 4, "Σωστό", "Λάθος", "", "", "Λάθος", 4 },
                    { 5, "Java", "", "", "", "Java", 5 },
                    { 6, "Ανάγνωση", "", "", "", "Ανάγνωση", 6 },
                    { 7, "Σωστό", "Λάθος", "", "", "Σωστό", 7 },
                    { 8, "Σωστό", "Λάθος", "", "", "Λάθος", 8 },
                    { 9, "Εξαιρέσεις", "", "", "", "Εξαιρέσεις", 9 },
                    { 10, "Αυτόνομη εργασία", "Αρχιτεκτονική Πελάτη-Εξυπηρετητή (Client-Server)", "Προσαρμογή σε νέες καταστάσεις", "Σχεδιασμός και διαχείριση έργων", "Αρχιτεκτονική Πελάτη-Εξυπηρετητή (Client-Server)", 10 },
                    { 11, "Σωστό", "Λάθος", "", "", "Σωστό", 11 },
                    { 12, "γραφικά", "", "", "", "γραφικά", 12 },
                    { 13, "ευφυών", "", "", "", "ευφυών", 13 },
                    { 14, "Υφή επιφάνειας αντικειμένων. Διαχείριση πηγών φωτός, ήχων, κάμερας. Animations.", "Ανάπτυξη εφαρμογών εικονικής πραγματικότητας στην πλατφόρμα Unity3D.", "Κόσμοι τρισδιάστατων γραφικών. Τρισδιάστατα μοντέλα αντικειμένων.", "Δομή και λειτουργία ενός ηλεκτρονικού παιχνιδιού.", "Δομή και λειτουργία ενός ηλεκτρονικού παιχνιδιού.", 14 },
                    { 15, "Σωστό", "Λάθος", "", "", "Λάθος", 15 },
                    { 16, "Unity3D", "", "", "", "Unity3D", 16 },
                    { 17, "Σωστό", "Λάθος", "", "", "Σωστό", 17 },
                    { 18, "συνιστώσες", "", "", "", "συνιστώσες", 18 },
                    { 19, "Μετρήσεις Αντικειμένου Εικόνας", "Εισαγωγή στα Γραφικά με Υπολογιστές, συστήματα απεικόνισης, χρώμα, γεωμετρικά σχήματα, μετασχηματισμοί, κίνηση.", "Δομή και την λειτουργία ενός ευφυούς πράκτορα μέσα σε ένα περιβάλλον.", "Αντιδρασιακοί πράκτορες (Reactive Agents) και Βουλητικοί πράκτορες (Deliberative Agents).", "Εισαγωγή στα Γραφικά με Υπολογιστές, συστήματα απεικόνισης, χρώμα, γεωμετρικά σχήματα, μετασχηματισμοί, κίνηση.", 19 },
                    { 20, "VRML: sensors και animation, γενικές αρχές μοντελοποίησης σκελετού, πρότυπα μοντελοποίησης κίνησης σώματος (H-Anim, κ.ά.), scripting, ενσωμάτωση σε εφαρμογές, PROTOs, προτεινόμενες πρακτικές σχεδιασμού και ανάπτυξης.", "VRML: σύνταξη, υλοποιήσεις, βασικά εργαλεία, γεωμετρία, μετασχηματισμοί, επαναχρησιμοποίηση κόμβων, εξωτερικές αναφορές, υλικά/χρώμα, φωτισμός, υφή, viewpoints, background, ήχος, κείμενο, billboards, HUDs.", "Γράφημα σκηνής, υλοποιήσεις (Java3D, VRML/X3D, κ.ά.)", "Σχεδιασμός Κατανεμημένων Περιβαλλόντων Μάθησης", "Σχεδιασμός Κατανεμημένων Περιβαλλόντων Μάθησης", 20 },
                    { 21, "Να εφαρμόζουν πρακτικά τεχνολογίες ασφάλειας πληροφοριακών συστημάτων σε πραγματικές συνθήκες", "Να αναλύει και να συγκρίνει μοντέλα ανάπτυξης λογισμικού", "Να αναπτύσσει native mobile apps κάνοντας χρήση του Android SDK", "Να χρησιμοποιεί πρακτικά τις πλέον σύγχρονες υπηρεσίες Cloud και Mobile backend as a service που παρέχει η Firebase", "Να εφαρμόζουν πρακτικά τεχνολογίες ασφάλειας πληροφοριακών συστημάτων σε πραγματικές συνθήκες", 21 },
                    { 22, "Android Studio", "", "", "", "Android Studio", 22 },
                    { 23, "Να σχεδιάζει και να αναπτύσσει εφαρμογές για κινητές και φορητές συσκευές υλοποιώντας τις πλέον σύγχρονες τεχνικές προγραμματισμού.", "Να εκμεταλλεύεται τοπικές (SQLite) βάσεις δεδομένων.", "Να επιλέγει μοντέλα ανάπτυξης λογισμικού ανάλογα με τις ανάγκες και να τα χρησιμοποιεί.", "Να γνωρίζει τις τεχνικές σηματοδοσίας, διαχείρισης κινητικότητας και το πρωτόκολλο Mobile IP.", "Να γνωρίζει τις τεχνικές σηματοδοσίας, διαχείρισης κινητικότητας και το πρωτόκολλο Mobile IP.", 23 },
                    { 24, "Να διασφαλίζει την αποτελεσματικότητα των λογισμικών μέσω των προαναφερθέντων εφαρμογών.", "Να αναγνωρίζει αρχές σχεδίασης λογισμικού με REST.", "Να αξιοποιεί το εργαλείο Android Studio για την ανάπτυξη κινητών εφαρμογών.", "Να γνωρίζει τις πλέον σύγχρονες υπηρεσίες Cloud και Mobile backend as a service που παρέχει η Firebase", "Να αναγνωρίζει αρχές σχεδίασης λογισμικού με REST.", 24 },
                    { 25, "Σωστό", "Λάθος", "", "", "Σωστό", 25 },
                    { 26, "Σωστό", "Λάθος", "", "", "Λάθος", 26 },
                    { 27, "Δομημένη", "", "", "", "Δομημένη", 27 },
                    { 28, "Scrum", "Firebase", "Rational Unified Process", "DevOps", "Rational Unified Process", 28 },
                    { 29, "Σωστό", "Λάθος", "", "", "Σωστό", 29 },
                    { 30, "Cloud", "", "", "", "Cloud", 30 },
                    { 31, "Σωστό", "Λάθος", "", "", "Σωστό", 31 },
                    { 32, "αντιδρασιακός", "", "", "", "αντιδρασιακός", 32 },
                    { 33, "δομή", "", "", "", "δομή", 33 },
                    { 34, "Cleaning Agents", "Radioactive Agents", "Deliberative Agents", "Federal Agents", "Deliberative Agents", 34 },
                    { 35, "Σωστό", "Λάθος", "", "", "Σωστό", 35 },
                    { 36, "Unity3D", "", "", "", "Unity3D", 36 },
                    { 37, "Σωστό", "Λάθος", "", "", "Λάθος", 37 },
                    { 38, "ενεργώ", "", "", "", "ενεργώ", 38 },
                    { 39, "Maslow", "Khafre", "Djoser", "Cheops", "Maslow", 39 },
                    { 40, "Reactive Agents", "Deliberative Agents", "Κανένα από τα δύο", "Και τα δύο", "Και τα δύο", 40 },
                    { 41, "Σωστό", "Λάθος", "", "", "Λάθος", 41 },
                    { 42, "χαρακτηριστικά", "", "", "", "χαρακτηριστικά", 42 },
                    { 43, "υλοποίησης", "", "", "", "υλοποίησης", 43 },
                    { 44, "First Person", "Educational", "Role-playing", "Fourth Person", "Fourth Person", 44 },
                    { 45, "Σωστό", "Λάθος", "", "", "Σωστό", 45 },
                    { 46, "Unity3D", "", "", "", "Unity3D", 46 },
                    { 47, "Σωστό", "Λάθος", "", "", "Λάθος", 47 },
                    { 48, "C", "C++", "PythonFmu", "C#", "C#", 48 },
                    { 49, "3D μοντέλα", "bolts", "sprites", "animations", "bolts", 49 },
                    { 50, "Παίκτες", "Πράκτορες", "Κανένα από τα δύο", "Και τα δύο", "Και τα δύο", 50 },
                    { 51, "Σωστό", "Λάθος", "", "", "Σωστό", 51 },
                    { 52, "desktop", "", "", "", "desktop", 52 },
                    { 53, "Visual Studio Enterprise Edition", "IntelliJ IDEA", "Visual Studio Code", "QtSpim", "Visual Studio Enterprise Edition", 53 },
                    { 54, "Σωστό", "Λάθος", "", "", "Σωστό", 54 },
                    { 55, "λογισμικού", "", "", "", "λογισμικού", 55 },
                    { 56, "IDEs", "GUIs", "GNUs", "ICPs", "IDEs", 56 },
                    { 57, "Σωστό", "Λάθος", "", "", "Λάθος", 57 },
                    { 58, "αποσφαλμάτωση", "", "", "", "αποσφαλμάτωση", 58 },
                    { 59, "Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", "Να σχεδιάζουν αρχιτεκτονικά σχέδια λογισμικού βασισμένα σε γλώσσες μοντελοποίησης και διαγράμματα.", "Να μαθαίνουν, να αξιολογούν και να εντοπίζουν λογισμικό υλοποιημένο με εργαλεία οπτικού προγραμματισμού.", "Να αναγνωρίζουν και να κατανοούν σύγχρονες τεχνικές σχεδίασης ολοκληρωμένων εφαρμογών λογισμικού με υπηρεσίες.", "Να μαθαίνουν, να αξιολογούν και να εντοπίζουν λογισμικό υλοποιημένο με εργαλεία οπτικού προγραμματισμού.", 59 },
                    { 60, "αποδοτικό", "", "", "", "αποδοτικό", 60 },
                    { 61, "Σωστό", "Λάθος", "", "", "Σωστό", 61 },
                    { 62, "desktop", "", "", "", "desktop", 62 },
                    { 63, "Visual Studio Enterprise Edition", "IntelliJ IDEA", "Visual Studio Code", "QtSpim", "Visual Studio Enterprise Edition", 63 },
                    { 64, "Σωστό", "Λάθος", "", "", "Σωστό", 64 },
                    { 65, "λογισμικού", "", "", "", "λογισμικού", 65 },
                    { 66, "IDEs", "GUIs", "GNUs", "ICPs", "IDEs", 66 },
                    { 67, "Σωστό", "Λάθος", "", "", "Λάθος", 67 },
                    { 68, "αποσφαλμάτωση", "", "", "", "αποσφαλμάτωση", 68 },
                    { 69, "Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", "Να σχεδιάζουν αρχιτεκτονικά σχέδια λογισμικού βασισμένα σε γλώσσες μοντελοποίησης και διαγράμματα.", "Να μαθαίνουν, να αξιολογούν και να εντοπίζουν λογισμικό υλοποιημένο με εργαλεία οπτικού προγραμματισμού.", "Να αναγνωρίζουν και να κατανοούν σύγχρονες τεχνικές σχεδίασης ολοκληρωμένων εφαρμογών λογισμικού με υπηρεσίες.", "Να μαθαίνουν, να αξιολογούν και να εντοπίζουν λογισμικό υλοποιημένο με εργαλεία οπτικού προγραμματισμού.", 69 },
                    { 70, "αποδοτικό", "", "", "", "αποδοτικό", 70 },
                    { 71, "Σωστό", "Λάθος", "", "", "Λάθος", 71 },
                    { 72, "χαρακτηριστικά", "", "", "", "χαρακτηριστικά", 72 },
                    { 73, "υλοποίησης", "", "", "", "υλοποίησης", 73 },
                    { 74, "First Person", "Educational", "Role-playing", "Fourth Person", "Fourth Person", 74 },
                    { 75, "Σωστό", "Λάθος", "", "", "Σωστό", 75 },
                    { 76, "Unity3D", "", "", "", "Unity3D", 76 },
                    { 77, "Σωστό", "Λάθος", "", "", "Λάθος", 77 },
                    { 78, "C", "C++", "PythonFmu", "C#", "C#", 78 },
                    { 79, "3D μοντέλα", "bolts", "sprites", "animations", "bolts", 79 },
                    { 80, "Παίκτες", "Πράκτορες", "Κανένα από τα δύο", "Και τα δύο", "Και τα δύο", 80 },
                    { 81, "Σωστό", "Λάθος", "", "", "Σωστό", 81 },
                    { 82, "αντιδρασιακός", "", "", "", "αντιδρασιακός", 82 },
                    { 83, "δομή", "", "", "", "δομή", 83 },
                    { 84, "Cleaning Agents", "Radioactive Agents", "Deliberative Agents", "Federal Agents", "Deliberative Agents", 84 },
                    { 85, "Σωστό", "Λάθος", "", "", "Σωστό", 85 },
                    { 86, "Unity3D", "", "", "", "Unity3D", 86 },
                    { 87, "Σωστό", "Λάθος", "", "", "Λάθος", 87 },
                    { 88, "ενεργώ", "", "", "", "ενεργώ", 88 },
                    { 89, "Maslow", "Khafre", "Djoser", "Cheops", "Maslow", 89 },
                    { 90, "Reactive Agents", "Deliberative Agents", "Κανένα από τα δύο", "Και τα δύο", "Και τα δύο", 90 },
                    { 91, "Σωστό", "Λάθος", "", "", "Σωστό", 91 },
                    { 92, "Να δημιουργούν τάξεις, διεπαφές και αντικείμενα", "Να γνωρίζουν τις βασικές αρχές της γλώσσας C#", "Να μπορούν να αξιοποιήσουν τις βασικές αλγοριθμικές δομές σε γλώσσα C++", "Να μπορούν να υλοποιούν προγραμματισμό sockets (TCP sockets και UDP sockets).", "Να δημιουργούν τάξεις, διεπαφές και αντικείμενα", 92 },
                    { 93, "Να μπορούν να σχεδιάζουν και να υλοποιούν αλγόριθμους για την αποτελεσματική κατασκευή συνδυαστικών αντικειμένων.", "Να αναγνωρίζουν και να κατανοούν σύγχρονες τεχνικές σχεδίασης ολοκληρωμένων εφαρμογών λογισμικού με υπηρεσίες.", "Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", "Να σχεδιάζουν αρχιτεκτονικά σχέδια λογισμικού βασισμένα σε γλώσσες μοντελοποίησης και διαγράμματα.", "Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", 93 },
                    { 94, "Σωστό", "Λάθος", "", "", "Λάθος", 94 },
                    { 95, "Java", "", "", "", "Java", 95 },
                    { 96, "Ανάγνωση", "", "", "", "Ανάγνωση", 96 },
                    { 97, "Σωστό", "Λάθος", "", "", "Σωστό", 97 },
                    { 98, "Σωστό", "Λάθος", "", "", "Λάθος", 98 },
                    { 99, "Εξαιρέσεις", "", "", "", "Εξαιρέσεις", 99 },
                    { 100, "Αυτόνομη εργασία", "Αρχιτεκτονική Πελάτη-Εξυπηρετητή (Client-Server)", "Προσαρμογή σε νέες καταστάσεις", "Σχεδιασμός και διαχείριση έργων", "Αρχιτεκτονική Πελάτη-Εξυπηρετητή (Client-Server)", 100 },
                    { 101, "Να εφαρμόζουν πρακτικά τεχνολογίες ασφάλειας πληροφοριακών συστημάτων σε πραγματικές συνθήκες", "Να αναλύει και να συγκρίνει μοντέλα ανάπτυξης λογισμικού", "Να αναπτύσσει native mobile apps κάνοντας χρήση του Android SDK", "Να χρησιμοποιεί πρακτικά τις πλέον σύγχρονες υπηρεσίες Cloud και Mobile backend as a service που παρέχει η Firebase", "Να εφαρμόζουν πρακτικά τεχνολογίες ασφάλειας πληροφοριακών συστημάτων σε πραγματικές συνθήκες", 101 },
                    { 102, "Android Studio", "", "", "", "Android Studio", 102 },
                    { 103, "Να σχεδιάζει και να αναπτύσσει εφαρμογές για κινητές και φορητές συσκευές υλοποιώντας τις πλέον σύγχρονες τεχνικές προγραμματισμού.", "Να εκμεταλλεύεται τοπικές (SQLite) βάσεις δεδομένων.", "Να επιλέγει μοντέλα ανάπτυξης λογισμικού ανάλογα με τις ανάγκες και να τα χρησιμοποιεί.", "Να γνωρίζει τις τεχνικές σηματοδοσίας, διαχείρισης κινητικότητας και το πρωτόκολλο Mobile IP.", "Να γνωρίζει τις τεχνικές σηματοδοσίας, διαχείρισης κινητικότητας και το πρωτόκολλο Mobile IP.", 103 },
                    { 104, "Να διασφαλίζει την αποτελεσματικότητα των λογισμικών μέσω των προαναφερθέντων εφαρμογών.", "Να αναγνωρίζει αρχές σχεδίασης λογισμικού με REST.", "Να αξιοποιεί το εργαλείο Android Studio για την ανάπτυξη κινητών εφαρμογών.", "Να γνωρίζει τις πλέον σύγχρονες υπηρεσίες Cloud και Mobile backend as a service που παρέχει η Firebase", "Να αναγνωρίζει αρχές σχεδίασης λογισμικού με REST.", 104 },
                    { 105, "Σωστό", "Λάθος", "", "", "Σωστό", 105 },
                    { 106, "Σωστό", "Λάθος", "", "", "Λάθος", 106 },
                    { 107, "Δομημένη", "", "", "", "Δομημένη", 107 },
                    { 108, "Scrum", "Firebase", "Rational Unified Process", "DevOps", "Rational Unified Process", 108 },
                    { 109, "Σωστό", "Λάθος", "", "", "Σωστό", 109 },
                    { 110, "Cloud", "", "", "", "Cloud", 110 },
                    { 111, "Σωστό", "Λάθος", "", "", "Σωστό", 111 },
                    { 112, "desktop", "", "", "", "desktop", 112 },
                    { 113, "Visual Studio Enterprise Edition", "IntelliJ IDEA", "Visual Studio Code", "QtSpim", "Visual Studio Enterprise Edition", 113 },
                    { 114, "Σωστό", "Λάθος", "", "", "Σωστό", 114 },
                    { 115, "λογισμικού", "", "", "", "λογισμικού", 115 },
                    { 116, "IDEs", "GUIs", "GNUs", "ICPs", "IDEs", 116 },
                    { 117, "Σωστό", "Λάθος", "", "", "Λάθος", 117 },
                    { 118, "αποσφαλμάτωση", "", "", "", "αποσφαλμάτωση", 118 },
                    { 119, "Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", "Να σχεδιάζουν αρχιτεκτονικά σχέδια λογισμικού βασισμένα σε γλώσσες μοντελοποίησης και διαγράμματα.", "Να μαθαίνουν, να αξιολογούν και να εντοπίζουν λογισμικό υλοποιημένο με εργαλεία οπτικού προγραμματισμού.", "Να αναγνωρίζουν και να κατανοούν σύγχρονες τεχνικές σχεδίασης ολοκληρωμένων εφαρμογών λογισμικού με υπηρεσίες.", "Να μαθαίνουν, να αξιολογούν και να εντοπίζουν λογισμικό υλοποιημένο με εργαλεία οπτικού προγραμματισμού.", 119 },
                    { 120, "αποδοτικό", "", "", "", "αποδοτικό", 120 },
                    { 121, "Σωστό", "Λάθος", "", "", "Σωστό", 121 },
                    { 122, "αντιδρασιακός", "", "", "", "αντιδρασιακός", 122 },
                    { 123, "δομή", "", "", "", "δομή", 123 },
                    { 124, "Cleaning Agents", "Radioactive Agents", "Deliberative Agents", "Federal Agents", "Deliberative Agents", 124 },
                    { 125, "Σωστό", "Λάθος", "", "", "Σωστό", 125 },
                    { 126, "Unity3D", "", "", "", "Unity3D", 126 },
                    { 127, "Σωστό", "Λάθος", "", "", "Λάθος", 127 },
                    { 128, "ενεργώ", "", "", "", "ενεργώ", 128 },
                    { 129, "Maslow", "Khafre", "Djoser", "Cheops", "Maslow", 129 },
                    { 130, "Reactive Agents", "Deliberative Agents", "Κανένα από τα δύο", "Και τα δύο", "Και τα δύο", 130 },
                    { 131, "Σωστό", "Λάθος", "", "", "Σωστό", 131 },
                    { 132, "Να δημιουργούν τάξεις, διεπαφές και αντικείμενα", "Να γνωρίζουν τις βασικές αρχές της γλώσσας C#", "Να μπορούν να αξιοποιήσουν τις βασικές αλγοριθμικές δομές σε γλώσσα C++", "Να μπορούν να υλοποιούν προγραμματισμό sockets (TCP sockets και UDP sockets).", "Να δημιουργούν τάξεις, διεπαφές και αντικείμενα", 132 },
                    { 133, "Να μπορούν να σχεδιάζουν και να υλοποιούν αλγόριθμους για την αποτελεσματική κατασκευή συνδυαστικών αντικειμένων.", "Να αναγνωρίζουν και να κατανοούν σύγχρονες τεχνικές σχεδίασης ολοκληρωμένων εφαρμογών λογισμικού με υπηρεσίες.", "Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", "Να σχεδιάζουν αρχιτεκτονικά σχέδια λογισμικού βασισμένα σε γλώσσες μοντελοποίησης και διαγράμματα.", "Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", 133 },
                    { 134, "Σωστό", "Λάθος", "", "", "Λάθος", 134 },
                    { 135, "Java", "", "", "", "Java", 135 },
                    { 136, "Ανάγνωση", "", "", "", "Ανάγνωση", 136 },
                    { 137, "Σωστό", "Λάθος", "", "", "Σωστό", 137 },
                    { 138, "Σωστό", "Λάθος", "", "", "Λάθος", 138 },
                    { 139, "Εξαιρέσεις", "", "", "", "Εξαιρέσεις", 139 },
                    { 140, "Αυτόνομη εργασία", "Αρχιτεκτονική Πελάτη-Εξυπηρετητή (Client-Server)", "Προσαρμογή σε νέες καταστάσεις", "Σχεδιασμός και διαχείριση έργων", "Αρχιτεκτονική Πελάτη-Εξυπηρετητή (Client-Server)", 140 },
                    { 141, "Σωστό", "Λάθος", "", "", "Σωστό", 141 },
                    { 142, "αντιδρασιακός", "", "", "", "αντιδρασιακός", 142 },
                    { 143, "δομή", "", "", "", "δομή", 143 },
                    { 144, "Cleaning Agents", "Radioactive Agents", "Deliberative Agents", "Federal Agents", "Deliberative Agents", 144 },
                    { 145, "Σωστό", "Λάθος", "", "", "Σωστό", 145 },
                    { 146, "Unity3D", "", "", "", "Unity3D", 146 },
                    { 147, "Σωστό", "Λάθος", "", "", "Λάθος", 147 },
                    { 148, "ενεργώ", "", "", "", "ενεργώ", 148 },
                    { 149, "Maslow", "Khafre", "Djoser", "Cheops", "Maslow", 149 },
                    { 150, "Reactive Agents", "Deliberative Agents", "Κανένα από τα δύο", "Και τα δύο", "Και τα δύο", 150 },
                    { 151, "Σωστό", "Λάθος", "", "", "Σωστό", 151 },
                    { 152, "Να δημιουργούν τάξεις, διεπαφές και αντικείμενα", "Να γνωρίζουν τις βασικές αρχές της γλώσσας C#", "Να μπορούν να αξιοποιήσουν τις βασικές αλγοριθμικές δομές σε γλώσσα C++", "Να μπορούν να υλοποιούν προγραμματισμό sockets (TCP sockets και UDP sockets).", "Να δημιουργούν τάξεις, διεπαφές και αντικείμενα", 152 },
                    { 153, "Να μπορούν να σχεδιάζουν και να υλοποιούν αλγόριθμους για την αποτελεσματική κατασκευή συνδυαστικών αντικειμένων.", "Να αναγνωρίζουν και να κατανοούν σύγχρονες τεχνικές σχεδίασης ολοκληρωμένων εφαρμογών λογισμικού με υπηρεσίες.", "Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", "Να σχεδιάζουν αρχιτεκτονικά σχέδια λογισμικού βασισμένα σε γλώσσες μοντελοποίησης και διαγράμματα.", "Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", 153 },
                    { 154, "Σωστό", "Λάθος", "", "", "Λάθος", 154 },
                    { 155, "Java", "", "", "", "Java", 155 },
                    { 156, "Ανάγνωση", "", "", "", "Ανάγνωση", 156 },
                    { 157, "Σωστό", "Λάθος", "", "", "Σωστό", 157 },
                    { 158, "Σωστό", "Λάθος", "", "", "Λάθος", 158 },
                    { 159, "Εξαιρέσεις", "", "", "", "Εξαιρέσεις", 159 },
                    { 160, "Αυτόνομη εργασία", "Αρχιτεκτονική Πελάτη-Εξυπηρετητή (Client-Server)", "Προσαρμογή σε νέες καταστάσεις", "Σχεδιασμός και διαχείριση έργων", "Αρχιτεκτονική Πελάτη-Εξυπηρετητή (Client-Server)", 160 },
                    { 161, "Σωστό", "Λάθος", "", "", "Σωστό", 161 },
                    { 162, "Να δημιουργούν τάξεις, διεπαφές και αντικείμενα", "Να γνωρίζουν τις βασικές αρχές της γλώσσας C#", "Να μπορούν να αξιοποιήσουν τις βασικές αλγοριθμικές δομές σε γλώσσα C++", "Να μπορούν να υλοποιούν προγραμματισμό sockets (TCP sockets και UDP sockets).", "Να δημιουργούν τάξεις, διεπαφές και αντικείμενα", 162 },
                    { 163, "Να μπορούν να σχεδιάζουν και να υλοποιούν αλγόριθμους για την αποτελεσματική κατασκευή συνδυαστικών αντικειμένων.", "Να αναγνωρίζουν και να κατανοούν σύγχρονες τεχνικές σχεδίασης ολοκληρωμένων εφαρμογών λογισμικού με υπηρεσίες.", "Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", "Να σχεδιάζουν αρχιτεκτονικά σχέδια λογισμικού βασισμένα σε γλώσσες μοντελοποίησης και διαγράμματα.", "Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", 163 },
                    { 164, "Σωστό", "Λάθος", "", "", "Λάθος", 164 },
                    { 165, "Java", "", "", "", "Java", 165 },
                    { 166, "Ανάγνωση", "", "", "", "Ανάγνωση", 166 },
                    { 167, "Σωστό", "Λάθος", "", "", "Σωστό", 167 },
                    { 168, "Σωστό", "Λάθος", "", "", "Λάθος", 168 },
                    { 169, "Εξαιρέσεις", "", "", "", "Εξαιρέσεις", 169 },
                    { 170, "Αυτόνομη εργασία", "Αρχιτεκτονική Πελάτη-Εξυπηρετητή (Client-Server)", "Προσαρμογή σε νέες καταστάσεις", "Σχεδιασμός και διαχείριση έργων", "Αρχιτεκτονική Πελάτη-Εξυπηρετητή (Client-Server)", 170 },
                    { 171, "Σωστό", "Λάθος", "", "", "Σωστό", 171 },
                    { 172, "desktop", "", "", "", "desktop", 172 },
                    { 173, "Visual Studio Enterprise Edition", "IntelliJ IDEA", "Visual Studio Code", "QtSpim", "Visual Studio Enterprise Edition", 173 },
                    { 174, "Σωστό", "Λάθος", "", "", "Σωστό", 174 },
                    { 175, "λογισμικού", "", "", "", "λογισμικού", 175 },
                    { 176, "IDEs", "GUIs", "GNUs", "ICPs", "IDEs", 176 },
                    { 177, "Σωστό", "Λάθος", "", "", "Λάθος", 177 },
                    { 178, "αποσφαλμάτωση", "", "", "", "αποσφαλμάτωση", 178 },
                    { 179, "Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", "Να σχεδιάζουν αρχιτεκτονικά σχέδια λογισμικού βασισμένα σε γλώσσες μοντελοποίησης και διαγράμματα.", "Να μαθαίνουν, να αξιολογούν και να εντοπίζουν λογισμικό υλοποιημένο με εργαλεία οπτικού προγραμματισμού.", "Να αναγνωρίζουν και να κατανοούν σύγχρονες τεχνικές σχεδίασης ολοκληρωμένων εφαρμογών λογισμικού με υπηρεσίες.", "Να μαθαίνουν, να αξιολογούν και να εντοπίζουν λογισμικό υλοποιημένο με εργαλεία οπτικού προγραμματισμού.", 179 },
                    { 180, "αποδοτικό", "", "", "", "αποδοτικό", 180 },
                    { 181, "Σωστό", "Λάθος", "", "", "Σωστό", 181 },
                    { 182, "γραφικά", "", "", "", "γραφικά", 182 },
                    { 183, "ευφυών", "", "", "", "ευφυών", 183 },
                    { 184, "Υφή επιφάνειας αντικειμένων. Διαχείριση πηγών φωτός, ήχων, κάμερας. Animations.", "Ανάπτυξη εφαρμογών εικονικής πραγματικότητας στην πλατφόρμα Unity3D.", "Κόσμοι τρισδιάστατων γραφικών. Τρισδιάστατα μοντέλα αντικειμένων.", "Δομή και λειτουργία ενός ηλεκτρονικού παιχνιδιού.", "Δομή και λειτουργία ενός ηλεκτρονικού παιχνιδιού.", 184 },
                    { 185, "Σωστό", "Λάθος", "", "", "Λάθος", 185 },
                    { 186, "Unity3D", "", "", "", "Unity3D", 186 },
                    { 187, "Σωστό", "Λάθος", "", "", "Σωστό", 187 },
                    { 188, "συνιστώσες", "", "", "", "συνιστώσες", 188 },
                    { 189, "Μετρήσεις Αντικειμένου Εικόνας", "Εισαγωγή στα Γραφικά με Υπολογιστές, συστήματα απεικόνισης, χρώμα, γεωμετρικά σχήματα, μετασχηματισμοί, κίνηση.", "Δομή και την λειτουργία ενός ευφυούς πράκτορα μέσα σε ένα περιβάλλον.", "Αντιδρασιακοί πράκτορες (Reactive Agents) και Βουλητικοί πράκτορες (Deliberative Agents).", "Εισαγωγή στα Γραφικά με Υπολογιστές, συστήματα απεικόνισης, χρώμα, γεωμετρικά σχήματα, μετασχηματισμοί, κίνηση.", 189 },
                    { 190, "VRML: sensors και animation, γενικές αρχές μοντελοποίησης σκελετού, πρότυπα μοντελοποίησης κίνησης σώματος (H-Anim, κ.ά.), scripting, ενσωμάτωση σε εφαρμογές, PROTOs, προτεινόμενες πρακτικές σχεδιασμού και ανάπτυξης.", "VRML: σύνταξη, υλοποιήσεις, βασικά εργαλεία, γεωμετρία, μετασχηματισμοί, επαναχρησιμοποίηση κόμβων, εξωτερικές αναφορές, υλικά/χρώμα, φωτισμός, υφή, viewpoints, background, ήχος, κείμενο, billboards, HUDs.", "Γράφημα σκηνής, υλοποιήσεις (Java3D, VRML/X3D, κ.ά.)", "Σχεδιασμός Κατανεμημένων Περιβαλλόντων Μάθησης", "Σχεδιασμός Κατανεμημένων Περιβαλλόντων Μάθησης", 190 },
                    { 191, "Σωστό", "Λάθος", "", "", "Λάθος", 191 },
                    { 192, "χαρακτηριστικά", "", "", "", "χαρακτηριστικά", 192 },
                    { 193, "υλοποίησης", "", "", "", "υλοποίησης", 193 },
                    { 194, "First Person", "Educational", "Role-playing", "Fourth Person", "Fourth Person", 194 },
                    { 195, "Σωστό", "Λάθος", "", "", "Σωστό", 195 },
                    { 196, "Unity3D", "", "", "", "Unity3D", 196 },
                    { 197, "Σωστό", "Λάθος", "", "", "Λάθος", 197 },
                    { 198, "C", "C++", "PythonFmu", "C#", "C#", 198 },
                    { 199, "3D μοντέλα", "bolts", "sprites", "animations", "bolts", 199 },
                    { 200, "Παίκτες", "Πράκτορες", "Κανένα από τα δύο", "Και τα δύο", "Και τα δύο", 200 },
                    { 201, "Να εφαρμόζουν πρακτικά τεχνολογίες ασφάλειας πληροφοριακών συστημάτων σε πραγματικές συνθήκες", "Να αναλύει και να συγκρίνει μοντέλα ανάπτυξης λογισμικού", "Να αναπτύσσει native mobile apps κάνοντας χρήση του Android SDK", "Να χρησιμοποιεί πρακτικά τις πλέον σύγχρονες υπηρεσίες Cloud και Mobile backend as a service που παρέχει η Firebase", "Να εφαρμόζουν πρακτικά τεχνολογίες ασφάλειας πληροφοριακών συστημάτων σε πραγματικές συνθήκες", 201 },
                    { 202, "Android Studio", "", "", "", "Android Studio", 202 },
                    { 203, "Να σχεδιάζει και να αναπτύσσει εφαρμογές για κινητές και φορητές συσκευές υλοποιώντας τις πλέον σύγχρονες τεχνικές προγραμματισμού.", "Να εκμεταλλεύεται τοπικές (SQLite) βάσεις δεδομένων.", "Να επιλέγει μοντέλα ανάπτυξης λογισμικού ανάλογα με τις ανάγκες και να τα χρησιμοποιεί.", "Να γνωρίζει τις τεχνικές σηματοδοσίας, διαχείρισης κινητικότητας και το πρωτόκολλο Mobile IP.", "Να γνωρίζει τις τεχνικές σηματοδοσίας, διαχείρισης κινητικότητας και το πρωτόκολλο Mobile IP.", 203 },
                    { 204, "Να διασφαλίζει την αποτελεσματικότητα των λογισμικών μέσω των προαναφερθέντων εφαρμογών.", "Να αναγνωρίζει αρχές σχεδίασης λογισμικού με REST.", "Να αξιοποιεί το εργαλείο Android Studio για την ανάπτυξη κινητών εφαρμογών.", "Να γνωρίζει τις πλέον σύγχρονες υπηρεσίες Cloud και Mobile backend as a service που παρέχει η Firebase", "Να αναγνωρίζει αρχές σχεδίασης λογισμικού με REST.", 204 },
                    { 205, "Σωστό", "Λάθος", "", "", "Σωστό", 205 },
                    { 206, "Σωστό", "Λάθος", "", "", "Λάθος", 206 },
                    { 207, "Δομημένη", "", "", "", "Δομημένη", 207 },
                    { 208, "Scrum", "Firebase", "Rational Unified Process", "DevOps", "Rational Unified Process", 208 },
                    { 209, "Σωστό", "Λάθος", "", "", "Σωστό", 209 },
                    { 210, "Cloud", "", "", "", "Cloud", 210 },
                    { 211, "Σωστό", "Λάθος", "", "", "Σωστό", 211 },
                    { 212, "Να δημιουργούν τάξεις, διεπαφές και αντικείμενα", "Να γνωρίζουν τις βασικές αρχές της γλώσσας C#", "Να μπορούν να αξιοποιήσουν τις βασικές αλγοριθμικές δομές σε γλώσσα C++", "Να μπορούν να υλοποιούν προγραμματισμό sockets (TCP sockets και UDP sockets).", "Να δημιουργούν τάξεις, διεπαφές και αντικείμενα", 212 },
                    { 213, "Να μπορούν να σχεδιάζουν και να υλοποιούν αλγόριθμους για την αποτελεσματική κατασκευή συνδυαστικών αντικειμένων.", "Να αναγνωρίζουν και να κατανοούν σύγχρονες τεχνικές σχεδίασης ολοκληρωμένων εφαρμογών λογισμικού με υπηρεσίες.", "Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", "Να σχεδιάζουν αρχιτεκτονικά σχέδια λογισμικού βασισμένα σε γλώσσες μοντελοποίησης και διαγράμματα.", "Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", 213 },
                    { 214, "Σωστό", "Λάθος", "", "", "Λάθος", 214 },
                    { 215, "Java", "", "", "", "Java", 215 },
                    { 216, "Ανάγνωση", "", "", "", "Ανάγνωση", 216 },
                    { 217, "Σωστό", "Λάθος", "", "", "Σωστό", 217 },
                    { 218, "Σωστό", "Λάθος", "", "", "Λάθος", 218 },
                    { 219, "Εξαιρέσεις", "", "", "", "Εξαιρέσεις", 219 },
                    { 220, "Αυτόνομη εργασία", "Αρχιτεκτονική Πελάτη-Εξυπηρετητή (Client-Server)", "Προσαρμογή σε νέες καταστάσεις", "Σχεδιασμός και διαχείριση έργων", "Αρχιτεκτονική Πελάτη-Εξυπηρετητή (Client-Server)", 220 },
                    { 221, "Σωστό", "Λάθος", "", "", "Σωστό", 221 },
                    { 222, "desktop", "", "", "", "desktop", 222 },
                    { 223, "Visual Studio Enterprise Edition", "IntelliJ IDEA", "Visual Studio Code", "QtSpim", "Visual Studio Enterprise Edition", 223 },
                    { 224, "Σωστό", "Λάθος", "", "", "Σωστό", 224 },
                    { 225, "λογισμικού", "", "", "", "λογισμικού", 225 },
                    { 226, "IDEs", "GUIs", "GNUs", "ICPs", "IDEs", 226 },
                    { 227, "Σωστό", "Λάθος", "", "", "Λάθος", 227 },
                    { 228, "αποσφαλμάτωση", "", "", "", "αποσφαλμάτωση", 228 },
                    { 229, "Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", "Να σχεδιάζουν αρχιτεκτονικά σχέδια λογισμικού βασισμένα σε γλώσσες μοντελοποίησης και διαγράμματα.", "Να μαθαίνουν, να αξιολογούν και να εντοπίζουν λογισμικό υλοποιημένο με εργαλεία οπτικού προγραμματισμού.", "Να αναγνωρίζουν και να κατανοούν σύγχρονες τεχνικές σχεδίασης ολοκληρωμένων εφαρμογών λογισμικού με υπηρεσίες.", "Να μαθαίνουν, να αξιολογούν και να εντοπίζουν λογισμικό υλοποιημένο με εργαλεία οπτικού προγραμματισμού.", 229 },
                    { 230, "αποδοτικό", "", "", "", "αποδοτικό", 230 }
                });

            migrationBuilder.InsertData(
                table: "Careers",
                columns: new[] { "Name", "CoefficientName", "NameInGreek" },
                values: new object[,]
                {
                    { "3D Artist/Animator", "ComputerVisionAndGraphics", "Σχεδιαστής Τρισδιάστατων Σχεδίων" },
                    { "Accessibility Specialist", "UI_UX", "Ειδικός Προσβασιμότητας" },
                    { "Android Developer", "MobileAppDev", "Προγραμματιστής Εφαρμογών για Android" },
                    { "Back-End Developer", "WebDev", "Προγραμματιστής Back-End" },
                    { "Big Data Engineer", "DatabaseEngineering", "Μηχανικός Δεδομένων Μεγάλου Όγκου" },
                    { "Cloud Data Engineer", "DatabaseEngineering", "Μηχανικός Δεδομένων Υπολογιστικής Νέφους" },
                    { "Computer Graphics Programmer", "ComputerVisionAndGraphics", "Προγραμματιστής Γραφικών" },
                    { "Computer Vision Engineer", "ComputerVisionAndGraphics", "Μηχανικός Γραφικών Υπολογιστών" },
                    { "Data Architect", "DatabaseEngineering", "Αρχιτέκτονας Δεδομένων" },
                    { "Data Scientist", "AI_ML", "Επιστήμονας Δεδομένων" },
                    { "Database Developer", "DatabaseEngineering", "Προγραμματιστής Βάσεων Δεδομένων" },
                    { "DevOps Engineer", "SoftwareEngineering", "Μηχανικός DevOps" },
                    { "Front-End Developer", "UI_UX", "Προγραμματιστής Front-End" },
                    { "Full-Stack Developer", "SoftwareEngineering", "Προγραμματιστής Full-Stack" },
                    { "Games Designer", "GameDev", "Σχεδιαστής Ηλεκτρονικών Παιχνιδιών" },
                    { "Games Programmer", "GameDev", "Προγραμματιστής Ηλεκτρονικών Παιχνιδιών" },
                    { "Incident Responder", "Security", "Ανταποκριτής Συμβάντων" },
                    { "iOS Developer", "MobileAppDev", "Προγραμματιστής Εφαρμογών για iOS" },
                    { "Level Designer", "GameDev", "Σχεδιαστής Επιπέδων Ηλεκτρονικών Παιχνιδιών" },
                    { "Machine Learning Engineer", "AI_ML", "Μηχανικός Μηχανικής Μάθησης" },
                    { "Mobile App Developer", "MobileAppDev", "Προγραμματιστής Εφαρμογών Κινητών Τηλεφώνων" },
                    { "Mobile UI/UX Designer", "MobileAppDev", "Σχεδιαστής UI/UX για Εφαρμογές Κινητών Τηλεφώνων" },
                    { "N.L.P. Engineer", "AI_ML", "Μηχανικός Επεξεργασίας Φυσικής Γλώσσας" },
                    { "Network Administrator", "ComputerNetworks", "Διαχειριστής Δικτύων" },
                    { "Network Engineer", "ComputerNetworks", "Μηχανικός Δικτύων" },
                    { "Network Security Specialist", "ComputerNetworks", "Ειδικός Ασφάλειας Δικτύων" },
                    { "Penetration Tester", "Security", "Ελεγκτής Διείσδυσης" },
                    { "Robotics Engineer", "AI_ML", "Μηχανικός Ρομποτικής" },
                    { "Security Analyst", "Security", "Αναλυτής Ασφαλείας" },
                    { "Security Engineer", "Security", "Μηχανικός Ασφαλείας" },
                    { "Software Consultant", "SoftwareEngineering", "Σύμβουλος Λογισμικού" },
                    { "Software Developer", "SoftwareEngineering", "Προγραμματιστής Λογισμικού" },
                    { "UI/UX Designer", "UI_UX", "Σχεδιαστής UI/UX" },
                    { "Virtual Reality Developer", "ComputerVisionAndGraphics", "Προγραμματιστής Εικονικής Πραγματικότητας" },
                    { "Visual Designer", "UI_UX", "Οπτικός Σχεδιαστής" },
                    { "Web App Developer", "WebDev", "Προγραμματιστής Διαδικτυακών Εφαρμογών" },
                    { "Web Designer", "WebDev", "Σχεδιαστής Ιστοσελίδων" }
                });

            migrationBuilder.InsertData(
                table: "Coefficients",
                columns: new[] { "Name", "NameInGreek" },
                values: new object[,]
                {
                    { "AI_ML", "Τεχνητή Νοημοσύνη και Μηχανική Μάθηση" },
                    { "ComputerNetworks", "Δίκτυα Υπολογιστών" },
                    { "ComputerVisionAndGraphics", "Ανάλυση Εικόνας και Γραφικών" },
                    { "DatabaseEngineering", "Ανάπτυξη Βάσεων Δεδομένων και Επιστήμη Δεδομένων" },
                    { "GameDev", "Ανάπτυξη Ηλεκτρονικών Παιχνιδιών" },
                    { "MobileAppDev", "Ανάπτυξη Εφαρμογών Κινητών Τηλεφώνων" },
                    { "Security", "Ασφάλεια" },
                    { "SoftwareEngineering", "Τεχνολογία Λογισμικού" },
                    { "UI_UX", "Αλληλεπίδραση Ανθρώπου-Υπολογιστή" },
                    { "WebDev", "Ανάπτυξη Διαδικτυακών Εφαρμογών" }
                });

            migrationBuilder.InsertData(
                table: "CourseHasCoefficients",
                columns: new[] { "CoefficientName", "CourseId", "Value" },
                values: new object[,]
                {
                    { "MobileAppDev", 1, 10 },
                    { "SoftwareEngineering", 1, 10 },
                    { "MobileAppDev", 2, 5 },
                    { "MobileAppDev", 3, 2 },
                    { "GameDev", 4, 6 },
                    { "AI_ML", 5, 10 },
                    { "GameDev", 5, 9 },
                    { "GameDev", 6, 10 },
                    { "Security", 7, 8 },
                    { "Security", 8, 10 },
                    { "ComputerNetworks", 9, 7 },
                    { "Security", 9, 10 },
                    { "ComputerNetworks", 10, 3 },
                    { "UI_UX", 10, 3 },
                    { "WebDev", 10, 5 },
                    { "UI_UX", 11, 10 },
                    { "AI_ML", 12, 7 },
                    { "ComputerVisionAndGraphics", 12, 6 },
                    { "AI_ML", 13, 8 },
                    { "AI_ML", 14, 9 },
                    { "DatabaseEngineering", 14, 10 },
                    { "DatabaseEngineering", 15, 6 },
                    { "DatabaseEngineering", 16, 10 },
                    { "WebDev", 17, 9 },
                    { "WebDev", 18, 10 },
                    { "ComputerNetworks", 19, 10 },
                    { "ComputerVisionAndGraphics", 20, 10 },
                    { "SoftwareEngineering", 21, 10 },
                    { "SoftwareEngineering", 22, 10 },
                    { "ComputerVisionAndGraphics", 23, 9 }
                });

            migrationBuilder.InsertData(
                table: "Courses",
                columns: new[] { "Id", "AudioFileName", "Content", "Description", "Name", "Semester", "UUID" },
                values: new object[,]
                {
                    { 1, "correct.mp3", "Αντικείμενο Μαθήματος:\r\n                        1. Μοντέλα ανάπτυξης λογισμικού: Μοντέλο καταρράκτη, Σπειροειδές μοντέλο, Μοντέλο Πρωτοτύπου, Rational Unified Process.\r\n                        2. Προϋπολογισμός κόστους λογισμικού.\r\n                        3. Ανάλυση απαιτήσεων: Δομημένη Ανάλυση και Αντικειμενοστρεφής Ανάλυση.\r\n                        4. Σχεδιασμός: Αρχιτεκτονικός σχεδιασμός, λεπτομερής σχεδιασμός, Δομημένος και Αντικειμενοστρεφής σχεδιασμός.\r\n                        5. Ανάπτυξη εφαρμογών, οι οποίες μπορούν να εκτελεστούν από σύγχρονες κινητές συσκευές (smartphones) με ενσωματωμένο λειτουργικό σύστημα. Οι εφαρμογές αυτές δύναται να λειτουργήσουν τόσο στα σύγχρονα «έξυπνα» τηλέφωνα \"smartphones\", όσο και σε άλλες «κινητές» συσκευές, οι οποίες έχουν κάνει την εμφάνισή τους τα τελευταία χρόνια και χρησιμοποιούν λειτουργικό σύστημα (Tablets, Wearables).\r\n\r\n                        Στο μάθημα αναλύονται περιληπτικά τα δημοφιλέστερα λειτουργικά συστήματα κινητών συσκευών, καθώς και τα εργαλεία ανάπτυξης εφαρμογών σε αυτά, ωστόσο η ύλη περιλαμβάνει κυρίως τη χρήση της αντικειμενοστρεφούς γλώσσας προγραμματισμού Java, για την ανάπτυξη εφαρμογών σε κινητές συσκευές υπό το λειτουργικό σύστημα Android. Ενδεικτικά, η ανάπτυξη των mobile apps υλοποιείται με τη χρήση του περιβάλλοντος ανάπτυξης λογισμικού Android Studio.\r\n                        Επιπλέον το μάθημα καλύπτει και την ύλη που αφορά στους αισθητήρες των κινητών συσκευών, στις υπηρεσίες γεοεντοπισμού και σε πλήθος άλλων προχωρημένων τεχνικών προγραμματισμού (asynchronous programming, android services, broadcast receivers, android intents).\r\n\r\n                        Μαθησιακά αποτελέσματα:\r\n                        • Να αναλύει και να συγκρίνει μοντέλα ανάπτυξης λογισμικού.\r\n                        • Να επιλέγει μοντέλα ανάπτυξης λογισμικού ανάλογα με τις ανάγκες και να τα χρησιμοποιεί.\r\n                        • Να αξιοποιεί το εργαλείο Android Studio για την ανάπτυξη κινητών εφαρμογών.\r\n                        • Να αναπτύσσει native mobile apps κάνοντας χρήση του Android SDK.\r\n                        • Να εκμεταλλεύεται τοπικές (SQLite) βάσεις δεδομένων.\r\n                        • Να γνωρίζει τις πλέον σύγχρονες υπηρεσίες Cloud και Mobile backend as a service που παρέχει η Firebase\r\n                        • Να χρησιμοποιεί πρακτικά τις πλέον σύγχρονες υπηρεσίες Cloud και Mobile backend as a service που παρέχει η Firebase\r\n                        • Να σχεδιάζει και να αναπτύσσει εφαρμογές για κινητές και φορητές συσκευές υλοποιώντας τις πλέον σύγχρονες τεχνικές προγραμματισμού.\r\n                        • Να διασφαλίζει την αποτελεσματικότητα των λογισμικών μέσω των προαναφερθέντων εφαρμογών.", "", "Σύγχρονα Θέματα Τεχνολογίας Λογισμικού", 7, "ΠΛΘΕΤΚΑΕ01" },
                    { 2, "correct.mp3", "Αντικείμενο του μαθήματος είναι η ανάπτυξη εφαρμογών βάσει του αντικειμενοστρεφούς μοντέλου ανάπτυξης λογισμικού. Η γλώσσα προγραμματισμού που χρησιμοποιείται ως βάση είναι η C#, που θεωρείται από τις πλέον σύγχρονες αντικειμενοστρεφείς γλώσσες. Στο πλαίσιο του μαθήματος δίνεται ιδιαίτερη έμφαση στα εργαλεία ανάπτυξης εφαρμογών, ολοκληρωμένα περιβάλλοντα ανάπτυξης (IDEs) και συγκεκριμένα το εργαλείο που χρησιμοποιείται είναι το Visual Studio Enterprise Edition. Με τη χρήση του Visual Studio και της C# ως γλώσσας προγραμματισμού, οι φοιτητές μαθαίνουν να αναπτύσσουν desktop, web, ή/και mobile εφαρμογές, γρήγορα, αποδοτικά και κυρίως με την όσο το δυνατόν μικρότερη πιθανότητα να κάνουν λάθη προγραμματισμού ή/και λογικής.\r\n\r\n                Μαθησιακά αποτελέσματα:\r\n                • Να χρησιμοποιεί ολοκληρωμένα περιβάλλοντα ανάπτυξης λογισμικού.\r\n                • Να παράγει εφαρμογές με αποδοτικό και ταχύ ρυθμό\r\n                • Να γνωρίζει τις βασικές αρχές της γλώσσας C#\r\n                • Να κάνει αποσφαλμάτωση λογισμικού με τα πλέον σύγχρονα εργαλεία\r\n                • Να αναπτύσσει λογισμικό για ένα μεγάλο πλήθος από πεδία, συμπεριλαμβανομένων των παραθυρικών εφαρμογών, των εφαρμογών κονσόλας, των εφαρμογών web και των mobile εφαρμογών\r\n                • Να εκτίθεται σε σύγχρονες τεχνικές προγραμματισμού με στόχο την ποιότητα του παραγόμενου λογισμικού, καθώς και την ταχύτητα ανάπτυξης σύνθετων και πολύπλοκων προγραμμάτων/έργων\r\n                • Να μαθαίνει να αξιολογεί και να εντοπίζει λογισμικό υλοποιημένο με εργαλεία οπτικού προγραμματισμού", "", "Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών", 3, "ΠΛΠΛΗ37-3" },
                    { 3, "correct.mp3", "Αντικείμενο μαθήματος:\r\n            1. Αναζήτηση, ανάλυση και σύνθεση δεδομένων και πληροφοριών, με τη χρήση και των απαραίτητων τεχνολογιών.\r\n            2. Αυτόνομη εργασία.\r\n            3. Ομαδική εργασία.\r\n            4. Σχεδιασμός και διαχείριση έργων.\r\n            5. Προσαρμογή σε νέες καταστάσεις.\r\n                Το κύριο αντικείμενο του μαθήματος είναι η εισαγωγή στον αντικειμενοστρεφή προγραμματισμό με πλήρη ανάλυση της γλώσσας προγραμματισμού JAVA. Βασικές δομές, κληρονομικότητα, εντολές, ειδικές κλάσεις, εξαιρέσεις, ειδικά θέματα, βιβλιοθήκες/διαπροσωπίες,  προσπέλαση αρχείων και Βάσεων, κα.  \r\n            Μαθησιακά αποτελέσματα:\r\n                • Να γνωρίζουν τις βασικές αρχές που διέπουν τον αντικειμενοστρεφή προγραμματισμό\r\n                • Να υλοποιούν αντικειμενοστρεφή προγράμματα\r\n                • Να σχεδιάζουν, να αναπτύσσουν και να υλοποιούν λογισμικό ως λύσεις σε προβλήματα, αποτελούμενο από αντικείμενα και αλλληλεπιδράσεις αυτών.\r\n                • Να δημιουργούν τάξεις, διεπαφές και αντικείμενα.\r\n                • Να χρησιμοποιούν σωστά τους modifiers της γλώσσας Java.\r\n                • Να διαχειρίζονται αποτελεσματικά και με χρήση των κατάλληλων εργαλείων τις εξαιρέσεις που ανακύπτουν\r\n                • Να χειρίζονται αρχεία προορισμένα για ανάγνωση και αποθήκευση δεδομένων\r\n                • Να συμβαδίζουν με τις εναλασσόμενες τεχνολογικές απαιτήσεις καθώς εκτίθενται σε σύγχρονες τεχνικές προγραμματισμού με στόχο την ποιότητα του λογισμικού τους\r\n                • Να εντοπίζουν, αξιολογούν και αξιοποιούν λογισμικό που υλοποιείται σύμφωνα με τις βασικές αρχές της αντικειμενοστρεφούς σχεδίασης.", "", "Αντικειμενοστρεφής Προγραμματισμός", 2, "ΠΛΠΛΗ37-2" },
                    { 4, "correct.mp3", "Η Εικονική Πραγματικότητα είναι το επιστημονικό πεδίο με αντικείμενο την αναπαράσταση κόσμων με τη βοήθεια ηλεκτρονικών υπολογιστών. Τα γραφικά με υπολογιστές διαδραματίζουν βασικό ρόλο στην Εικονική Πραγματικότητα, ενώ άλλα θέματα εξ’ ίσου σημαντικά είναι ο ήχος και το υλικό αλληλεπίδρασης με τους χρήστες. Η Εικονική Πραγματικότητα, κυρίως μέσω των Ευφυών Εικονικών Συστημάτων, έχει πλήθος εφαρμογών στην εκπαίδευση, την ψυχαγωγία, την προσομοίωση, την αλληλεπίδραση ανθρώπου – υπολογιστή και την επιστημονική έρευνα.\r\n \r\nΣκοποί του μαθήματος:\r\nΣτόχος του μαθήματος είναι η εξοικείωση των φοιτητών με τις βασικές θεωρητικές αρχές στις οποίες στηρίζεται η Εικονική Πραγματικότητα, καθώς και με σύγχρονες τεχνολογίες, μεθόδους και εργαλεία για τη δημιουργία ολοκληρωμένων εφαρμογών Εικονικής Πραγματικότητας.\r\n \r\nΔομή του μαθήματος:\r\nΚατά τη διάρκεια του μαθήματος θα καλυφθούν οι παρακάτω διδακτικές ενότητες:\r\n•	Eισαγωγή στην Εικονική Πραγματικότητα, ιστορική αναδρομή, βασικές έννοιες, στόχοι, εφαρμογές.\r\n•	Εισαγωγή στα Γραφικά με Υπολογιστές, συστήματα απεικόνισης, χρώμα, γεωμετρικά σχήματα, μετασχηματισμοί, κίνηση.\r\n•	Γράφημα σκηνής, υλοποιήσεις (Java3D, VRML/X3D, κ.ά.)\r\n•	VRML: σύνταξη, υλοποιήσεις, βασικά εργαλεία, γεωμετρία, μετασχηματισμοί, επαναχρησιμοποίηση κόμβων, εξωτερικές αναφορές, υλικά/χρώμα, φωτισμός, υφή, viewpoints, background, ήχος, κείμενο, billboards, HUDs.\r\n•	VRML: sensors και animation, γενικές αρχές μοντελοποίησης σκελετού, πρότυπα μοντελοποίησης κίνησης σώματος (H-Anim, κ.ά.), scripting, ενσωμάτωση σε εφαρμογές, PROTOs, προτεινόμενες πρακτικές σχεδιασμού και ανάπτυξης.\r\n•	Συστήματα υλικού και λογισμικού Εικονικής Πραγματικότητας.\r\n•	Second Life και OpenSimulator.\r\n\r\n\r\nΑντικείμενο μαθήματος:\r\n1. Δομή και λειτουργία ενός συστήματος εικονικής πραγματικότητας. Υλικό, Λογισμικό.\r\n2. Κατηγορίες συστημάτων Εικονικής Πραγματικότητας.\r\n3. Κόσμοι τρισδιάστατων γραφικών. Τρισδιάστατα μοντέλα αντικειμένων.\r\n4. Υφή επιφάνειας αντικειμένων. Διαχείριση πηγών φωτός, ήχων, κάμερας. Animations.\r\n5. Το περιβάλλον Unity3D.\r\n6. Ανάπτυξη εφαρμογών εικονικής πραγματικότητας στην πλατφόρμα Unity3D.\r\n\r\nΜαθησιακά αποτελέσματα:\r\n• Γνωρίζει τις συνιστώσες ενός συστήματος Εικονικής Πραγματικότητας.\r\n• Κατανοεί τις παραμέτρους ανάπτυξης συστημάτων Εικονικής Πραγματικότητας στο περιβάλλον της Unity3D.\r\n• Αναπτύσσει και υλοποιεί εφαρμογές εικονικής πραγματικότητας στο περιβάλλον της Unity3D.\r\n• Κατανοεί τη διαχείριση τρισδιάστατων μοντέλων αντικειμένων, κάμερας, ήχου, διάφορα είδη υφής, animations, κ.λπ.\r\n• Ανακαλύπτει διάφορα μοντέλα εικονικής πραγματικότητας στο Διαδίκτυο.\r\n• Συνδυάζει και ενσωματώνει τα παραπάνω, σε ένα ολοκληρωμένο λειτουργικό σύστημα Εικονικής Πραγματικότητας.\r\n• Εντοπίζει και αξιολογεί τα δεδομένα τυχόν προβλημάτων σε λειτουργικό επίπεδο.\r\n• Εφευρίσκει τρόπους επίλυσης των προβλημάτων και βελτιστοποίησης των λειτουργιών στα εικονικά περιβάλλοντα.", "", "Εικονική Πραγματικότητα", 7, "ΠΛΕΙΚ03" },
                    { 5, "correct.mp3", "1. Δομή και την λειτουργία ενός ευφυούς πράκτορα μέσα σε ένα περιβάλλον.\r\n            2. Αντιδρασιακοί πράκτορες (Reactive Agents) και Βουλητικοί πράκτορες (Deliberative Agents).\r\n            3. Ο κύκλος αντιλαμβάνομαι-αποφασίζω-ενεργώ (Sense-Decide-Act).\r\n            4. Tο μοντέλο BDI (Belief-Desire-Intention), εύρεση μονοπατιού (path finding), αναπαράσταση ενεργειών (action representation).\r\n            5. O σχεδιασμός ενεργειών (plan generation), ο σχεδιασμός ενεργειών, βασισμένος σε κίνητρα και η πυραμίδα του Maslow.\r\n            6. Η συναισθηματική υπολογιστική σε ευφυείς πράκτορες.\r\n            7. Η ανάπτυξη σχετικών συστημάτων ευφυών πρακτόρων.\r\n            8. Οι εφαρμογές στην πλατφόρμα Unity3D.\r\n\r\n                Μαθησιακά αποτελέσματα:\r\n            Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος ο φοιτητής :\r\n                • κατανοεί την δομή ενός ευφυούς πράκτορα,\r\n                • αναγνωρίζει τα χαρακτηριστικά τη λειτουργίας ενός ευφυούς πράκτορα και τους τρόπους επικοινωνίας του με ένα περιβάλλον,\r\n                • διακρίνει και εκτιμά πότε είναι απαραίτητος ένας Αντιδρασιακός πράκτορας (Reactive Agent) και πότε Βουλητικός πράκτορας (Deliberative Agent),\r\n                • εφαρμόζει τα μοντέλα “αντιλαμβάνομαι-αποφασίζω-ενεργώ” (Sense-Decide-Act), BDI (Belief-Desire-Intention), σε διάφορες περιπτώσεις πρακτόρων,\r\n                • αναπτύσσει αλγορίθμους για εύρεση μονοπατιού (path finding), και σχεδιασμό ενεργειών (plan generation),\r\n                • αξιολογεί πότε είναι απαραίτητο να εφαρμοστεί σχεδιασμός ενεργειών βασισμένος σε κίνητρα και συναισθηματική υπολογιστική σε ευφυείς πράκτορες.", "", "Ευφυείς Πράκτορες", 8, "ΠΛΕΥΠΡ01" },
                    { 6, "correct.mp3", "1.	Ο ρόλος των παιχνιδιών ως εργαλείων εκπαίδευσης, απόκτησης δεξιοτήτων και προσομοίωσης σε διάφορους τομείς, όπως  εκπαίδευση, υγεία και επιχειρηματικές διεργασίες. \r\n2.	Τύποι και κατηγορίες ηλεκτρονικών παιχνιδιών. Shoot-them-up, Role-playing, Adventure, First Person, Third Person, Δικτυακά παιχνίδια πολλών Παικτών. MMORPGs, Serious Games, Educational Games\r\n3.	Τύποι και χαρακτηριστικά παιχνιδιών. Επισκόπηση χαρακτηριστικών παραδειγμάτων παιχνιδιών σοβαρού σκοπού που έχουν αναπτυχθεί για διάφορους τομείς.\r\n4.	Σχεδίαση ενός παιχνιδιού: ο κόσμος, οι χαρακτήρες (παίκτες και πράκτορες) και οι ενέργειες τους, τα επίπεδα του παιχνιδιού. Αρχές και μεθοδολογίες σχεδίασης. Παρουσίαση των σχετικών εννοιών μέσω της σχεδίασης ενός απλού εκπαιδευτικού παιχνιδιού σε ένα εκπαιδευτικό προγραμματιστικό περιβάλλον, όπως το Unity3D. Αξιολόγηση της ποιότητας σχεδίασης υπαρχόντων παιχνιδιών σοβαρού σκοπού. Εργαλεία, μηχανές και διασυνδέσεις προγραμματισμού παιχνιδιών.\r\n5.	Προγραμματισμός παιχνιδιών: ο βρόχος του παιχνιδιού, αρχιτεκτονική του παιχνιδιού, γραφική διασύνδεση, αλληλεπίδραση και χειρισμός συμβάντων, κείμενο, 2D/3D γραφικά και κίνηση, πίνακες και συλλογές αντικειμένων.\r\n6.	Σχεδίαση ενός παιχνιδιού σοβαρού σκοπού χρησιμοποιώντας σύγχρονες μηχανές παιχνιδιών/βιβλιοθήκες και προγραμματισμός του παιχνιδιού σε C#.\r\n7.	Το περιβάλλον Unity3D. Ανάπτυξη ηλεκτρονικών παιχνιδιών στην πλατφόρμα Unity3D.\r\n \r\nΜαθησιακοί στόχοι:\r\nΣτόχος του μαθήματος είναι να αποκτήσουν οι φοιτητές: \r\n(α) βασικές γνώσεις για τον ρόλο, τους τύπους και τα χαρακτηριστικά των παιχνιδιών, καθώς και για τη συνολική διαδικασία δημιουργίας ενός παιχνιδιού,\r\n(β) ικανότητες σχεδίασης και υλοποίησης παιχνιδιών αξιοποιώντας σύγχρονα εργαλεία, διασυνδέσεις και γλώσσες προγραμματισμού,\r\n(γ) γνώσεις και ικανότητες χρήσης/δημιουργίας μετρικών αξιολόγησης παιχνιδιών βάσει των στόχων που τέθηκαν κατά τη σχεδίασή τους.\r\n\r\nΜαθησιακά αποτελέσματα:\r\n• Αναγνωρίζει τις συνιστώσες ενός ηλεκτρονικού παιχνιδιού (Computer Game).\r\n• Κατανοεί τις συνιστώσες των σοβαρών και εκπαιδευτικών παιχνιδιών (serious games, educational games)\r\n• Συνοψίζει τις απαιτούμενες γνώσεις σχετικά με την ανάπτυξη ηλεκτρονικών παιχνιδιών στο περιβάλλον της Unity3D.\r\n• Αναπτύσει εφαρμογές ηλεκτρονικών παιχνιδιών στο περιβάλλον της Unity3D\r\n• Ανακαλύπτει τους τρόπους διαχείρισης των διαφόρων συστατικών ενός ηλεκτρονικού παιχνιδιού, κ.λπ.\r\n• Μαθαίνει να ανακαλύπτει διάφορα συστατικά ηλεκτρονικών παιχνιδιών στο Διαδίκτυο (π.χ. 3D μοντέλα, sprites, animations, κ.λπ.)\r\n• Συνδυάζει όλα τα παραπάνω στο πλαίσιο του σχεδιασμού και της ανάπτυξης ενός ολοκληρωμένου ηλεκτρονικού παιχνιδιού.", "", "Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών", 7, "ΠΛΤΑΗΠ01" },
                    { 7, "correct.mp3", "Η κρυπτογραφία αποτελεί τα θεμέλια της ασφάλειας υπολογιστικών συστημάτων. Βασικό σκοπός είναι οι φοιτητές να αποκτήσουν το απαραίτητοθεωρητικό υπόβαθρο για την κατασκευή προγραμμάτων ή συσκευών οι οποίες ανταλλάσσουν δεδομένα με ασφάλεια μέσα σε μη ασφαλείς χώρους όπως τοδιαδίκτυο.\r\n                Αντικείμενο μαθήματος:\r\n            1. Ιστορική εξέλιξη της κρυπτογραφίας\r\n            2. Επανάληψη του απαραίτητου μαθηματικού υπόβαθρου (Ομάδες, Πεπερασμένα σώματα, Δακτύλιοι Zp και Zn, Πράξεις με υπόλοιπα, Γενικευμένος αλγόριθμος του Ευκλείδη, συνάρτηση του Euler)\r\n            3. Αλγόριθμοι ιδιωτικού κλειδιού (Μονοαλφαβητική αντικατάσταση, One-Time-Pad, Αλγόριθμοι των : Καίσαρα, Vigenere, Hill)\r\n            4. Αλγόρθιμοι τμημάτων: καταστάσεις (cipher modes: ECB, CBC, OFB κτλ) DES, AES\r\n            5. Αλγόριθμοι ροής: PRNG vs TRNG, LFSR, RC4\r\n            6. Αλγόριθμοι δημοσίου κλειδιού (Αλγόριθμος RSA,Αλγόριθμος ελλειπτικών καμπυλών)\r\n            7. Ομομορφική κρυπτογραφία\r\n            8. Συναρτήσεις κατακερματισμού\r\n            9. Ψηφιακές Υπογραφές\r\n            10. Εφαρμογές της κρυπτογραφίας και πρωτόκολλα\r\n            11. Κρυπτανάλυση (Γραμμική και διαφορική κρυπτανάλυση, Αλγόριθμοι παραγοντοποίησης)\r\n            12. Θέματα υλοποίησης\r\n\r\n                Μαθησιακά αποτελέσματα:\r\n            Μετά την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα είναι σε θέση:\r\n                • Να αξιολογήσουν την ασφάλεια που προσφέρει ένας αλγόριθμος κρυπτογράφησης.\r\n                • Να διακρίνουν και να κατηγοριοποιούν τα είδη και τη χρήση των αλγόριθμων.\r\n                • Να επιλέξουν τον κατάλληλο αλγόριθμο και να διακρίνουν τις παραμέτρους της ορθής ταση λειτουργίας του για την επιτυχή εφαρμογή του.\r\n                • Να υλοποιήσουν έναν αλγόριθμο κρυπτογράφησης.\r\n                • Να κατανοούν σε βάθος τις εφαρμογές και τα πρωτόκολλα της κρυπτογραφίας.\r\n                • Να γνωρίζουν τις μεθόδους και παραμέτρους σχεδιασμού και ανάπτυξης πρωτοκόλλων.\r\n                • Να εντοπίζουν και να αξιολογούν πιθανά κενά ασφάλειας ενός πρωτοκόλλου.\r\n                • Να αξιοποιούν όλα τα παραπάνω για την ανάπτυξη και τον έλεγχο προγραμμάτων", "", "Κρυπτογραφία", 5, "ΠΛΚΡΥ01" },
                    { 8, "correct.mp3", "Αντικείμενο μαθήματος:\r\nΗ ασφάλεια της πληροφορίας, των συστημάτων και των εφαρμογών, αποτελεί βασική απαίτηση κατά την ανάπτυξη και λειτουργία πληροφοριακών συστημάτων. Το μάθημα καλύπτει βασικά ζητήματα της ασφάλειας πληροφοριακών συστημάτων και περιλαμβάνει τις εξής ενότητες:\r\n1. Εισαγωγικές έννοιες ασφάλειας συστημάτων.\r\n2. Συστήματα Διαχείρισης Ασφάλειας.\r\n3. Κρυπτογραφικά συστήματα.\r\n4. Υποδομή Δημόσιας Κλείδας.\r\n5. Έλεγχος προσπέλασης – Ιδιωτικότητα.\r\n6. Ασφάλεια στις Τεχνολογίες.\r\n7. Ασφαλείς η/κ-υπηρεσίες.\r\n8. Εισαγωγή στην ασφάλεια δικτύων.\r\n\r\nΜαθησιακά αποτελέσματα:\r\nΜε την ολοκλήρωση του μαθήματος οι φοιτητές θα μπορούν να:\r\n• Αναγνωρίζουν και να κατανοούν το περιεχόμενο των απαιτήσεων ασφάλειας πληροφοριακών συστημάτων σε όλο των κύκλο ζωής τους.\r\n• Αντιλαμβάνονται και να εντοπίζουν τα θεωρητικά και πρακτικά ζητήματα ασφάλειας πληροφοριακών συστημάτων.\r\n• Κατανοούν τα δομικά και λειτουργικά χαρακτηριστικά των κρυπτογραφικών συστημάτων.\r\n• Εμβαθύνουν σε βασικούς τομείς του πεδίου αυτού και να υλοποιούν (μέσω προσομοίωσης) τεχνικές ή εφαρμογές σε δεδομένες καταστάσεις απειλών ή κινδύνων.\r\n• Εφαρμόζουν πρακτικά τεχνολογίες ασφάλειας πληροφοριακών συστημάτων σε πραγματικές συνθήκες.\r\n• Σχεδιάζουν νέες εφαρμογές και να επεκτείνουν τις ήδη υπάρχουσες.\r\n• Διαχειρίζονται απειλές και κινδύνους στα πληροφοριακά συστήματα με κριτική, δημιουργική και ερευνητική διάθεση για την εξεύρεση λύσεων.", "", "Ασφάλεια Πληροφοριακών Συστημάτων", 7, "ΠΛΠΛΗ47" },
                    { 9, "correct.mp3", "Αντικείμενο μαθήματος:\r\nΣκοπός του μαθήματος είναι η θεωρητική και πρακτική μελέτη θεμάτων ασφάλειας σε όλα τα επίπεδα δικτύων. Στο πλαίσιο του μαθήματος θα αναλυθούν οι παρακάτω ενότητες:\r\n1. Εισαγωγή στην ασφάλεια δικτύων.\r\n2. Ασφάλεια Δρομολόγησης.\r\n3. Σχεδιασμός συστημάτων Firewall.\r\n4. Ιδιωτικά Εικονικά Δίκτυα (VPN).\r\n5. Ασφάλεια επιπέδου δικτύου (IPSec).\r\n6. Ασφάλεια επιπέδου συνόδου (SSL/TLS).\r\nΜαθησιακά αποτελέσματα:\r\nΜετά την ολοκλήρωση του μαθήματος οι φοιτητές θα είναι σε θέση:\r\n• Να κατανοούν βασικές εννοιών ασφάλειας σε όλα τα επίπεδα των υπολογιστικών δικτύων με έμφαση στα TCP/IP δίκτυα.\r\n• Να διακρίνουν τα τρωτά σημεία στα συστήματα αυτά.\r\n• Να προβλέπουν τυχόν αδυναμίες και αστοχίες.\r\n• Να αναζητούν και να εφευρίσκουν/ανακαλύπτουν τρόπους επίλυσης/διαχείρισης για την περιστολή των τρωτών σημείων.\r\n• Να σχεδιάζουν, λαμβάνοντας υπόψη την ανάλυση των δεδομένων, νέες τεχνικές/μεθόδους.\r\n• Να προχωρούν σε πρακτική εφαρμογή συστημάτων ασφάλειας δικτύων, με έμφαση στη χρήση ελεύθερου λογισμικού / λογισμικού ανοικτού κώδικα.", "", "Ασφάλεια Δικτύων", 8, "ΠΛΑΣΦΔ01" },
                    { 10, "correct.mp3", "Αντικειμενο μαθήματος:\r\n• Στο μάθημα αυτό περιγράφονται με εισαγωγικό, αλλά πλήρη, τρόπο οι τεχνολογίες και τα πρωτόκολλα πάνω στα οποία στηρίζονται το Διαδίκτυο και ο Παγκόσμιος Ιστός και αναλύονται με περισσότερη λεπτομέρεια η ανάπτυξη εφαρμογών με τη χρήση συγκεκριμένων εργαλείων/γλωσσών, οι οποίες εκτελούνται στην πλευρά του πελάτη ή/και στην πλευρά του εξυπηρετητή.\r\n\r\n• Μερικές από τις έννοιες οι οποίες αντιμετωπίζονται είναι: στοίβα πρωτοκόλλων TCP/IP, επίπεδο μεταφοράς και διαδικτύου, HTML5, CSS3, Javascript, jQuery, κλήση AJAX, PHP nodejs, XML και JSON.\r\n\r\nΜαθησιακά αποτελέσματα:\r\nΜε την επιτυχή ολοκλήρωση του μαθήματος ο φοιτητής / τρια θα είναι σε θέση να:\r\n• Αναγνωρίζει τις βασικές αρχές των πρωτοκόλλων που στηρίζουν το Διαδίκτυο, με έμφαση στο IP και το TCP.\r\n• Έχει κατανοήσει τα βασικά χαρακτηριστικά εφαρμογών του διαδικτύου, τη δομή τους, τους στόχους τους όπως και τη διασύνδεσή τους.\r\n• Έχει διακρίνει και εμβαθύνει στις των βασικές τεχνικές και εργαλεία, η αξιοποίηση των οποίων διασφαλίζει τον προγραμματισμό και τον άρτιο έλεγχο μιας τέτοιας εφαρμογής.\r\n• Αξιοποιείτις προγραμματιστικές τεχνικές σε συνδυασμό με τη θεωρία του μαθήματος για αποδοτικότερο σχεδιασμό, βελτιστοποίση απόδοσης και λειτουργική/αποτελεσματική δημιουργία εφαρμογών στο διαδίκτυο.\r\n• Αναλύει, συγκρίνει, αξολογεί και προτείνει εναλλακτικές σχετικά με υπάρχουσες διαδικτυακές εφαρμογές και πιθανά προβλήματα απόδοσής τους.και με παραδοσιακές μεθόδους/εργαλεία.\r\n• Συνεργάζεται με τους συμφοιτητές του στη δημιουργία και εκτέλεση απλών και σύνθετων εφαρμογών διαδικτύου.", "", "Τεχνολογίες Διαδικτύου", 1, "ΠΛΠΛΗ90" },
                    { 11, "correct.mp3", "Αντικείμενο μαθήματος:\r\n1. Σχεδιασμός του συστήματος διεπαφής με τον χρήστη.\r\n2. Η ανθρώπινη πλευρά στην αλληλεπίδραση.\r\n3. Κλασσικά και σύγχρονα μέσα επικοινωνίας του υπολογιστή.\r\n4. Μοντέλα αλληλεπίδρασης και μοντέλα για τον χρήστη.\r\n5. Στόχοι, μέθοδοι, ανάλυση εργασιών.\r\n6. Χρηστικότητα, φιλικότητα λογισμικού.\r\n\r\nΜαθησιακά αποτελέσματα:\r\nΜε την ολοκλήρωση του μαθήματος οι φοιτητές/τριες θα είναι σε θέση:\r\n• Να γνωρίζουν, να κατανοούν και να εξηγούν τις αρχές του σχεδιασμού ενός συστήματος διεπαφής.\r\n• Να σχεδιάζουν εύχρηστα συστήματα διεπαφής με τους χρήστες για οποιαδήποτε εφαρμογή.\r\n• Να υλοποιούν συστήματα διεπαφής με τους χρήστες σε κάποια οπτική γλώσσα προγραμματισμού.\r\n• Να αξιολογούν την ευχρηστία των συστημάτων διεπαφής που έχουν αναπτυχθεί από άλλους.\r\n• Να προσδιορίζουν τις δυνατότητες και ικανότητες που μπορεί κανείς να περιμένει από τους ανθρώπους χρήστες για σχεδιασμό βελτιωμένων, μελλοντικών αλληλεπιδραστικών συστημάτων.\r\n• Να κατανοούν και να ταξινομούν εργασίες ιεραρχικά\r\n• Να εφαρμόζουν την ιεραρχική ανάλυση εργασιών.\r\n• Να αντιλαμβάνονται τη σημαντικότητα της ύπαρξης βοήθειας σε ένα αλληλεπιδραστικό σύστημα διεπαφής.\r\n• Να αναγνωρίζουν τις μορφές βοήθειας που μπορεί να παρέχεται σε ένα αλληλεπιδραστικό σύστημα διεπαφής.\r\n• Να σχεδιάζουν και να αναπτύσσουν εύχρηστη βοήθεια σε ένα αλληλεπιδραστικό σύστημα διεπαφής.\r\n• Να αναγνωρίζουν τα διάφορα εγχειρίδια χρήσης που συνοδεύουν ένα αλληλεπιδραστικό λογισμικό.\r\n• Να αναλύουν και να συνθέτουν ευκρινείς οδηγίες χρήσης σε αλλλεπιδραστικά λογισμικά.\r\n• Να συντάσσουν, με βάση τα παραπάνω, τα απαραίτητα εγχειρίδια χρήσης που συνοδεύουν ένα αλληλεπιδραστικό λογισμικό.\r\n• Να γνωρίζουν, κατανοούν και εξηγούν θεωρητικά μοντέλα αλληλεπίδρασης.\r\n• Να κατανοούν και να υλοποιούν τα στάδια του μοντέλου του Norman.\r\n• Να αναλύουν εναλλακτικούς τρόπους σχεδιασμού αλληλεπιδράσεων ενός συστήματος διεπαφής σύμφωνα με το μοντέλο του Νόρμαν.\r\n• Να προτείνουν και να αξιολογούν εναλλακτικούς τρόπους σχεδιασμού αλληλεπιδράσεων ενός συστήματος διεπαφής.\r\n", "", "Αλληλεπίδραση Ανθρώπου και Υπολογιστή", 5, "ΠΛΠΛΗ20" },
                    { 12, "correct.mp3", "Αντικείμενο μαθήματος:\r\nΑναγνώριση Προτύπων (pattern recognition) είναι η επιστημονική περιοχή που έχει στόχο την ταξινόμηση αντικειμένων σε κατηγορίες (κλάσεις) και συμπεριλαμβάνει το επιστημονικό πεδίο της Μηχανικής Μάθησης (machine learning). Σκοπός, επομένως, του παρόντος μαθήματος είναι να παρουσιάσει με ενιαίο τρόπο τις ευρύτερα χρησιμοποιούμενες τεχνικές και μεθοδολογίες για προβλήματα αναγνώρισης προτύπων.\r\nΤο περιεχόμενο του μαθήματος χωρίζεται σε οκτώ ενότητες και κάθε ενότητα πραγματοποιείται σε μία ή περισσότερες διαλέξεις.\r\n\r\nΕνότητα 1: Εισαγωγή στην Αναγνώριση Προτύπων\r\n\r\nΕνότητα 2: Ταξινομητές που βασίζονται στη θεωρία αποφάσεων του Bayes:\r\nΘεωρία Αποφάσεων του Bayes, H Γκαουσσιανή Συνάρτηση Πυκνότητας Πιθανότητας, Ταξινομητές Ελάχιστης Απόστασης, Ταξινομητής Ευκλείδειας Απόστασης, Ταξινομητής Mahalanobis Απόστασης, Εκτίμηση Μέγιστης Πιθανοφάνειας των παραμέτρων της Γκαουσσιανής Συνάρτησης Πυκνότητας Πιθανότητας\r\nΜοντέλα Μίξης, Ο Αλγόριθμος Expectation-Maximization, Παράθυρα Parzen\r\nΕκτίμηση Πυκνότητας Πιθανότητας με βάση τους k-πλησιέστερους γείτονες, Ο Ταξινομητής Naive Bayes, Ο Ταξινομητής Πλησιέστερων Γειτόνων\r\n\r\nΕνότητα 3: Ταξινομητές που βασίζονται στη Βελτιστοποίηση Συνάρτησης Κόστους:\r\nΟ αλγόριθμος Perceptron, H online έκδοση του αλγόριθμου Perceptron, Ταξινομητής Ελάχιστου Τετραγωνικού Σφάλματος, Περίπτωση πολλών κλάσεων, Μηχανές Διανυσματικής Στήριξης (ΜΔΣ/SVM): Η γραμμική περίπτωση, Επεκτάσεις για την περίπτωση πολλών κλάσεων, SVM: Η μη γραμμική περίπτωση, Ο Αλγόριθμος Perceptron με χρήση Πυρήνων, O Αλγόριθμος AdaBoost, Πολυστρωματικά Δίκτυα Perceptrons\r\n\r\nΕνότητα 4: Μετασχηματισμοί Δεδομένων: Γένεση Χαρακτηριστικών και Μείωση Αριθμού Διαστάσεων:\r\nΑνάλυση σε Κύριες Συνιστώσες (PCA), Ανάλυση σε Ιδιάζουσες Τιμές (SVD), Ανάλυση Γραμμικής Διάκρισης κατά Fisher, Ανάλυση σε Κύριες Συνιστώσες με Χρήση Πυρήνων, Μέθοδος Χαρτογράφησης Ιδιοτιμών του Laplacian Μητρώου\r\n\r\nΕνότητα 5: Επιλογή Χαρακτηριστικών:\r\nΑποκοπή Ακραίων Τιμών, Κανονικοποίηση Δεδομένων, Έλεγχος Υποθέσεων: t-Test,\r\nΚαμπύλη Receiver Operating Characteristic, Λόγος Διάκρισης κατά Fisher, Μέτρα Διαχωριστικής Ικανότητας μεταξύ κλάσεων, Απόκλιση, Απόσταση Bhattacharya και Φράγμα Chernoff, Μέτρα βασισμένα σε Μητρώα Διασποράς, Επιλογή Υποσυνόλου Χαρακτηριστικών, Βαθμωτή Επιλογή Χαρακτηριστικών, Διανυσματική Επιλογή Χαρακτηριστικών\r\n\r\nΕνότητα 6: Σύγκριση με Πρότυπα Αναφοράς: Απόσταση Edit, Σύγκριση Ακολουθιών Πραγματικών Αριθμών, Δυναμική Χρονική Στρέβλωση στα πλαίσια της Αναγνώρισης Φωνής\r\n\r\nΕνότητα 7: Κρυφά Μοντέλα Markov: Μοντελοποίηση, Αναγνώριση και Εκπαίδευση\r\n\r\nΕνότητα 8: Ομαδοποίηση: Βασικές Έννοιες και Ορισμοί, Αλγόριθμοι Ομαδοποίησης, Ακολουθιακοί Αλγόριθμοι, Αλγόριθμος BSAS, Βελτίωση Ομαδοποίησης, Αλγόριθμοι Ομαδοποίησης Βασιζόμενοι στη Βελτιστοποίηση Συνάρτησης Κόστους, Αλγόριθμοι Σαφούς Ομαδοποίησης, Αλγόριθμοι Μη-Σαφούς Ομαδοποίησης, Άλλοι Αλγόριθμοι Ομαδοποίησης, Αλγόριθμοι Ιεραρχικής Ομαδοποίησης, Γενικό Σχήμα Συγχώνευσης, Εξειδικευμένοι Αλγόριθμοι Συγχώνευσης, Επιλογή της καλύτερης Ομαδοποίησης\r\n\r\nΜαθησιακά αποτελέσματα:\r\nΑναγνώριση Προτύπων (pattern recognition) είναι η επιστημονική περιοχή που έχει στόχο την ταξινόμηση αντικειμένων σε κατηγορίες (κλάσεις) και συμπεριλαμβάνει το επιστημονικό πεδίο της Μηχανικής Μάθησης (machine learning). Σκοπός, επομένως, του παρόντος μαθήματος είναι να παρουσιάσει με ενιαίο τρόπο τις ευρύτερα χρησιμοποιούμενες τεχνικές και μεθοδολογίες για προβλήματα αναγνώρισης προτύπων.\r\n\r\nΜε την επιτυχή́ ολοκλήρωση του μαθήματος ο φοιτητής θα είναι σε θέση:\r\n• Να διαθέτει προχωρημένες γνώσεις σε αλγορίθμους, τεχνικές και μεθοδολογίες αναγνώρισης προτύπων, όπως στην Μπεϋζιανή θεωρία ταξινόμησης, σε γραμμικούς και μη γραμμικούς ταξινομητές, σε Νευρωνικά δίκτυα, σε Κρυφά Μοντέλα Markov, σε αλγορίθμους ομαδοποίησης και τεχνικές επιλογής χαρακτηριστικών και μείωσης αριθμού διαστάσεων δεδομένων.\r\n• Να αντιλαμβάνεται πώς συνδυάζονται γνώσεις πιθανοτήτων, στατιστικής, γραμμικής άλγεβρας και βελτιστοποίησης για τη δημιουργία αλγορίθμων αναγνώρισης προτύπων.\r\n• Να αναλύει προβλήματα πραγματικών δεδομένων (ανοικτής πρόσβασης), στα οποία απαιτείται η σχεδίαση/ανάπτυξη/υλοποίηση συστημάτων ταξινόμησης αντικειμένων.\r\n• Να εκτιμά το εφικτό των προβλημάτων αυτών, να επιλέγει τους κατάλληλους αλγορίθμους/τεχνικές και να προβαίνει στην αποτίμηση και συγκριτική μελέτη των επιδόσεων εναλλακτικών λύσεων.\r\n• Να διαχειρίζεται τον φόρτο και την πολυπλοκότητα τέτοιων προβλημάτων πραγματικών δεδομένων σε περιβάλλον ομαδικής εργασίας.\r\n• Να κατέχει προχωρημένες προγραμματιστικές δεξιότητες σε περιβάλλον ανάπτυξης λογισμικού Python/MATLAB/GNU Octave για την υλοποίηση αλγορίθμων, τεχνικών και μεθόδων ταξινόμησης αντικειμένων.\r\n• Να εκτιμά και να επαναχρησιμοποιεί υφιστάμενες υλοποιήσεις συναρτήσεων ανοιχτού κώδικα, σχετικών με το πεδίο της αναγνώρισης προτύπων, όπως των συναρτήσεων της βιβλιοθήκης scikit-learn. \r\n• Να διακρίνει έννοιες συναφείς της αναγνώρισης προτύπων, στα συγγενή επιστημονικά πεδία της Μηχανικής Μάθησης, της Ανάλυσης Δεδομένων και της Τεχνητής Νοημοσύνης.\r\n", "", "Αναγνώριση Προτύπων", 5, "ΠΛΠΛΗ81-2" },
                    { 13, "correct.mp3", "Αντικείμενο μαθήματος:\r\n                     1. Εισαγωγικές γνώσεις βασικών εννοιών στην Τεχνητή Νοημοσύνη και τα Έμπειρα Συστήματα.\r\n                     2. Επίλυση προβλημάτων σε επιλεγμένες περιοχές, όπως για παράδειγμα οι γενετικοί αλγόριθμοι με μεθόδους τεχνητής νοημοσύνης.\r\n                     3. Βασικές γνώσεις στη Μηχανική Μάθηση και στα Νευρωνικά Δίκτυα.\r\n                     \r\n                     Μαθησιακά αποτελέσματα:\r\n                     Με την ολοκλήρωση του μαθήματος οι φοιτητές/τριες αναμένεται ότι :\r\n                     • θα γνωρίζουν τις βασικές έννοιες της Τεχνητής Νοημοσύνης (ΤΝ) και των Έμπειρων Συστημάτων (ΕΣ),\r\n                     • θα μπορούν να αναγνωρίζουν, να περιγράφουν και να αναπαριστούν προβλήματα λογικής,\r\n                     • θα αναπτύσσουν αλγόριθμους αναζήτησης λύσης,\r\n                     • θα εστιάζουν, θαεμβαθύνουν, θα διακρίνουν και θα καταδεικνύουν τρόπους επίλυσης προβλημάτων με επιλεγμένες μεθόδους τεχνητής νοημοσύνης (πχ. γενετικοί αλγόριθμοι, ασαφή λογική),\r\n                     • θα ελέγχουν και θα διαχειρίζονται με συστηματικό τρόπο την Ασάφεια και την Αβεβαιότητα σε συστήματα κανόνων,\r\n                     • θα γνωρίζουν και θα προσδιορίζουν τα σημασιολογικά δίκτυα, καθώς επίσης και θα εφαρμόζουν συμπερασματολογία σε αυτά,\r\n                     • θα κατέχουν βασικές γνώσεις στη Μηχανική Μάθηση και στα Νευρωνικά Δίκτυα.\r\n", "", "Τεχνητή Νοημοσύνη και Έμπειρα Συστήματα", 6, "ΠΛΠΛΗ18-1" },
                    { 14, "correct.mp3", "Αντικείμενο μαθήματος:\r\nΤο μάθημα προσφέρει γνώσεις σχετικά με τη σχεδίαση και υλοποίηση μεθόδων και τεχνικών Αναλυτικής Δεδομένων (ΑΔ), η οποία αποτελεί μέρος μιας από τις πιο σύγχρονες τάσεις στην περιοχή της Πληροφορικής, αυτής της Επιστήμης Δεδομένων (Data Science). Αναλυτικά περιλαμβάνει:\r\n1. Εισαγωγή στην Αναλυτική Δεδομένων - Προπαρασκευή δεδομένων (Data Preprocessing) για τους σκοπούς της αναλυτικής.\r\n2. Αλγόριθμοι και τεχνικές Αναλυτικής Δεδομένων: κατηγοριοποίηση/ταξινόμηση (classification), συσταδοποίηση (clustering), εξόρυξη συχνών προτύπων (frequent pattern mining).\r\n3. Ειδικά – προηγμένα θέματα (αναλυτική δεδομένων ήχου/εικόνας, γεωγραφικής πληροφορίας).\r\n4. Εργαστηριακές ασκήσεις σε δημοφιλείς γλώσσες προγραμματισμού (R, Python).\r\n\r\nΜαθησιακά αποτελέσματα:\r\nΜετά την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές:\r\n• Θα έχουν εμβαθύνει στις έννοιες και τα χαρακτηριστικά της Αναλυτικής Δεδομένων.\r\n• Θα αναγνωρίζουν και θα εφαρμόζουν τα διάφορα στάδια προπαρασκευής δεδομένων.\r\n• Θα επιλέγουν μεταξύ διαφορετικών αλγορίθμων και τεχνικών για την εκάστοτε ανάλυση αναλόγως της φύσης των δεομένων.\r\n• Θα είναι σε θέση να χρησιμοποιούν τη γνώση και την κατανόηση που απέκτησαν ως μελλοντικοί Επιστήμονες Δεδομένων (Data Scientists).\r\n• Θα είναι πλήρως ενημερωμένοι για περαιτέρω εξειδίκευση στο χώρο της Επιστήμης Δεδομένων.\r\n", "", "Αναλυτική Δεδομένων", 6, "ΠΛΑΝΑΔΕ01" },
                    { 15, "correct.mp3", "Αντικείμενο μαθήματος:\r\nΤο μάθημα προσφέρει γνώσεις σχετικά με τη σχεδίαση και χρήση των Βάσεων Δεδομένων (ΒΔ), οι οποίες αποτελούν κομβικά συστατικά ενός οποιουδήποτε Πληροφοριακού Συστήματος (ΠΣ). Πιο συγκεκριμένα περιλαμβάνει:\r\n1. Θεωρητικό υπόβαθρο (Σχεσιακό Μοντέλο, Σχεσιακή Άλγεβρα),\r\n2. Εκμάθηση της γλώσσας SQL (η οποία αποτελεί το de-facto standard των συστημάτων διαχείρισης ΒΔ),\r\n3. Τεχνικές σχεδίασης Σχεσιακών ΒΔ, συμπεριλαμβανομένης της θεωρίας κανονικοποίησης,\r\n4. Εργαστηριακές ασκήσεις σε ένα δημοφιλές σύστημα διαχείρισης ΒΔ (PostgreSQL).\r\n\r\nΜαθησιακά αποτελέσματα:\r\nΜετά την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές:\r\n• Θα κατανοούν θέματα σχετικά με το απαιτούμενο θεωρητικό υπόβαθρο των ΒΔ, όπως το Σχεσιακό Μοντέλο και η γλώσσα SQL, ως κομβικών συστατικών ενός ΠΣ.\r\n• Θα αξιοποιούν τη θεωρητική γνώση για να σχεδιάζουν και να αναλύουν τα δεδομένα ενός ΠΣ.\r\n• Θα χρησιμοποιούν τη γλώσσα SQL έχοντας διδαχθεί τη θεωρητικό υπόβαθρο της Σχεσιακής Άλγεβρας.\r\n• Θα ενσωματώνουν τις τεχνικές σχεδίασης Σχεσιακών Βάσεων Δεδομένων για την αποτελεσματική κατασκευή και αξιοποίησή τους.\r\n• Θα διακρίνουν τις λοιπές παραμέτρους για να σχεδιάζουν και να αναπτύσσουν Βάσεις Δεδομένων με διευρυμένες δυνατότητες.\r\n• Θα έχουν σφαιρική ενημέρωση, ερευνητική και εμπειρική, για περαιτέρω εξειδίκευση στο χώρο των ΠΣ και των ΒΔ (επαγγελματικά ή/και ακαδημαϊκά.\r\n", "", "Βάσεις Δεδομένων", 4, "ΠΛΠΛΗ30-1" },
                    { 16, "correct.mp3", "Αντικείμενο μαθήματος:\r\nΤο μάθημα προσφέρει γνώσεις σχετικά με την εσωτερική λειτουργία των Συστημάτων Διαχείρισης Βάσεων Δεδομένων (ΣΔΒΔ). Πιο συγκεκριμένα καλύπτονται τα εξής θέματα:\r\n1. Φυσική οργάνωση ΒΔ (αρχεία και ευρετήρια).\r\n2. Επεξεργασία και βελτιστοποίηση επερωτήσεων.\r\n3. Διαχείριση δοσοληψιών (θέματα συνδρομικότητας και ανάνηψης).\r\n4. Ειδικές αρχιτεκτονικές ΒΔ (κατανεμημένες, παράλληλες ΒΔ, αρχιτεκτονικές Big Data).\r\n5. Εργαστηριακές ασκήσεις σε δύο δημοφιλή ΣΔΒΔ (PostgreSQL, MongoDB).\r\n\r\nΜαθησιακά αποτελέσματα:\r\nΜετά την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές:\r\n• Θα αναγνωρίζουν θα κατανοούν τη φυσική οργάνωση και ενδεδειγμένη δομή των Συστημάτων Διαχείρισης Βάσεων Δεδομένων (ΣΔΒΔ), ως κομβικών συστατικών ενός Πληροφοριακού Συστήματος (ΠΣ).\r\n• Θα είναι σε θέση να χρησιμοποιούν τη γνώση και την κατανόηση αυτή για να σχεδιάζουν και να αναπτύσσουν δράσεις προγραμματισμού των ΣΔΒΔ.\r\n• Θα βελτιστοποιούν τις επερωτήσεις εφαρμόζοντας τεχνικές και μεθόδους αποτελεσματικής επεξεργασίας τους.\r\n• Θα διαχειρίζονται αποτελεσματικά θέματα που σχετίζονται με τις δοσοληψίες.\r\n• Θα αναγνωρίζουν τα χαρακτηριστικά των ειδικών αρχιτεκτονικών ΒΔ ανάλογα με τον τύπο τους.\r\n• Θα οργανώνουν και θα δημιουργούν την υποδομή για την ορθή λειτουργία των ΠΣ.\r\n• Θα υιοθετούν επικοινωνιακή και συνεργατική διάθεση, ως στοιχεία απαραίτητα για περαιτέρω επιστημονική ή επαγγελματική εξειδίκευση στο χώρο των ΒΔ.\r\n", "", "Συστήματα Διαχείρισης Βάσεων Δεδομένων", 5, "ΠΛΠΛΗ33-2" },
                    { 17, "correct.mp3", "Αντικείμενο μαθήματος\r\nΤο μάθημα ασχολείται με τη θεωρητική μελέτη και την πρακτική εξάσκηση σε θέματα προγραμματισμού στο διαδίκτυο και στον παγκόσμιο ιστό, όπως προγραμματισμό sockets, την υλοποίηση εφαρμογών πελάτη-εξυπηρετητή και τις αρχιτεκτονικές 3-tier. Αναλυτικότερα περιλαμβάνει τα ακόλουθα:\r\n1. Αρχιτεκτονική Πελάτη-Εξυπηρετητή (Client-Server)\r\n2. Δικτυακός Προγραμματισμός¬ (socket programming, tcp-udp)\r\n3. Πρωτόκολλο HTTP (περιγραφή, σύνδεση με το μοντέλο πελάτη εξυπηρετητή)\r\n4. Προγραμματισμός HTTP: Υλοποίηση Web server\r\n5. Παραλλαγές Αρχιτεκτονικής Πελάτη-Εξυπηρετητή (3-trier αρχιτεκτονικές)\r\n6. Προγραμματισμός από την μεριά του εξυπηρετητή (Java servlets)\r\n7. Μόνιμη αποθήκευση δεδομένων σε διαδικτυακές εφαρμογές\r\n\r\nΜαθησιακά αποτελέσματα:\r\nΜε την ολοκλήρωση του μαθήματος οι φοιτητές/τριες αναμένεται ότι :\r\n• θα μπορούν να παραθέσουν τις βασικές αρχιτεκτονικές για την ανάπτυξη εφαρμογών στο διαδίκτυο και στον παγκόσμιο ιστό, όπως είναι οι αρχιτεκτονικές client-server και 3-tier,\r\n• θα γνωρίζουν τις βασικές τεχνολογίες για το διαδίκτυο και τον παγκόσμιο ιστό όπως είναι τα πρωτόκολλα IP, TCP, UDP και HTTP, η τεχνολογία sockets, οι διακομιστές ιστού (web servers) και οι διακομιστές εφαρμογών (application servers),\r\n• θα μπορούν να αναπτύσσουν εφαρμογές για τον παγκόσμιο ιστό με χρήση κατάλληλου προγραμματιστικού περιβάλλοντος,\r\n• θα μπορούν να υλοποιούν προγραμματισμό sockets (TCP sockets και UDP sockets),\r\n• θα παράγουν εφαρμογές πελάτη-εξυπηρετητή,\r\n• θα μπορούν να ενσωματώνουν στις εφαρμογές τους την αρχιτεκτονική 3-tier\r\n", "", "Προγραμματισμός στο Διαδίκτυο και στον Παγκόσμιο Ιστό", 4, "ΠΛΔΠΙ01" },
                    { 18, "correct.mp3", "Αντικείμενο μαθήματος:\r\n1. Δικτυοκεντρικός Υπολογισμός (Network Computing)\r\n• Τεχνολογίες διαδικτύου και παγκόσμιου ιστού\r\n• Περιήγηση και ανάκτηση πληροφοριών (Discovery), λογισμικό φυλλομετρητών (Browsers) και διακομιστών (Servers)\r\n• Μέσα επικοινωνίας (Communicatrion)\r\n• Ηλεκτρονική συνεργασία (Collaborartion), εργαλεία τηλεσυνεργασίας\r\n• Υποδομές Πληροφορικής\r\n\r\n2. Ηλεκτρονικό Εμπόριο και Ηλεκτρονικό Επιχειρείν\r\n• Επιχειρηματικά μοντέλα στο ηλεκτρονικό επιχειρείν\r\n• Συστατικά του ηλεκτρονικού εμπορίου και του ηλεκτρονικού επιχειρείν\r\n• Υπηρεσίες προς τον καταναλωτή\r\n• Συμπεριφορά Καταναλωτών και έρευνα αγοράς\r\n• Ηλεκτρονικό εμπόριο σε επιχειρήσεις και οργανισμούς\r\n• Υποστηρικτικές υπηρεσίες στο ηλεκτρονικό εμπόριο\r\n• Θέματα υλοποίησης του ηλεκτρονικού επιχειρείν\r\n\r\n3. Νέες Τεχνολογίες και Εφαρμογές\r\n• Διείσδυση των νέων τεχνολογιών στα δικτυοκεντρικά πληροφοριακά συστήματα\r\n• Κινητή υπολογιστική (Mobile Computing, Wireless Computing)\r\n     ◦ Τεχνολογίες\r\n     ◦ Υποδομές\r\n     ◦ Εφαρμογές για την υποστήριξη των πελατών\r\n• Υπολογιστική νέφους (Cloud Computing)\r\n     ◦ Χαρακτηριστικά και μοντέλα της υπολογιστικής νέφους\r\n     ◦ Τύποι υπολογιστικού νέφους\r\n     ◦ Διαμοιρασμός πόρων\r\n     ◦ Κλιμάκωση-Επέκταση\r\n     ◦ Πλεονεκτήματα και μειονεκτήματα του υπολογισμού στο νέφος\r\n• Εφαρμογή της κινητής υπολογιστικής και της υπολογιστικής νέφους\r\n• Η πανταχού παρούσα υπολογιστική - Διάχυτος υπολογισμός (Pervasive-Ubiquitous Computing)\r\n     ◦ Αξιοποίηση ετερογενών συσκευών\r\n     ◦ Eμπόριο βασισμένο στην τοποθεσία\r\n     ◦ Κινητό εμπόριο\r\n     ◦ Έξυπνα σπίτια και έξυπνα σχολεία\r\n\r\n4. Κατανεμημένα Συστήματα Βασισμένα σε Κείμενο\r\n• Τι είναι τα κατανεµηµένα συστήµατα\r\n• Ο παγκόσμιος ιστός\r\n     ◦ Οργάνωση\r\n     ◦ Χώροι ονομάτων (URI, URN και URL)\r\n• Τύποι εγγράφων στον παγκόσμιο ιστό\r\n• Αρχιτεκτονική και υποδομή του παγκόσμιου ιστού\r\n• Πρωτόκολλο HTTP\r\n     ◦ Συνδέσεις\r\n     ◦ Μηνύματα\r\n• Εξυπηρετητές ιστού\r\n     ◦ Εξυπηρετητής Apache\r\n     ◦ Αναπαραγωγή και Συσταδοποίηση των εξυπηρετητών ιστού\r\n• Tο μοντέλο πελάτη-εξυπηρετητή\r\n• Ασφάλεια επικοινωνίας πελάτη-εξυπηρετητή\r\n• Εξυπηρετητές εφαρμογών ιστού\r\n\r\n5. Βασικές και Προηγμένες Τεχνικές Προγραμματισμού και Λειτουργίας στον Παγκόσμιο Ιστό\r\n• Νέες τεχνολογίες στην πλευρά του πελάτη\r\n     ◦ Γλώσσες σήμανσης HTML και HTML5\r\n     ◦ Κανόνες μορφοποίησης (CSS)\r\n     ◦ JavaScript και βιβλιοθήκες JQuery και jQuery Mobile\r\n• Η γλώσσα eXtensible Markup Language (XML)\r\n     ◦ Document Type Definition (DTD)\r\n     ◦ Σχήμα XML (XML Schema)\r\n     ◦ Extensible Stylesheet Language (XSL)\r\n• To πρότυπο ανταλλαγής δεδομένων JSON\r\n• Ασύγχρονη επικοινωνία (AJAX)\r\n• Άλλες τεχνολογίες\r\n     ◦ Python\r\n     ◦ JavaScript βιβλιοθήκες Underscore.js, MooTools και Node.js\r\n     ◦ Java Applets\r\n\r\n6. Διαδικτυακός Προγραμματισμός με Java: Servlets και JSP\r\n• H γλώσσα προγραμματισμού Java\r\n• Java Servlets\r\n     ◦ Παραδείγματα\r\n     ◦ Μειονεκτήματα\r\n• Διαχείριση συνεδριών\r\n• Αυθεντικοποίηση μέσω σύνδεσης σε βάση δεδομένων\r\n• Java Server Pages (JSP) και βιβλιοθήκες δομημένης ανάπτυξης εφαρμογών ιστού\r\n• Αρχιτεκτονική Model-View-Controller (MVC)\r\n\r\nΜαθησιακά αποτελέσματα:\r\nΜε την ολοκλήρωση του μαθήματος οι φοιτητές θα είναι σε θέση:\r\n• Να γνωρίζουν τις νέες τεχνολογικές τάσεις που αφορούν τα πληροφοριακά συστήματα στο διαδίκτυο.\r\n• Να περιγράφουν τον ρόλο των δικτυοκεντρικών πληροφοριακών συστημάτων στο σύγχρονο επιχειρηματικό περιβάλλον και στη δικτυακή οικονομία (Networked Economy).\r\n• Να γνωρίζουν τις εφαρμογές που έχουν τα δικτυοκεντρικά πληροφοριακά συστήματα στο ηλεκτρονικό επιχειρείν (e-business) και στο ηλεκτρονικό εμπόριο (e-commerce).\r\n• Να γνωρίζουν τις τεχνολογίες που χρησιμοποιούνται στον δικτυοκεντρικό υπολογισμό (Network Computing).\r\n• Να προσδιορίζουν τις αλλαγές, τις προοπτικές και τους κινδύνους που έχει επιφέρει η ανάπτυξη της κινητής υπολογιστικής, της υπολογιστικής νέφους και του διάχυτου υπολογισμού στα δικτυοκεντρικά πληροφοριακά συστήματα και κατ’ επέκταση στις επιχειρηματικές διαδικασίες.\r\n• Να γνωρίζουν τα χαρακτηριστικά των υποδομών που απαιτούνται για τη λειτουργία και την προώθηση των δικτυοκεντρικών πληροφοριακών συστημάτων.\r\n• Να χρησιμοποιούν JavaScript βιβλιοθήκες (π.χ. jQuery, Underscore.js).\r\n• Να υλοποιούν μικροεφαρμογές (Java Applets/Servlets) με χρήση της γλώσσας προγραμματισμού Java.\r\n• Να δημιουργούν ιστοσελίδες με δυναμικό περιεχόμενο με την τεχνολογία Java Server Pages (JSP).\r\n• Να αξιοποιούν μοντέρνες τεχνικές διαδικτυακού προγραμματισμού, όπως πλαισίων εφαρμογών ιστού (Struts, Spring).\r\n• Να γνωρίζουν τη χρησιμότητα των υπηρεσιών ιστού, του πρωτοκόλλου SOAP, της περιγραφικής γλώσσας WSDL και του προτύπου UDDI.\r\n• Να δημιουργούν και να συνθέτουν υπηρεσίες ιστού (web services).\r\n• Να αναγνωρίζουν τις βασικές έννοιες, τα πλεονεκτήματα και τον τρόπο υλοποίησης της υπηρεσιοστραφούς αρχιτεκτονικής (SOA).\r\n• Να καταγράφουν τις λειτουργικές προδιαγραφές που απαιτεί η ανάπτυξη ενός δικτυοκεντρικού πληροφοριακού συστήματος και να προτείνουν τη μεθοδολογία ανάπτυξης που θα υιοθετηθεί.\r\n• Να αξιοποιούν τα εργαλεία και τις τεχνικές που παρουσιάστηκαν στο μάθημα ώστε να αναπτύσσουν ολοκληρωμένες διαδικτυακές εφαρμογές και βάσεις δεδομένων.\r\n", "", "Πληροφοριακά Συστήματα στο Διαδίκτυο", 8, "ΠΛΣΥΔ01" },
                    { 19, "correct.mp3", "Αντικείμενο μαθήματος:\r\nΣτο μάθημα αυτό περιγράφονται με εισαγωγικό, αλλά πλήρη, τρόπο οι βασικές έννοιες και αρχές δικτύωσης και τα πρωτόκολλα, πάνω στα οποία στηρίζονται τα διάφορα είδη δικτύων, με έμφαση στα πρωτόκολλα του Διαδικτύου.\r\n\r\nΣυγκεκριμένα αναλύονται:\r\n\r\nΒασικές έννοιες και αρχές δικτύωσης\r\n• είδη δικτύων (δίκτυα μεταγωγής, διαδίκτυα), σχεδίαση (αρχιτεκτονική αναφοράς OSI και αρχιτεκτονική TCP/IP)\r\n\r\nΣύνδεσμοι και μετάδοση πληροφορίας\r\n• διάδοση και μετάδοση σήματος μέσα από ένα σύνδεσμο, ταχύτητα μετάδοσης, πολυπλεξία\r\n• αλγόριθμοι και τεχνολογίες προσπέλασης σε κοινό μέσο\r\n• αξιόπιστη μετάδοση\r\n\r\nΔίκτυα Μεταγωγής\r\n• προώθηση και τεχνολογίες μεταγωγής\r\n\r\nΔιαδίκτυα\r\n• γενικές αρχές διαδικτύωσης, δρομολόγηση, είδη αλγόριθμων δρομολόγησης\r\n• δίκτυα IP: διευθυνσιοδότηση, ARP, προώθηση, δρομολόγηση (OSPF,BGP), κατακερματισμός, πρωτόκολλο ICMP\r\n\r\nΕπικοινωνία από άκρο σε άκρο\r\n• επικοινωνία διεργασιών (βασικοί μηχανισμοί)\r\n• πρωτόκολλα UDP και TCP\r\n\r\nΑσύρματες Επικοινωνίες\r\n• Αρχές λειτουργίας κινητών επικοινωνιών\r\n• Πρωτόκολλα πρόσβασης στο μέσο σε τοπικά ασύρματα δίκτυα\r\n\r\nΕπίδοση Εφαρμογών\r\n• Κωδικοποίηση και ποιότητα υπηρεσιών\r\n• πρωτόκολλα για μεταφορά βίντεο\r\n\r\nΜαθησιακά αποτελέσματα:\r\nΜε την επιτυχή ολοκλήρωση του μαθήματος ο φοιτητής / τρια θα:\r\n• Κατανοεί θεμελιώδεις έννοιες (π.χ. Αρχιτεκτονικές δικτύων: Μεταγωγής, Μεταγωγή κυκλώματος και μεταγωγή πακέτου, Τύποι δικτύων (τοπικά δίκτυα, μητροπολιτικά δίκτυα, δίκτυα ευρείας περιοχής, ενσύρματα και ασύρματα δίκτυα), Τοπολογίες δικτύων (πλέγμα, αρτηρία, δακτύλιος, αστέρας).\r\n• Θα αναγνωρίζει τα Χαρακτηριστικά απόδοσης (π.χ) καθυστέρηση, εύρος ζώνης, ρυθμαπόδοση, ρυθμός απώλειας πακέτων.\r\n• Θα προσδιορίζει και θα ταξινομεί τα στάδια Σχεδίασης Δικτύων: Διαστρωμάτωση, Πρωτόκολλα και Πρότυπα, Συνδεσμοστραφείς και ασυνδεσμικές υπηρεσίες.\r\n• Θα διακρίνει το μοντέλο αναφοράς OSI, τη στοίβα πρωτοκόλλων TCP/IP και τη χρήση τους στους Οργανισμούς Τυποποίησης\r\n• Θα είναι σε θέση να προσεγγίζει και να ορίζει το Φυσικό επίπεδο: αναλογική και ψηφιακή αναπαράσταση, Κωδικοποίηση και διαμόρφωση, Μέσα μετάδοσης, Ανίχνευση και Διόρθωση σφαλμάτων, Πολυπλεξία.\r\n• Θα διακρίνει το Επίπεδο Συνδέσμου Μετάδοσης Δεδομένων: πλαισίωση, έλεγχος σφαλμάτων (πρωτόκολλα ARQ), έλεγχος ροής, πρότυπα και πρωτόκολλα δευτέρου επιπέδου (DSL, ISDN).\r\n• Θα έχει εμπεδώσει τα επίπεδα του Ελέγχου πολλαπλής πρόσβασης: διευθυνσιοδότηση, πολλαπλή πρόσβαση με και χωρίς ανταγωνισμό, τεχνολογίες τοπικών δικτύων (Ethernet, Token Ring, Gigabit Ethernet), Επαναλήπτες, γέφυρες, κατανεμητές και μεταγωγείς.\r\n• Θα διαχειρίζεται τα Ασύρματα τοπικά δίκτυα (wifi) και δίκτυα κινητών επικοινωνιών (3η και 4η γενιά).\r\n• Θα υλοποιεί τις εφαρμογές των Δικτύων Μεταγωγής (μεταγωγή πακέτου και εικονικά κυκλώματα, μεταγωγείς) και θα σχεδιάζει/αναπτύσσει τη Διαδικτύωση (δρομολόγηση, αλγόριθμοι δρομολόγησης διανυσμάτων απόστασης και κατάστασης συνδέσμων), τον Έλεγχο συμφόρησης, Το πρωτόκολλο IP (διευθυνσιοδότηση, πρωτόκολλα δρομολόγησης OSPF και BGP, κατακερματισμός).\r\n• Θα κατανοεί τις αρχές πίσω από τις υπηρεσίες του επιπέδου μεταφοράς δεδομένων (Πολύπλεξη/αποπολύπλεξη(multiplexing/demultiplexing, αξιόπιστη μεταφορά δεδομένων, έλεγχος ροής (flow control), έλεγχος συμφόρησης (congestion control) και θα τηρεί τα πρωτόκολλα επιπέδου μεταφοράς του Διαδικτύου, UDP: ασυνδεσμική μεταφορά, TCP: συνδεσμική μεταφορά.\r\n• Θα ελέγχει το επίπεδο συμφόρησης του TCP.\r\n• Θα αναπτύσσει και θα εφαρμόζει εννοιολογικά, σχεδιαστικά θέματα πρωτοκόλλων δικτυακών εφαρμογών.\r\n• Θα αξιοποιεί μοντέλα υπηρεσιών επιπέδου μεταφοράς, μοντέλο πελάτη εξυπηρετητή (client-server), μοντέλο ομότιμων (peer-to-peer), δημοφιλή πρωτόκολλα επιπέδου εφαρμογής: HTTP, SMTP / POP3 / IMAP, DNS.\r\n• Θα αναπτύσσει νέα πρωτόκολλα και εφαρμογές αξιολογώντας την κάθε περίπτωση.\r\n", "", "Δίκτυα Υπολογιστών", 4, "ΠΛΠΛΗ44" },
                    { 20, "correct.mp3", "Αντικείμενο μαθήματος:\r\nΤο μάθημα πραγματεύεται την ανάπτυξη αλγορίθμων που επιτρέπουν σε μηχανές να κατανοούν τον οπτικό κόσμο. Εντάσσεται δε, στο ευρύτερο επιστημονικό πεδίο της Τεχνητής Νοημοσύνης. Σκοπός, επομένως, του παρόντος μαθήματος είναι να παρουσιάσει με ενιαίο τρόπο τις ευρύτερα χρησιμοποιούμενες τεχνικές και μεθοδολογίες για προβλήματα Ανάλυσης Εικόνας.\r\n\r\nΤο περιεχόμενο του μαθήματος χωρίζεται στις ακόλουθες 10 ενότητες:\r\n• ΕΝΟΤΗΤΑ 1: Εισαγωγή στην Ανάλυση Εικόνας\r\n• ΕΝΟΤΗΤΑ 2: Σημειακοί, Αλγεβρικοί και Γεωμετρικοί Τελεστές\r\n• ΕΝΟΤΗΤΑ 3: Κατάτμηση και Ανάλυση Εικόνας σε Περιοχές\r\n• ΕΝΟΤΗΤΑ 4: Μετρήσεις Αντικειμένου Εικόνας\r\n• ΕΝΟΤΗΤΑ 5: Ανάλυση Έγχρωμης και Πολυφασματικής Εικόνας\r\n• ΕΝΟΤΗΤΑ 6: Μοντέλο Γεωμετρικών Προβολών\r\n• ΕΝΟΤΗΤΑ 7: Εισαγωγή στην Τριδιάστατη Όραση\r\n• ΕΝΟΤΗΤΑ 8: Στατική Στερεοσκοπική Ανάλυση\r\n• ΕΝΟΤΗΤΑ 9: Δυναμική Στερεοσκοπική Ανάλυση\r\n• ΕΝΟΤΗΤΑ 10: Ειδικά Θέματα Ανάλυσης Εικόνας (Σύντηξη Αισθητηρίων – Βάσεις Δεδομένων Εικόνων)\r\nΜαθησιακά αποτελέσματα:\r\nΜε την επιτυχή ολοκλήρωση του μαθήματος ο/η φοιτητής/φοιτήτρια θα είναι σε θέση:\r\n• να κατηγοριοποιεί τα είδη των Τελεστών\r\n• να αναπτύσσει αλγόριθμους επεξεργασίας διδιάστατης εικόνας\r\n• να κατατέμνει εικόνες και να τις αναλύει σε περιοχές\r\n• να ανιχνεύει και να συνδέει ακμές\r\n• να εκτελεί μετρήσεις αντικειμένων σε εικόνες, όπως εμβαδού, περιμέτρου, μήκους, πλάτους κ.λπ., και να υπολογίζει περιγραφείς σχήματος αντικειμένων\r\n• να αναλύει έγχρωμες και πολυφασματικές εικόνες\r\n• να κατανοεί το μοντέλο των κεντρικών και παράλληλων προβολών\r\n• να αναπτύσσει και να εφαρμόζει αλγόριθμους στατικής και δυναμικής στερεοσκοπικής ανάλυσης\r\n• να αναπτύσσει και να χρησιμοποιεί αλγόριθμους σύντηξης αισθητηρίων\r\n• να αξιοποιεί τους κατάλληλους με βάση το περιεχόμενο αλγόριθμους ανάκτησης από βάσεις δεδομένων εικόνων\r\n", "", "Ανάλυση Εικόνας", 7, "ΠΛΕΙΚ01" },
                    { 21, "correct.mp3", "Αντικείμενο μαθήματος\r\nΣυμβολή του μαθήματος στην κάλυψη των τεχνολογικών απαιτήσεων:\r\nΟι φοιτητές εκτίθενται σε σύγχρονες τεχνικές μοντελοποίησης λογισμικού, στον αρχιτεκτονικό σχεδιασμό και στη σύγχρονη γλώσσα μοντελοποίησης UML.\r\n\r\n1. Μοντέλα κύκλου ζωής λογισμικού με έμφαση στη Rational Unified Process.\r\n2. Γλώσσες μοντελοποίησης με έμφαση στη UML.\r\n3. Προϋπολογισμός κόστους λογισμικού.\r\n4. Ανάλυση απαιτήσεων, σχεδιασμός, υλοποίηση και γλώσσες προγραμματισμού.\r\n5. Έλεγχος, συντήρηση και εργαλεία CASE.\r\n\r\nΜαθησιακά αποτελέσματα:\r\nΜε την επιτυχή ολοκλήρωση αυτού του μαθήματος ο φοιτητής θα είναι σε θέση να:\r\n• Συντάσσει δομημένα έγγραφα ανάλυσης απαιτήσεων λογισμικού\r\n• Σχεδιάζει αρχιτεκτονικά σχέδια λογισμικού βασισμένα σε γλώσσες μοντελοποίησης και διαγράμματα\r\n• Παράγει κώδικα βασισμένο στο στάδιο του σχεδιασμού, ο οποίος θα ανταποκρίνεται στα αντίστοιχα διαγράμματα\r\n• Χρησιμοποιεί το μοντέλο κύκλου ζωής λογισμικού Rational Unified Process\r\n", "", "Τεχνολογία Λογισμικού", 6, "ΠΛΠΛΗ46" },
                    { 22, "correct.mp3", "Αντικείμενο μαθήματος\r\nTo μάθημα ασχολείται με τη θεωρητική μελέτη και την πρακτική εργαστηριακή εξάσκηση σε θέματα σχεδίασης αποδοτικού λογισμικού, διαχειρίσιμου πηγαίου κώδικα και χρήση προτύπων σχεδίασης λογισμικού που διευκολύνουν την επέκταση, επαναχρησιμοποίηση και αποτελεσματικότητα των εφαρμογών λογισμικού.\r\nΒασίζεται στην έννοια των προτύπων ανάπτυξης λογισμικού (software design patterns) που αποτελούν το «παράδειγμα» καλής πρακτικής στην προσέγγιση υλοποίησης σε ένα επαναλαμβανόμενο πρόβλημα προγραμματισμού συστήματος και λογικής.\r\nΠεριλαμβάνει την παρουσίαση προτύπων ανάπτυξης λογισμικού επιχειρώντας να θέσει τις βάσεις για υψηλότερου επιπέδου προγραμματιστικές επιδόσεις και δεξιότητες.\r\nΠαρουσιάζονται και γίνεται εξάσκηση στα δημοφιλή μεταξύ άλλων software designs των Singleton, Builder, Prototype, Factory, και AbstractFactory που είναι και γνωστά ως η ομάδα των τεσσάρων «Gang of Four». Ο υψηλότερου επιπέδου, αποδοτικός και αποτελεσματικός προγραμματισμός τόσο σε αντικειμενοστρεφείς όσο και άλλες γλώσσες προγραμματισμού απαιτεί τη γνώση και εφαρμογή προτύπων στην ανάπτυξη λογισμικού. Επιπλέον γίνεται εξάσκηση και εμβάθυνση στην πρακτική βελτίωση υπάρχοντος κώδικα με εφαρμογή επτά βασικών αρχών σχεδίασης λογισμικού.\r\n\r\nΕνότητες\r\n1. Αναγκαιότητα των Κλάσεων\r\n2. Συσχετίσεις μεταξύ κλάσεων και UML\r\n3. Πολυμορφισμός & Αρχή της Ενσωμάτωσης\r\n4. Αρχή της Χαμηλής Σύζευξης & Προηγμένες Αρχές Σχεδίασης Λογισμικού\r\n5. Αρχή της Μοναδικής Αρμοδιότητας & Αρχή Ανοικτής-Κλειστής Σχεδίασης\r\n6. Αρχή Υποκατάστασης της Liskov & Αρχή της Αντιστροφής των Εξαρτήσεων\r\n7. Αρχή του Διαχωρισμού των Διασυνδέσεων\r\n8. Εφαρμογή αρχών στα Πρότυπα Σχεδίασης Λογισμικού\r\n9. Προσαρμογέας & Σύνθετο & Γέφυρα\r\n10. Μοναδιαίο & Επισκέπτης & Παρατηρητής\r\n11. Εργοστάσιο\r\n12. Επανασχεδίαση, Αναδόμηση, Επαναπαραγοντοποίηση\r\n13. Εφαρμογές για συστήματα ελέγχου εκδόσεων λογισμικού\r\n14. Μεθοδολογική ανάλυση μελέτης περίπτωσης λογισμικού\r\n15. Εισαγωγή στις ευέλικτες μεθοδολογίες ανάπτυξης λογισμικού και πρότυπα\r\n\r\nΜαθησιακά αποτελέσματα:\r\nΜε την επιτυχή ολοκλήρωση αυτού του μαθήματος οι φοιτητές θα είναι σε θέση:\r\n• Να εξηγούν και να εφαρμόζουν προηγμένες αρχές σχεδίασης λογισμικού (π.χ. single responsibility, open-closed κλπ).\r\n• Να δημιουργούν πηγαίο κώδικα ακολουθώντας πρότυπο ανάπτυξης λογισμικού.\r\n• Να αναλύουν κριτικά πηγαίο κώδικα και να τον αναδιαμορφώνουν με βάση πρότυπα ανάπτυξης λογισμικού.\r\n• Να διακρίνουν και να αναπτύσσουν λύσεις σε επαναλαμβανόμενα προβλήματα ανάπτυξης λογισμικού με χρήση πρότυπα και αρχές ανάπτυξης λογισμικού.\r\n• Να εξασκούνται σε σύγχρονες τεχνικές σχεδίασης αποδοτικού πηγαίου κώδικα για αποτελεσματικό λογισμικό, καθώς και σε σύγχρονες τεχνικές σχεδίασης αποδοτικού πηγαίου κώδικα για αποτελεσματικό λογισμικό.\r\n• Να μαθαίνουν αποτελεσματικές τεχνικές ανάπτυξης και αναδιοργάνωσης πηγαίου κώδικα για αυξημένη αποδοτικότητα.\r\n• Να αξιολογούν και να εντοπίζουν περιπτώσεις λογισμικού.\r\n", "", "Πρότυπα Ανάπυτξης Λογισμικού", 6, "ΠΛΠΡΑΝΑΛ01" },
                    { 23, "correct.mp3", "Αντιεκίμενο μαθήματος:\r\nΤο μάθημα Συστήματα Πολυμέσων ασχολείται με την επιστημονική περιοχή στην οποία συναντώνται και γονιμοποιούνται πληθώρα επιστημονικών πεδίων, όπως η επεξεργασία σήματος, η θεωρία πληροφορίας και οι επικοινωνίες, με στόχο τη Δημιουργία, την Αποθήκευση/Συμπίεση και τη Διανομή του Πολυμεσικού Περιεχομένου. Σκοπός, επομένως, του παρόντος μαθήματος είναι να παρουσιάσει με ενιαίο τρόπο τις θεμελιώδεις έννοιες της πολυμεσικής επεξεργασίας, τα προβλήματα που καλείται να επιλύσει η σχεδίαση πολυμεσικών συστημάτων και τις σημαντικότερες τεχνικές ψηφιοποίησης, συμπίεσης και διανομής πολυμεσικού περιεχομένου.\r\n\r\nΤο περιεχόμενο του μαθήματος χωρίζεται σε τέσσερα μέρη: Δημιουργίας Πολυμεσικού Περιεχομένου, Συμπίεσης Πολυμέσων, Διανομής Πολυμέσων και Σύγχρονων Τάσεων. Κάθε μέρος αποτελείται από μία ή περισσότερες ενότητες και κάθε ενότητα δύναται να διδαχθεί σε περισσότερες από μία διαλέξεις.\r\n\r\nΜέρος Ι: Δημιουργία Πολυμεσικού Περιεχομένου\r\nΕνότητα 1: Εισαγωγή στα Πολυμέσα – Παρελθόν, Παρόν και Μέλλον\r\nΕνότητα 2: Λήψη Ψηφιακών Δεδομένων\r\nΕνότητα 3: Αναπαράσταση και Πρότυπα Διαμόρφωσης Μέσων\r\nΕνότητα 4: Θεωρία Χρώματος\r\n\r\nΜέρος ΙΙ: Συμπίεση Πολυμέσων\r\nΕνότητα 5: Επισκόπηση Συμπίεσης\r\nΕνότητα 6: Συμπίεση Εικόνας\r\nΕνότητα 7: Συμπίεση Video\r\nΕνότητα 8: Συμπίεση Ήχου\r\nΕνότητα 9: Συμπίεση Γραφικών\r\n\r\nΜέρος ΙΙΙ: Διανομή Πολυμέσων\r\nΕνότητα 10: Ενσύρματη και Ασύρματη Δικτύωση Πολυμέσων\r\nΕνότητα 11: Ψηφιακή Διαχείριση Δικαιωμάτων\r\n\r\nΜέρος ΙV: Σύγχρονες Τάσεις\r\nΕνότητα 12: MPEG-4, Πολυμεσικές Βάσεις Δεδομένων και Αναζήτηση Πληροφορίας, Πολυμεσικά Πλαίσια\r\n\r\nΜαθησιακά αποτελέσματα:\r\nΜε την επιτυχή́ ολοκλήρωση του μαθήματος ο φοιτητής/τρια θα είναι σε θέση:\r\n• Να διαθέτει προχωρημένες γνώσεις σε αλγορίθμους, τεχνικές και μεθοδολογίες δημιουργίας, συμπίεσης και δικτύωσης ψηφιακού περιεχομένου, όπως συμπίεσης χωρίς/με απώλειες εικόνας/ήχου/βίντεο/γραφικών (JPEG, JPEG-2000, MPEG-4), ασύρματης δικτύωσης (π.χ., Bluetooth) και ψηφιακής διαχείρισης δικαιωμάτων (π.χ., λύσεις DRM στη μουσική βιομηχανία).\r\n• Να αντιλαμβάνεται πώς συνδυάζονται γνώσεις επεξεργασίας σήματος, θεωρίας χρώματος, ψυχοακουστικής, θεωρίας της πληροφορίας, συμπίεσης και δικτύωσης για τη δημιουργία και λειτουργία συστημάτων πολυμέσων.\r\n• Να κατέχει τη δεξιότητα να αναλύει προβλήματα πραγματικών δεδομένων (ανοικτής πρόσβασης), στα οποία απαιτείται η σχεδίαση/ανάπτυξη/υλοποίηση συστημάτων επεξεργασίας/ανάλυσης πολυμεσικού περιεχομένου, να εκτιμά το εφικτό των προβλημάτων αυτών, να επιλέγει τους κατάλληλους αλγορίθμους/τεχνικές και να προβαίνει στην αποτίμηση και συγκριτική μελέτη των επιδόσεων εναλλακτικών λύσεων.\r\n• Να διαχειρίζεται τον φόρτο και την πολυπλοκότητα τέτοιων προβλημάτων πραγματικών δεδομένων σε περιβάλλον ομαδικής εργασίας.\r\n• Να κατέχει προχωρημένες προγραμματιστικές δεξιότητες σε περιβάλλον ανάπτυξης λογισμικού Python/MATLAB/GNU Octave για την υλοποίηση αλγορίθμων, τεχνικών και μεθόδων επεξεργασίας πολυμεσικού περιεχομένου.\r\n• Να αναγνωρίζει και να επαναχρησιμοποιεί υφιστάμενες υλοποιήσεις συναρτήσεων ανοιχτού κώδικα, σχετικών με το πεδίο των Συστημάτων Πολυμέσων, όπως των συναρτήσεων της βιβλιοθήκης ffmpeg.\r\n• Να διακρίνει συναφείς της πολυμεσικής επεξεργασίας έννοιες, στα συγγενή επιστημονικά πεδία της Επεξεργασίας Σήματος, της Θεωρίας της Πληροφορίας , της Συμπίεσης Δεδομένων και της Δικτύωσης Δεδομένων.\r\n", "", "Συστήματα Πολυμέσων", 6, "ΠΛΠΛΗ48" }
                });

            migrationBuilder.InsertData(
                table: "PostGraduateInstitutionHasCoefficients",
                columns: new[] { "CoefficientName", "PostGraduateInstitutionId", "HasCoefficient" },
                values: new object[,]
                {
                    { "AI_ML", 1, true },
                    { "DatabaseEngineering", 1, true },
                    { "AI_ML", 2, true },
                    { "DatabaseEngineering", 2, true },
                    { "Security", 2, true },
                    { "AI_ML", 3, true },
                    { "SoftwareEngineering", 3, true },
                    { "Networks", 4, true },
                    { "Security", 4, true },
                    { "WebDev", 4, true },
                    { "Networks", 5, true },
                    { "Security", 5, true },
                    { "Security", 6, true },
                    { "WebDev", 6, true },
                    { "AI_ML", 7, true },
                    { "DatabaseEngineering", 7, true },
                    { "Networks", 8, true },
                    { "AI_ML", 9, true },
                    { "Networks", 9, true },
                    { "WebDev", 9, true },
                    { "AI_ML", 10, true },
                    { "DatabaseEngineering", 10, true },
                    { "SoftwareEngineering", 11, true },
                    { "ComputerVisionAndGraphics", 12, true },
                    { "GameDev", 12, true },
                    { "MobileAppDev", 13, true },
                    { "UI_UX", 13, true },
                    { "WebDev", 13, true },
                    { "UI_UX", 14, true }
                });

            migrationBuilder.InsertData(
                table: "PostGraduateInstitutions",
                columns: new[] { "Id", "Department", "Description", "Hyperlink", "Name", "Town" },
                values: new object[,]
                {
                    { 1, "Επιστήμη Δεδομένων και Μηχανική Μάθηση", "", "https://dsml.ece.ntua.gr/", "Εθνικό Μετσόβειο Πολυτεχνείο", "Αθήνα" },
                    { 2, "Κυβερνοασφάλεια και Επιστήμη Δεδομένων", "", "https://www.cs.unipi.gr/index.php?option=com_k2&view=item&layout=item&id=609&Itemid=813&lang=el", "Πανεπιστήμιο Πειραιώς", "Πειραιάς" },
                    { 3, "Προηγμένα Συστήματα Πληροφορικής - Ανάπτυξη Λογισμικού και Τεχνητής Νοημοσύνης", "", "https://www.cs.unipi.gr/index.php?option=com_k2&view=item&layout=item&id=626&Itemid=815&lang=el", "Πανεπιστήμιο Πειραιώς", "Πειραιάς" },
                    { 4, "Ψηφιακός Πολιτισμός, Έξυπνες Πόλεις, IoT και Προηγμένες Ψηφιακές Τεχνολογίες", "", "https://www.cs.unipi.gr/index.php?option=com_k2&view=item&layout=item&id=576&Itemid=814&lang=el", "Πανεπιστήμιο Πειραιώς", "Πειραιάς" },
                    { 5, "Προηγμένες Τεχνολογίες Πληροφορικής και Υπηρεσίες", "", "https://www.cs.unipi.gr/index.php?option=com_k2&view=item&layout=item&id=653&Itemid=812&lang=el", "Πανεπιστήμιο Πειραιώς", "Πειραιάς" },
                    { 6, "Ανάπτυξη και Ασφάλεια Πληροφοριακών Συστημάτων", "", "https://mscis.cs.aueb.gr/el/normal/home", "Οικονομικό Πανεπιστήμιο Αθηνών", "Αθήνα" },
                    { 7, "Επιστήμη Δεδομένων", "", "https://www.dept.aueb.gr/el/cs/content/%CF%80%CE%BC%CF%83-%CF%83%CF%84%CE%B7%CE%BD-%CE%B5%CF%80%CE%B9%CF%83%CF%84%CE%AE%CE%BC%CE%B7-%CE%B4%CE%B5%CE%B4%CE%BF%CE%BC%CE%AD%CE%BD%CF%89%CE%BD", "Οικονομικό Πανεπιστήμιο Αθηνών", "Αθήνα" },
                    { 8, "Μηχανική Υπολογιστών, Τηλεποικοινωνιών και Δικτύων", "", "https://www.di.uoa.gr/eng", "Εθνικό Καποδιστριακό Πανεπιστήμιο Αθηνών", "Αθήνα" },
                    { 9, "Τεχνολογίες Πληροφορικής και Τηλεποικοινωνιών", "", "https://www.di.uoa.gr/ict", "Εθνικό Καποδιστριακό Πανεπιστήμιο Αθηνών", "Αθήνα" },
                    { 10, "Data Science and Information Technologies", "", "https://dsit.di.uoa.gr/", "Εθνικό Καποδιστριακό Πανεπιστήμιο Αθηνών", "Αθήνα" },
                    { 11, "Προηγμένη Τεχνολογία Λογισμικού", "", "https://mai.uom.gr/frontend/articles.php?cid=41&t=Proigmeni-Texnologia-Logismikou", "Πανεπιστήμιο Μακεδονίας", "Θεσσαλονίκη" },
                    { 12, "Ανάπτυξη Ψηφιακών Παιχνιδιών και Πολυμεσικών Εφαρμογών", "", "https://gamedev.uowm.gr/", "Πανεπιστήμιο Μακεδονίας", "Θεσσαλονίκη" },
                    { 13, "Ανάπτυξη Εφαρμογών Ιστού και Κινητών Συσκευών", "", "https://mai.uom.gr/frontend/articles.php?cid=159&t=Anaptuksi-Efarmogwn-Istou-kai-Kinitwn-Suskeuwn", "Πανεπιστήμιο Μακεδονίας", "Θεσσαλονίκη" },
                    { 14, "Αλληλεπίδραση Ανθρώπου-Υπολογιστή", "", "https://hcimaster.upatras.gr/regulation/", "Πανεπιστήμιο Πατρών", "Πάτρα" }
                });

            migrationBuilder.InsertData(
                table: "PrerequisiteCourses",
                columns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                values: new object[,]
                {
                    { 1, 2 },
                    { 1, 22 },
                    { 2, 3 },
                    { 5, 6 },
                    { 5, 13 },
                    { 6, 4 },
                    { 8, 7 },
                    { 9, 8 },
                    { 9, 19 },
                    { 11, 10 },
                    { 13, 12 },
                    { 14, 13 },
                    { 14, 16 },
                    { 16, 15 },
                    { 17, 10 },
                    { 18, 17 },
                    { 19, 10 },
                    { 20, 23 },
                    { 22, 21 },
                    { 23, 12 }
                });

            migrationBuilder.InsertData(
                table: "Questions",
                columns: new[] { "Id", "Content", "CourseId" },
                values: new object[,]
                {
                    { 1, "Ένα από τα αντικέιμενα του μαθήματος Αντικειμενοστρεφής Προγραμματισμός η ομαδική εργασία.", 3 },
                    { 2, "Ποιο από τα παρακάτω αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Αντικειμενοστρεφής Προγραμματισμός;", 3 },
                    { 3, "Ποιο από τα παρακάτω αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Αντικειμενοστρεφής Προγραμματισμός;", 3 },
                    { 4, "Παρακολουθώντας το μάθημα Αντικειμενοστρεφής Προγραμματισμός, οι φοιτητές είναι ικανοί να θα παράγουν εφαρμογές πελάτη-εξυπηρετητή.", 3 },
                    { 5, "Το κύριο αντικείμενο του μαθήματος Αντικειμενοστρεφής Προγραμματισμός  είναι η εισαγωγή στον αντικειμενοστρεφή προγραμματισμό με πλήρη ανάλυση της γλώσσας προγραμματισμού ______.", 3 },
                    { 6, "Στα πλαίσια του μαθήματος Αντικειμενοστρεφής Προγραμματισμός οι φοιτητές μαθαίνουν να χειρίζονται αρχεία προορισμένα για _________ και αποθήκευση δεδομένων.", 3 },
                    { 7, "Στα πλαίσια του μαθήματος Αντικειμενοστρεφής Προγραμματισμός οι φοιτητές μαθαίνουν την έννοια της κληρονομικότητας.", 3 },
                    { 8, "Παρακολουθώντας το μάθημα Αντικειμενοστρεφής Προγραμματισμός, οι φοιτητές είναι ικανοί  να παράγουν εφαρμογές με αποδοτικό και ταχύ ρυθμό.", 3 },
                    { 9, "Στα πλαίσια του μαθήματος Αντικειμενοστρεφής Προγραμματισμός οι φοιτητές μαθαίνουν να διαχειρίζονται αποτελεσματικά και με χρήση των κατάλληλων εργαλείων τις ________ που ανακύπτουν.", 3 },
                    { 10, "Ποιο από τα παρακάτω ΔΕΝ ανήκει στο αντικείμενο του μαθήματος Αντικειμενοστρεφής Προγραμματισμός;", 3 },
                    { 11, "Η Εικονική Πραγματικότητα είναι το επιστημονικό πεδίο με αντικείμενο την αναπαράσταση κόσμων με τη βοήθεια ηλεκτρονικών υπολογιστών.", 4 },
                    { 12, "Τα ______ με υπολογιστές διαδραματίζουν βασικό ρόλο στην Εικονική Πραγματικότητα.", 4 },
                    { 13, "Η Εικονική Πραγματικότητα, κυρίως μέσω των _______ Εικονικών Συστημάτων, έχει πλήθος εφαρμογών στην εκπαίδευση, την ψυχαγωγία, την προσομοίωση, την αλληλεπίδραση ανθρώπου – υπολογιστή και την επιστημονική έρευνα", 4 },
                    { 14, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί αντικείμενο του μαθήματος Εικονική Πραγματικότητα;", 4 },
                    { 15, "Στόχος του μαθήματος Εικονική Πραγματικότητα είναι να αποκτήσουν οι φοιτητές γνώσεις και ικανότητες χρήσης/δημιουργίας μετρικών αξιολόγησης παιχνιδιών βάσει των στόχων που τέθηκαν κατά τη σχεδίασή τους.", 4 },
                    { 16, "Πως ονομάζεται το περιβάλλον με το οποίο θα εξοικιωθούν οι φοιτητές για την ανάπτηξη συστημάτων Εικονικής Πραγματικότητας;", 4 },
                    { 17, "Στόχος του μαθήματος Εικονική Πραγματικότητα είναι η εξοικείωση των φοιτητών με σύγχρονες τεχνολογίες, μεθόδους και εργαλεία για τη δημιουργία ολοκληρωμένων εφαρμογών Εικονικής Πραγματικότητας.", 4 },
                    { 18, "Μέσω της παρακολούθησης του μαθήματος Εικονική Πραγματικότητα ο φοιτητής γνωρίζει τις ________ ενός συστήματος Εικονικής Πραγματικότητας.", 4 },
                    { 19, "Ποιο από τα παρακάτω αποτελεί διδακτική ενότητα του μαθήματος Εικονική Πραγματικότητα;", 4 },
                    { 20, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί διδακτική ενότητα του μαθήματος Εικονική Πραγματικότητα;", 4 },
                    { 21, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού;", 1 },
                    { 22, "Η ανάπτυξη των mobile apps στο μάθημα Σύγχρονα Θέματα Τεχνολογίας Λογισμικού  υλοποιείται με τη χρήση του περιβάλλοντος ανάπτυξης λογισμικού ___________.", 1 },
                    { 23, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού;", 1 },
                    { 24, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού;", 1 },
                    { 25, "Tο μάθημα Σύγχρονα Θέματα Τεχνολογίας Λογισμικού καλύπτει και την ύλη που αφορά στους αισθητήρες των κινητών συσκευών, στις υπηρεσίες γεοεντοπισμού και σε πλήθος άλλων προχωρημένων τεχνικών προγραμματισμού.", 1 },
                    { 26, "Η ύλη του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού περιλαμβάνει κυρίως τη χρήση της αντικειμενοστρεφούς γλώσσας προγραμματισμού C#.", 1 },
                    { 27, "Ένα από τα αντκείμενα του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού είναι η “Ανάλυση απαιτήσεων: __________ Ανάλυση και Αντικειμενοστρεφής Ανάλυση”.", 1 },
                    { 28, "Ποιο από τα παρακάτω αποτελεί μοντέλο ανάπτυξης λογισμικού που αναλύεται στα πλαίσια του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού;", 1 },
                    { 29, "Ένα από τα αντικέιμενα του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού είναι προϋπολογισμός κόστους λογισμικού.", 1 },
                    { 30, "Παρακολουθώντας το μάθημα Σύγχρονα Θέματα Τεχνολογίας Λογισμικού, μπορεί κανείς να χρησιμοποιεί πρακτικά τις πλέον σύγχρονες υπηρεσίες ______ και Mobile backend as a service που παρέχει η Firebase.", 1 },
                    { 31, "Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες ο φοιτητής μπορεί να εφαρμόζει τα μοντέλα “αντιλαμβάνομαι-αποφασίζω-ενεργώ” (Sense-Decide-Act), BDI (Belief-Desire-Intention), σε διάφορες περιπτώσεις πρακτόρων.", 5 },
                    { 32, "Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες ο φοιτητής διακρίνει και εκτιμά πότε είναι απαραίτητος ένας _________ πράκτορας και πότε βουλητικός πράκτορας.", 5 },
                    { 33, "Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες ο φοιτητής κατανοεί την ____ ενός ευφυούς πράκτορα", 5 },
                    { 34, "Ποίο από τα παρακάτω αποτελεί είδος ευφυούς πράκτορα που μελετάται στο μάθυμα Ευφυείς Πράκτορες;", 5 },
                    { 35, "Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες  ο φοιτητής  αναπτύσσει αλγορίθμους για εύρεση μονοπατιού (path finding), και σχεδιασμό ενεργειών (plan generation)", 5 },
                    { 36, "Πως ονομάζεται το περιβάλλον με το οποίο θα εξοικιωθούν οι φοιτητές για την ανάπτηξη εφαρμογών ευφυή πρακτόρων;", 5 },
                    { 37, "Η συναισθηματική διαλεκτική σε ευφυείς πράκτορες αποτελεί αντικείμενο του μαθήματος Ευφυείς Πράκτορες.", 5 },
                    { 38, "Μέσω της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες ο φοιτητής μαθαίνει να εφαρμόζει το μοντέλο “αντιλαμβάνομαι-αποφασίζω-________”", 5 },
                    { 39, "Αντικείμενο του μαθήματος Ευφυείς Πράκτορες είναι  ο σχεδιασμός ενεργειών, βασισμένος σε κίνητρα και η πυραμίδα του ________.", 5 },
                    { 40, "Mε ποιο είδος πρακτόρων θα ασχοληθούν οι φοιτητές στα πλαίσια του μαθληματος Ευφυείς Πράκτορες;", 5 },
                    { 41, "Παρακολουθώντας το μάθημα Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών, οι φοιτητές θα μπορούν να αναπτύσουν εφαρμογές ηλεκτρονικών παιχνιδιών στο περιβάλλον της Python.", 6 },
                    { 42, "Στόχος του μαθήματος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών είναι να αποκτήσουν οι φοιτητές βασικές γνώσεις για τον ρόλο, τους τύπους και τα ________ των παιχνιδιών, καθώς και για τη συνολική διαδικασία δημιουργίας ενός παιχνιδιού.", 6 },
                    { 43, "Στόχος του μαθήματος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών είναι να αποκτήσουν οι φοιτητές ικανότητες σχεδίασης και _________ παιχνιδιών αξιοποιώντας σύγχρονα εργαλεία, διασυνδέσεις και γλώσσες προγραμματισμού,", 6 },
                    { 44, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί κατηγορία ηλεκτρονικών παιχνιδιών;", 6 },
                    { 45, "Στόχος του μαθήματος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών είναι να αποκτήσουν οι φοιτητές γνώσεις και ικανότητες χρήσης/δημιουργίας μετρικών αξιολόγησης παιχνιδιών βάσει των στόχων που τέθηκαν κατά τη σχεδίασή τους.", 6 },
                    { 46, "Στα πλάισια του μαθήαμτος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών ο φοιτητής μαθαίνει να συνοψίζει τις απαιτούμενες γνώσεις σχετικά με την ανάπτυξη ηλεκτρονικών παιχνιδιών στο περιβάλλον της ________", 6 },
                    { 47, "Στόχος του μαθήματος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών είναι η εξοικείωση των φοιτητών με σύγχρονες τεχνολογίες, μεθόδους και εργαλεία για τη δημιουργία ολοκληρωμένων διαδικτυακών εφαρμογών.", 6 },
                    { 48, "Το αντικείενο του μαθήματος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών περιλαμβάνει τη σχεδίαση ενός παιχνιδιού σε ________.", 6 },
                    { 49, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί συστατικά ηλεκτρονικών παιχνιδιών στο Διαδίκτυο;", 6 },
                    { 50, "Ο κόσμος ενός ηλεκτρονικού αποτελείται από χαρακτήρες που μπορεί να είναι...;", 6 },
                    { 51, "Η ύλη του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών περιλαμβάνει κυρίως τη χρήση της αντικειμενοστρεφούς γλώσσας προγραμματισμού C#.", 2 },
                    { 52, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθαίνουν να αναπτύσσουν _______, web, ή/και mobile εφαρμογές.", 2 },
                    { 53, "Ποιο εργαλείο ανάπτυξης εφαρμογών χρησιμοποιείται στα πλαίσια του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών;", 2 },
                    { 54, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθαίνουν να αναπτύσσουν λογισμικό για ένα μεγάλο πλήθος από πεδία, συμπεριλαμβανομένων των παραθυρικών εφαρμογών, των εφαρμογών κονσόλας, των εφαρμογών web και των mobile εφαρμογών.", 2 },
                    { 55, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές εκτίθονται σε σύγχρονες τεχνικές προγραμματισμού με στόχο την ποιότητα του παραγόμενου _________, καθώς και την ταχύτητα ανάπτυξης σύνθετων και πολύπλοκων προγραμμάτων/έργων.", 2 },
                    { 56, "Στο πλαίσιο του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών δίνεται ιδιαίτερη έμφαση στα ολοκληρωμένα περιβάλλοντα ανάπτυξης τα οποία ονομάζονται και:", 2 },
                    { 57, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθαίνουν να αναγνωρίζουν και να εξηγούν τι είναι γλώσσα και γραμματική και πώς συμβολίζονται.", 2 },
                    { 58, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθάινουν να κάνουν ________ λογισμικού με τα πλέον σύγχρονα εργαλεία.", 2 },
                    { 59, "Ποιο από τα παρακάτω αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών;", 2 },
                    { 60, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών , οι φοιτητές μαθάινουν να παράγουν εφαρμογές με _______ και ταχύ ρυθμό.", 2 },
                    { 61, "Η ύλη του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών περιλαμβάνει κυρίως τη χρήση της αντικειμενοστρεφούς γλώσσας προγραμματισμού C#.", 7 },
                    { 62, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθαίνουν να αναπτύσσουν _______, web, ή/και mobile εφαρμογές.", 7 },
                    { 63, "Ποιο εργαλείο ανάπτυξης εφαρμογών χρησιμοποιείται στα πλαίσια του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών;", 7 },
                    { 64, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθαίνουν να αναπτύσσουν λογισμικό για ένα μεγάλο πλήθος από πεδία, συμπεριλαμβανομένων των παραθυρικών εφαρμογών, των εφαρμογών κονσόλας, των εφαρμογών web και των mobile εφαρμογών.", 7 },
                    { 65, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές εκτίθονται σε σύγχρονες τεχνικές προγραμματισμού με στόχο την ποιότητα του παραγόμενου _________, καθώς και την ταχύτητα ανάπτυξης σύνθετων και πολύπλοκων προγραμμάτων/έργων.", 7 },
                    { 66, "Στο πλαίσιο του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών δίνεται ιδιαίτερη έμφαση στα ολοκληρωμένα περιβάλλοντα ανάπτυξης τα οποία ονομάζονται και:", 7 },
                    { 67, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθαίνουν να αναγνωρίζουν και να εξηγούν τι είναι γλώσσα και γραμματική και πώς συμβολίζονται.", 7 },
                    { 68, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθάινουν να κάνουν ________ λογισμικού με τα πλέον σύγχρονα εργαλεία.", 7 },
                    { 69, "Ποιο από τα παρακάτω αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών;", 7 },
                    { 70, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών , οι φοιτητές μαθάινουν να παράγουν εφαρμογές με _______ και ταχύ ρυθμό.", 7 },
                    { 71, "Παρακολουθώντας το μάθημα Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών, οι φοιτητές θα μπορούν να αναπτύσουν εφαρμογές ηλεκτρονικών παιχνιδιών στο περιβάλλον της Python.", 8 },
                    { 72, "Στόχος του μαθήματος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών είναι να αποκτήσουν οι φοιτητές βασικές γνώσεις για τον ρόλο, τους τύπους και τα ________ των παιχνιδιών, καθώς και για τη συνολική διαδικασία δημιουργίας ενός παιχνιδιού.", 8 },
                    { 73, "Στόχος του μαθήματος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών είναι να αποκτήσουν οι φοιτητές ικανότητες σχεδίασης και _________ παιχνιδιών αξιοποιώντας σύγχρονα εργαλεία, διασυνδέσεις και γλώσσες προγραμματισμού,", 8 },
                    { 74, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί κατηγορία ηλεκτρονικών παιχνιδιών;", 8 },
                    { 75, "Στόχος του μαθήματος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών είναι να αποκτήσουν οι φοιτητές γνώσεις και ικανότητες χρήσης/δημιουργίας μετρικών αξιολόγησης παιχνιδιών βάσει των στόχων που τέθηκαν κατά τη σχεδίασή τους.", 8 },
                    { 76, "Στα πλάισια του μαθήαμτος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών ο φοιτητής μαθαίνει να συνοψίζει τις απαιτούμενες γνώσεις σχετικά με την ανάπτυξη ηλεκτρονικών παιχνιδιών στο περιβάλλον της ________", 8 },
                    { 77, "Στόχος του μαθήματος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών είναι η εξοικείωση των φοιτητών με σύγχρονες τεχνολογίες, μεθόδους και εργαλεία για τη δημιουργία ολοκληρωμένων διαδικτυακών εφαρμογών.", 8 },
                    { 78, "Το αντικείενο του μαθήματος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών περιλαμβάνει τη σχεδίαση ενός παιχνιδιού σε ________.", 8 },
                    { 79, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί συστατικά ηλεκτρονικών παιχνιδιών στο Διαδίκτυο;", 8 },
                    { 80, "Ο κόσμος ενός ηλεκτρονικού αποτελείται από χαρακτήρες που μπορεί να είναι...;", 8 },
                    { 81, "Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες ο φοιτητής μπορεί να εφαρμόζει τα μοντέλα “αντιλαμβάνομαι-αποφασίζω-ενεργώ” (Sense-Decide-Act), BDI (Belief-Desire-Intention), σε διάφορες περιπτώσεις πρακτόρων.", 9 },
                    { 82, "Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες ο φοιτητής διακρίνει και εκτιμά πότε είναι απαραίτητος ένας _________ πράκτορας και πότε βουλητικός πράκτορας.", 9 },
                    { 83, "Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες ο φοιτητής κατανοεί την ____ ενός ευφυούς πράκτορα", 9 },
                    { 84, "Ποίο από τα παρακάτω αποτελεί είδος ευφυούς πράκτορα που μελετάται στο μάθυμα Ευφυείς Πράκτορες;", 9 },
                    { 85, "Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες  ο φοιτητής  αναπτύσσει αλγορίθμους για εύρεση μονοπατιού (path finding), και σχεδιασμό ενεργειών (plan generation)", 9 },
                    { 86, "Πως ονομάζεται το περιβάλλον με το οποίο θα εξοικιωθούν οι φοιτητές για την ανάπτηξη εφαρμογών ευφυή πρακτόρων;", 9 },
                    { 87, "Η συναισθηματική διαλεκτική σε ευφυείς πράκτορες αποτελεί αντικείμενο του μαθήματος Ευφυείς Πράκτορες.", 9 },
                    { 88, "Μέσω της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες ο φοιτητής μαθαίνει να εφαρμόζει το μοντέλο “αντιλαμβάνομαι-αποφασίζω-________”", 9 },
                    { 89, "Αντικείμενο του μαθήματος Ευφυείς Πράκτορες είναι  ο σχεδιασμός ενεργειών, βασισμένος σε κίνητρα και η πυραμίδα του ________.", 9 },
                    { 90, "Mε ποιο είδος πρακτόρων θα ασχοληθούν οι φοιτητές στα πλαίσια του μαθληματος Ευφυείς Πράκτορες;", 9 },
                    { 91, "Ένα από τα αντικέιμενα του μαθήματος Αντικειμενοστρεφής Προγραμματισμός η ομαδική εργασία.", 10 },
                    { 92, "Ποιο από τα παρακάτω αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Αντικειμενοστρεφής Προγραμματισμός;", 10 },
                    { 93, "Ποιο από τα παρακάτω αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Αντικειμενοστρεφής Προγραμματισμός;", 10 },
                    { 94, "Παρακολουθώντας το μάθημα Αντικειμενοστρεφής Προγραμματισμός, οι φοιτητές είναι ικανοί να θα παράγουν εφαρμογές πελάτη-εξυπηρετητή.", 10 },
                    { 95, "Το κύριο αντικείμενο του μαθήματος Αντικειμενοστρεφής Προγραμματισμός  είναι η εισαγωγή στον αντικειμενοστρεφή προγραμματισμό με πλήρη ανάλυση της γλώσσας προγραμματισμού ______.", 10 },
                    { 96, "Στα πλαίσια του μαθήματος Αντικειμενοστρεφής Προγραμματισμός οι φοιτητές μαθαίνουν να χειρίζονται αρχεία προορισμένα για _________ και αποθήκευση δεδομένων.", 10 },
                    { 97, "Στα πλαίσια του μαθήματος Αντικειμενοστρεφής Προγραμματισμός οι φοιτητές μαθαίνουν την έννοια της κληρονομικότητας.", 10 },
                    { 98, "Παρακολουθώντας το μάθημα Αντικειμενοστρεφής Προγραμματισμός, οι φοιτητές είναι ικανοί  να παράγουν εφαρμογές με αποδοτικό και ταχύ ρυθμό.", 10 },
                    { 99, "Στα πλαίσια του μαθήματος Αντικειμενοστρεφής Προγραμματισμός οι φοιτητές μαθαίνουν να διαχειρίζονται αποτελεσματικά και με χρήση των κατάλληλων εργαλείων τις ________ που ανακύπτουν.", 10 },
                    { 100, "Ποιο από τα παρακάτω ΔΕΝ ανήκει στο αντικείμενο του μαθήματος Αντικειμενοστρεφής Προγραμματισμός;", 10 },
                    { 101, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού;", 19 },
                    { 102, "Η ανάπτυξη των mobile apps στο μάθημα Σύγχρονα Θέματα Τεχνολογίας Λογισμικού  υλοποιείται με τη χρήση του περιβάλλοντος ανάπτυξης λογισμικού ___________.", 19 },
                    { 103, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού;", 19 },
                    { 104, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού;", 19 },
                    { 105, "Tο μάθημα Σύγχρονα Θέματα Τεχνολογίας Λογισμικού καλύπτει και την ύλη που αφορά στους αισθητήρες των κινητών συσκευών, στις υπηρεσίες γεοεντοπισμού και σε πλήθος άλλων προχωρημένων τεχνικών προγραμματισμού.", 19 },
                    { 106, "Η ύλη του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού περιλαμβάνει κυρίως τη χρήση της αντικειμενοστρεφούς γλώσσας προγραμματισμού C#.", 19 },
                    { 107, "Ένα από τα αντκείμενα του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού είναι η “Ανάλυση απαιτήσεων: __________ Ανάλυση και Αντικειμενοστρεφής Ανάλυση”.", 19 },
                    { 108, "Ποιο από τα παρακάτω αποτελεί μοντέλο ανάπτυξης λογισμικού που αναλύεται στα πλαίσια του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού;", 19 },
                    { 109, "Ένα από τα αντικέιμενα του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού είναι προϋπολογισμός κόστους λογισμικού.", 19 },
                    { 110, "Παρακολουθώντας το μάθημα Σύγχρονα Θέματα Τεχνολογίας Λογισμικού, μπορεί κανείς να χρησιμοποιεί πρακτικά τις πλέον σύγχρονες υπηρεσίες ______ και Mobile backend as a service που παρέχει η Firebase.", 19 },
                    { 111, "Η ύλη του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών περιλαμβάνει κυρίως τη χρήση της αντικειμενοστρεφούς γλώσσας προγραμματισμού C#.", 11 },
                    { 112, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθαίνουν να αναπτύσσουν _______, web, ή/και mobile εφαρμογές.", 11 },
                    { 113, "Ποιο εργαλείο ανάπτυξης εφαρμογών χρησιμοποιείται στα πλαίσια του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών;", 11 },
                    { 114, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθαίνουν να αναπτύσσουν λογισμικό για ένα μεγάλο πλήθος από πεδία, συμπεριλαμβανομένων των παραθυρικών εφαρμογών, των εφαρμογών κονσόλας, των εφαρμογών web και των mobile εφαρμογών.", 11 },
                    { 115, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές εκτίθονται σε σύγχρονες τεχνικές προγραμματισμού με στόχο την ποιότητα του παραγόμενου _________, καθώς και την ταχύτητα ανάπτυξης σύνθετων και πολύπλοκων προγραμμάτων/έργων.", 11 },
                    { 116, "Στο πλαίσιο του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών δίνεται ιδιαίτερη έμφαση στα ολοκληρωμένα περιβάλλοντα ανάπτυξης τα οποία ονομάζονται και:", 11 },
                    { 117, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθαίνουν να αναγνωρίζουν και να εξηγούν τι είναι γλώσσα και γραμματική και πώς συμβολίζονται.", 11 },
                    { 118, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθάινουν να κάνουν ________ λογισμικού με τα πλέον σύγχρονα εργαλεία.", 11 },
                    { 119, "Ποιο από τα παρακάτω αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών;", 11 },
                    { 120, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών , οι φοιτητές μαθάινουν να παράγουν εφαρμογές με _______ και ταχύ ρυθμό.", 11 },
                    { 121, "Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες ο φοιτητής μπορεί να εφαρμόζει τα μοντέλα “αντιλαμβάνομαι-αποφασίζω-ενεργώ” (Sense-Decide-Act), BDI (Belief-Desire-Intention), σε διάφορες περιπτώσεις πρακτόρων.", 17 },
                    { 122, "Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες ο φοιτητής διακρίνει και εκτιμά πότε είναι απαραίτητος ένας _________ πράκτορας και πότε βουλητικός πράκτορας.", 17 },
                    { 123, "Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες ο φοιτητής κατανοεί την ____ ενός ευφυούς πράκτορα", 17 },
                    { 124, "Ποίο από τα παρακάτω αποτελεί είδος ευφυούς πράκτορα που μελετάται στο μάθυμα Ευφυείς Πράκτορες;", 17 },
                    { 125, "Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες  ο φοιτητής  αναπτύσσει αλγορίθμους για εύρεση μονοπατιού (path finding), και σχεδιασμό ενεργειών (plan generation)", 17 },
                    { 126, "Πως ονομάζεται το περιβάλλον με το οποίο θα εξοικιωθούν οι φοιτητές για την ανάπτηξη εφαρμογών ευφυή πρακτόρων;", 17 },
                    { 127, "Η συναισθηματική διαλεκτική σε ευφυείς πράκτορες αποτελεί αντικείμενο του μαθήματος Ευφυείς Πράκτορες.", 17 },
                    { 128, "Μέσω της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες ο φοιτητής μαθαίνει να εφαρμόζει το μοντέλο “αντιλαμβάνομαι-αποφασίζω-________”", 17 },
                    { 129, "Αντικείμενο του μαθήματος Ευφυείς Πράκτορες είναι  ο σχεδιασμός ενεργειών, βασισμένος σε κίνητρα και η πυραμίδα του ________.", 17 },
                    { 130, "Mε ποιο είδος πρακτόρων θα ασχοληθούν οι φοιτητές στα πλαίσια του μαθληματος Ευφυείς Πράκτορες;", 17 },
                    { 131, "Ένα από τα αντικέιμενα του μαθήματος Αντικειμενοστρεφής Προγραμματισμός η ομαδική εργασία.", 18 },
                    { 132, "Ποιο από τα παρακάτω αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Αντικειμενοστρεφής Προγραμματισμός;", 18 },
                    { 133, "Ποιο από τα παρακάτω αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Αντικειμενοστρεφής Προγραμματισμός;", 18 },
                    { 134, "Παρακολουθώντας το μάθημα Αντικειμενοστρεφής Προγραμματισμός, οι φοιτητές είναι ικανοί να θα παράγουν εφαρμογές πελάτη-εξυπηρετητή.", 18 },
                    { 135, "Το κύριο αντικείμενο του μαθήματος Αντικειμενοστρεφής Προγραμματισμός  είναι η εισαγωγή στον αντικειμενοστρεφή προγραμματισμό με πλήρη ανάλυση της γλώσσας προγραμματισμού ______.", 18 },
                    { 136, "Στα πλαίσια του μαθήματος Αντικειμενοστρεφής Προγραμματισμός οι φοιτητές μαθαίνουν να χειρίζονται αρχεία προορισμένα για _________ και αποθήκευση δεδομένων.", 18 },
                    { 137, "Στα πλαίσια του μαθήματος Αντικειμενοστρεφής Προγραμματισμός οι φοιτητές μαθαίνουν την έννοια της κληρονομικότητας.", 18 },
                    { 138, "Παρακολουθώντας το μάθημα Αντικειμενοστρεφής Προγραμματισμός, οι φοιτητές είναι ικανοί  να παράγουν εφαρμογές με αποδοτικό και ταχύ ρυθμό.", 18 },
                    { 139, "Στα πλαίσια του μαθήματος Αντικειμενοστρεφής Προγραμματισμός οι φοιτητές μαθαίνουν να διαχειρίζονται αποτελεσματικά και με χρήση των κατάλληλων εργαλείων τις ________ που ανακύπτουν.", 18 },
                    { 140, "Ποιο από τα παρακάτω ΔΕΝ ανήκει στο αντικείμενο του μαθήματος Αντικειμενοστρεφής Προγραμματισμός;", 18 },
                    { 141, "Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες ο φοιτητής μπορεί να εφαρμόζει τα μοντέλα “αντιλαμβάνομαι-αποφασίζω-ενεργώ” (Sense-Decide-Act), BDI (Belief-Desire-Intention), σε διάφορες περιπτώσεις πρακτόρων.", 21 },
                    { 142, "Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες ο φοιτητής διακρίνει και εκτιμά πότε είναι απαραίτητος ένας _________ πράκτορας και πότε βουλητικός πράκτορας.", 21 },
                    { 143, "Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες ο φοιτητής κατανοεί την ____ ενός ευφυούς πράκτορα", 21 },
                    { 144, "Ποίο από τα παρακάτω αποτελεί είδος ευφυούς πράκτορα που μελετάται στο μάθυμα Ευφυείς Πράκτορες;", 21 },
                    { 145, "Μετά την ολοκλήρωση της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες  ο φοιτητής  αναπτύσσει αλγορίθμους για εύρεση μονοπατιού (path finding), και σχεδιασμό ενεργειών (plan generation)", 21 },
                    { 146, "Πως ονομάζεται το περιβάλλον με το οποίο θα εξοικιωθούν οι φοιτητές για την ανάπτηξη εφαρμογών ευφυή πρακτόρων;", 21 },
                    { 147, "Η συναισθηματική διαλεκτική σε ευφυείς πράκτορες αποτελεί αντικείμενο του μαθήματος Ευφυείς Πράκτορες.", 21 },
                    { 148, "Μέσω της παρακολούθησης του μαθήματος Ευφυείς Πράκτορες ο φοιτητής μαθαίνει να εφαρμόζει το μοντέλο “αντιλαμβάνομαι-αποφασίζω-________”", 21 },
                    { 149, "Αντικείμενο του μαθήματος Ευφυείς Πράκτορες είναι  ο σχεδιασμός ενεργειών, βασισμένος σε κίνητρα και η πυραμίδα του ________.", 21 },
                    { 150, "Mε ποιο είδος πρακτόρων θα ασχοληθούν οι φοιτητές στα πλαίσια του μαθληματος Ευφυείς Πράκτορες;", 21 },
                    { 151, "Ένα από τα αντικέιμενα του μαθήματος Αντικειμενοστρεφής Προγραμματισμός η ομαδική εργασία.", 22 },
                    { 152, "Ποιο από τα παρακάτω αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Αντικειμενοστρεφής Προγραμματισμός;", 22 },
                    { 153, "Ποιο από τα παρακάτω αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Αντικειμενοστρεφής Προγραμματισμός;", 22 },
                    { 154, "Παρακολουθώντας το μάθημα Αντικειμενοστρεφής Προγραμματισμός, οι φοιτητές είναι ικανοί να θα παράγουν εφαρμογές πελάτη-εξυπηρετητή.", 22 },
                    { 155, "Το κύριο αντικείμενο του μαθήματος Αντικειμενοστρεφής Προγραμματισμός  είναι η εισαγωγή στον αντικειμενοστρεφή προγραμματισμό με πλήρη ανάλυση της γλώσσας προγραμματισμού ______.", 22 },
                    { 156, "Στα πλαίσια του μαθήματος Αντικειμενοστρεφής Προγραμματισμός οι φοιτητές μαθαίνουν να χειρίζονται αρχεία προορισμένα για _________ και αποθήκευση δεδομένων.", 22 },
                    { 157, "Στα πλαίσια του μαθήματος Αντικειμενοστρεφής Προγραμματισμός οι φοιτητές μαθαίνουν την έννοια της κληρονομικότητας.", 22 },
                    { 158, "Παρακολουθώντας το μάθημα Αντικειμενοστρεφής Προγραμματισμός, οι φοιτητές είναι ικανοί  να παράγουν εφαρμογές με αποδοτικό και ταχύ ρυθμό.", 22 },
                    { 159, "Στα πλαίσια του μαθήματος Αντικειμενοστρεφής Προγραμματισμός οι φοιτητές μαθαίνουν να διαχειρίζονται αποτελεσματικά και με χρήση των κατάλληλων εργαλείων τις ________ που ανακύπτουν.", 22 },
                    { 160, "Ποιο από τα παρακάτω ΔΕΝ ανήκει στο αντικείμενο του μαθήματος Αντικειμενοστρεφής Προγραμματισμός;", 22 },
                    { 161, "Ένα από τα αντικέιμενα του μαθήματος Αντικειμενοστρεφής Προγραμματισμός η ομαδική εργασία.", 12 },
                    { 162, "Ποιο από τα παρακάτω αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Αντικειμενοστρεφής Προγραμματισμός;", 12 },
                    { 163, "Ποιο από τα παρακάτω αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Αντικειμενοστρεφής Προγραμματισμός;", 12 },
                    { 164, "Παρακολουθώντας το μάθημα Αντικειμενοστρεφής Προγραμματισμός, οι φοιτητές είναι ικανοί να θα παράγουν εφαρμογές πελάτη-εξυπηρετητή.", 12 },
                    { 165, "Το κύριο αντικείμενο του μαθήματος Αντικειμενοστρεφής Προγραμματισμός  είναι η εισαγωγή στον αντικειμενοστρεφή προγραμματισμό με πλήρη ανάλυση της γλώσσας προγραμματισμού ______.", 12 },
                    { 166, "Στα πλαίσια του μαθήματος Αντικειμενοστρεφής Προγραμματισμός οι φοιτητές μαθαίνουν να χειρίζονται αρχεία προορισμένα για _________ και αποθήκευση δεδομένων.", 12 },
                    { 167, "Στα πλαίσια του μαθήματος Αντικειμενοστρεφής Προγραμματισμός οι φοιτητές μαθαίνουν την έννοια της κληρονομικότητας.", 12 },
                    { 168, "Παρακολουθώντας το μάθημα Αντικειμενοστρεφής Προγραμματισμός, οι φοιτητές είναι ικανοί  να παράγουν εφαρμογές με αποδοτικό και ταχύ ρυθμό.", 12 },
                    { 169, "Στα πλαίσια του μαθήματος Αντικειμενοστρεφής Προγραμματισμός οι φοιτητές μαθαίνουν να διαχειρίζονται αποτελεσματικά και με χρήση των κατάλληλων εργαλείων τις ________ που ανακύπτουν.", 12 },
                    { 170, "Ποιο από τα παρακάτω ΔΕΝ ανήκει στο αντικείμενο του μαθήματος Αντικειμενοστρεφής Προγραμματισμός;", 12 },
                    { 171, "Η ύλη του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών περιλαμβάνει κυρίως τη χρήση της αντικειμενοστρεφούς γλώσσας προγραμματισμού C#.", 23 },
                    { 172, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθαίνουν να αναπτύσσουν _______, web, ή/και mobile εφαρμογές.", 23 },
                    { 173, "Ποιο εργαλείο ανάπτυξης εφαρμογών χρησιμοποιείται στα πλαίσια του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών;", 23 },
                    { 174, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθαίνουν να αναπτύσσουν λογισμικό για ένα μεγάλο πλήθος από πεδία, συμπεριλαμβανομένων των παραθυρικών εφαρμογών, των εφαρμογών κονσόλας, των εφαρμογών web και των mobile εφαρμογών.", 23 },
                    { 175, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές εκτίθονται σε σύγχρονες τεχνικές προγραμματισμού με στόχο την ποιότητα του παραγόμενου _________, καθώς και την ταχύτητα ανάπτυξης σύνθετων και πολύπλοκων προγραμμάτων/έργων.", 23 },
                    { 176, "Στο πλαίσιο του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών δίνεται ιδιαίτερη έμφαση στα ολοκληρωμένα περιβάλλοντα ανάπτυξης τα οποία ονομάζονται και:", 23 },
                    { 177, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθαίνουν να αναγνωρίζουν και να εξηγούν τι είναι γλώσσα και γραμματική και πώς συμβολίζονται.", 23 },
                    { 178, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθάινουν να κάνουν ________ λογισμικού με τα πλέον σύγχρονα εργαλεία.", 23 },
                    { 179, "Ποιο από τα παρακάτω αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών;", 23 },
                    { 180, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών , οι φοιτητές μαθάινουν να παράγουν εφαρμογές με _______ και ταχύ ρυθμό.", 23 },
                    { 181, "Η Εικονική Πραγματικότητα είναι το επιστημονικό πεδίο με αντικείμενο την αναπαράσταση κόσμων με τη βοήθεια ηλεκτρονικών υπολογιστών.", 20 },
                    { 182, "Τα ______ με υπολογιστές διαδραματίζουν βασικό ρόλο στην Εικονική Πραγματικότητα.", 20 },
                    { 183, "Η Εικονική Πραγματικότητα, κυρίως μέσω των _______ Εικονικών Συστημάτων, έχει πλήθος εφαρμογών στην εκπαίδευση, την ψυχαγωγία, την προσομοίωση, την αλληλεπίδραση ανθρώπου – υπολογιστή και την επιστημονική έρευνα", 20 },
                    { 184, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί αντικείμενο του μαθήματος Εικονική Πραγματικότητα;", 20 },
                    { 185, "Στόχος του μαθήματος Εικονική Πραγματικότητα είναι να αποκτήσουν οι φοιτητές γνώσεις και ικανότητες χρήσης/δημιουργίας μετρικών αξιολόγησης παιχνιδιών βάσει των στόχων που τέθηκαν κατά τη σχεδίασή τους.", 20 },
                    { 186, "Πως ονομάζεται το περιβάλλον με το οποίο θα εξοικιωθούν οι φοιτητές για την ανάπτηξη συστημάτων Εικονικής Πραγματικότητας;", 20 },
                    { 187, "Στόχος του μαθήματος Εικονική Πραγματικότητα είναι η εξοικείωση των φοιτητών με σύγχρονες τεχνολογίες, μεθόδους και εργαλεία για τη δημιουργία ολοκληρωμένων εφαρμογών Εικονικής Πραγματικότητας.", 20 },
                    { 188, "Μέσω της παρακολούθησης του μαθήματος Εικονική Πραγματικότητα ο φοιτητής γνωρίζει τις ________ ενός συστήματος Εικονικής Πραγματικότητας.", 20 },
                    { 189, "Ποιο από τα παρακάτω αποτελεί διδακτική ενότητα του μαθήματος Εικονική Πραγματικότητα;", 20 },
                    { 190, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί διδακτική ενότητα του μαθήματος Εικονική Πραγματικότητα;", 20 },
                    { 191, "Παρακολουθώντας το μάθημα Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών, οι φοιτητές θα μπορούν να αναπτύσουν εφαρμογές ηλεκτρονικών παιχνιδιών στο περιβάλλον της Python.", 13 },
                    { 192, "Στόχος του μαθήματος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών είναι να αποκτήσουν οι φοιτητές βασικές γνώσεις για τον ρόλο, τους τύπους και τα ________ των παιχνιδιών, καθώς και για τη συνολική διαδικασία δημιουργίας ενός παιχνιδιού.", 13 },
                    { 193, "Στόχος του μαθήματος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών είναι να αποκτήσουν οι φοιτητές ικανότητες σχεδίασης και _________ παιχνιδιών αξιοποιώντας σύγχρονα εργαλεία, διασυνδέσεις και γλώσσες προγραμματισμού,", 13 },
                    { 194, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί κατηγορία ηλεκτρονικών παιχνιδιών;", 13 },
                    { 195, "Στόχος του μαθήματος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών είναι να αποκτήσουν οι φοιτητές γνώσεις και ικανότητες χρήσης/δημιουργίας μετρικών αξιολόγησης παιχνιδιών βάσει των στόχων που τέθηκαν κατά τη σχεδίασή τους.", 13 },
                    { 196, "Στα πλάισια του μαθήαμτος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών ο φοιτητής μαθαίνει να συνοψίζει τις απαιτούμενες γνώσεις σχετικά με την ανάπτυξη ηλεκτρονικών παιχνιδιών στο περιβάλλον της ________", 13 },
                    { 197, "Στόχος του μαθήματος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών είναι η εξοικείωση των φοιτητών με σύγχρονες τεχνολογίες, μεθόδους και εργαλεία για τη δημιουργία ολοκληρωμένων διαδικτυακών εφαρμογών.", 13 },
                    { 198, "Το αντικείενο του μαθήματος Τεχνολογίες Ανάπτυξης Ηλεκτρονικών Παιχνιδιών περιλαμβάνει τη σχεδίαση ενός παιχνιδιού σε ________.", 13 },
                    { 199, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί συστατικά ηλεκτρονικών παιχνιδιών στο Διαδίκτυο;", 13 },
                    { 200, "Ο κόσμος ενός ηλεκτρονικού αποτελείται από χαρακτήρες που μπορεί να είναι...;", 13 },
                    { 201, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού;", 14 },
                    { 202, "Η ανάπτυξη των mobile apps στο μάθημα Σύγχρονα Θέματα Τεχνολογίας Λογισμικού  υλοποιείται με τη χρήση του περιβάλλοντος ανάπτυξης λογισμικού ___________.", 14 },
                    { 203, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού;", 14 },
                    { 204, "Ποιο από τα παρακάτω ΔΕΝ αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού;", 14 },
                    { 205, "Tο μάθημα Σύγχρονα Θέματα Τεχνολογίας Λογισμικού καλύπτει και την ύλη που αφορά στους αισθητήρες των κινητών συσκευών, στις υπηρεσίες γεοεντοπισμού και σε πλήθος άλλων προχωρημένων τεχνικών προγραμματισμού.", 14 },
                    { 206, "Η ύλη του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού περιλαμβάνει κυρίως τη χρήση της αντικειμενοστρεφούς γλώσσας προγραμματισμού C#.", 14 },
                    { 207, "Ένα από τα αντκείμενα του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού είναι η “Ανάλυση απαιτήσεων: __________ Ανάλυση και Αντικειμενοστρεφής Ανάλυση”.", 14 },
                    { 208, "Ποιο από τα παρακάτω αποτελεί μοντέλο ανάπτυξης λογισμικού που αναλύεται στα πλαίσια του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού;", 14 },
                    { 209, "Ένα από τα αντικέιμενα του μαθήματος Σύγχρονα Θέματα Τεχνολογίας Λογισμικού είναι προϋπολογισμός κόστους λογισμικού.", 14 },
                    { 210, "Παρακολουθώντας το μάθημα Σύγχρονα Θέματα Τεχνολογίας Λογισμικού, μπορεί κανείς να χρησιμοποιεί πρακτικά τις πλέον σύγχρονες υπηρεσίες ______ και Mobile backend as a service που παρέχει η Firebase.", 14 },
                    { 211, "Ένα από τα αντικέιμενα του μαθήματος Αντικειμενοστρεφής Προγραμματισμός η ομαδική εργασία.", 15 },
                    { 212, "Ποιο από τα παρακάτω αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Αντικειμενοστρεφής Προγραμματισμός;", 15 },
                    { 213, "Ποιο από τα παρακάτω αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Αντικειμενοστρεφής Προγραμματισμός;", 15 },
                    { 214, "Παρακολουθώντας το μάθημα Αντικειμενοστρεφής Προγραμματισμός, οι φοιτητές είναι ικανοί να θα παράγουν εφαρμογές πελάτη-εξυπηρετητή.", 15 },
                    { 215, "Το κύριο αντικείμενο του μαθήματος Αντικειμενοστρεφής Προγραμματισμός  είναι η εισαγωγή στον αντικειμενοστρεφή προγραμματισμό με πλήρη ανάλυση της γλώσσας προγραμματισμού ______.", 15 },
                    { 216, "Στα πλαίσια του μαθήματος Αντικειμενοστρεφής Προγραμματισμός οι φοιτητές μαθαίνουν να χειρίζονται αρχεία προορισμένα για _________ και αποθήκευση δεδομένων.", 15 },
                    { 217, "Στα πλαίσια του μαθήματος Αντικειμενοστρεφής Προγραμματισμός οι φοιτητές μαθαίνουν την έννοια της κληρονομικότητας.", 15 },
                    { 218, "Παρακολουθώντας το μάθημα Αντικειμενοστρεφής Προγραμματισμός, οι φοιτητές είναι ικανοί  να παράγουν εφαρμογές με αποδοτικό και ταχύ ρυθμό.", 15 },
                    { 219, "Στα πλαίσια του μαθήματος Αντικειμενοστρεφής Προγραμματισμός οι φοιτητές μαθαίνουν να διαχειρίζονται αποτελεσματικά και με χρήση των κατάλληλων εργαλείων τις ________ που ανακύπτουν.", 15 },
                    { 220, "Ποιο από τα παρακάτω ΔΕΝ ανήκει στο αντικείμενο του μαθήματος Αντικειμενοστρεφής Προγραμματισμός;", 15 },
                    { 221, "Η ύλη του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών περιλαμβάνει κυρίως τη χρήση της αντικειμενοστρεφούς γλώσσας προγραμματισμού C#.", 2 },
                    { 222, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθαίνουν να αναπτύσσουν _______, web, ή/και mobile εφαρμογές.", 2 },
                    { 223, "Ποιο εργαλείο ανάπτυξης εφαρμογών χρησιμοποιείται στα πλαίσια του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών;", 2 },
                    { 224, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθαίνουν να αναπτύσσουν λογισμικό για ένα μεγάλο πλήθος από πεδία, συμπεριλαμβανομένων των παραθυρικών εφαρμογών, των εφαρμογών κονσόλας, των εφαρμογών web και των mobile εφαρμογών.", 2 },
                    { 225, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές εκτίθονται σε σύγχρονες τεχνικές προγραμματισμού με στόχο την ποιότητα του παραγόμενου _________, καθώς και την ταχύτητα ανάπτυξης σύνθετων και πολύπλοκων προγραμμάτων/έργων.", 2 },
                    { 226, "Στο πλαίσιο του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών δίνεται ιδιαίτερη έμφαση στα ολοκληρωμένα περιβάλλοντα ανάπτυξης τα οποία ονομάζονται και:", 2 },
                    { 227, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθαίνουν να αναγνωρίζουν και να εξηγούν τι είναι γλώσσα και γραμματική και πώς συμβολίζονται.", 2 },
                    { 228, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών, οι φοιτητές μαθάινουν να κάνουν ________ λογισμικού με τα πλέον σύγχρονα εργαλεία.", 2 },
                    { 229, "Ποιο από τα παρακάτω αποτελεί μαθησιακό αποτέλεσμα του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών;", 2 },
                    { 230, "Μέσω του μαθήματος Αντικειμενοστρεφής Ανάπτυξη Εφαρμογών , οι φοιτητές μαθάινουν να παράγουν εφαρμογές με _______ και ταχύ ρυθμό.", 2 }
                });
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 24);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 25);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 26);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 27);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 28);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 29);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 30);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 31);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 32);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 33);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 34);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 35);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 36);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 37);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 38);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 39);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 40);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 41);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 42);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 43);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 44);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 45);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 46);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 47);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 48);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 49);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 50);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 51);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 52);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 53);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 54);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 55);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 56);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 57);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 58);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 59);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 60);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 61);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 62);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 63);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 64);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 65);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 66);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 67);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 68);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 69);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 70);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 71);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 72);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 73);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 74);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 75);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 76);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 77);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 78);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 79);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 80);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 81);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 82);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 83);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 84);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 85);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 86);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 87);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 88);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 89);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 90);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 91);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 92);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 93);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 94);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 95);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 96);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 97);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 98);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 99);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 100);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 101);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 102);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 103);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 104);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 105);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 106);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 107);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 108);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 109);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 110);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 111);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 112);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 113);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 114);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 115);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 116);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 117);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 118);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 119);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 120);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 121);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 122);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 123);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 124);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 125);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 126);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 127);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 128);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 129);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 130);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 131);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 132);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 133);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 134);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 135);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 136);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 137);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 138);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 139);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 140);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 141);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 142);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 143);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 144);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 145);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 146);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 147);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 148);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 149);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 150);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 151);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 152);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 153);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 154);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 155);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 156);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 157);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 158);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 159);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 160);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 161);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 162);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 163);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 164);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 165);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 166);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 167);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 168);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 169);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 170);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 171);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 172);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 173);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 174);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 175);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 176);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 177);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 178);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 179);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 180);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 181);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 182);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 183);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 184);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 185);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 186);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 187);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 188);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 189);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 190);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 191);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 192);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 193);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 194);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 195);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 196);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 197);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 198);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 199);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 200);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 201);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 202);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 203);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 204);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 205);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 206);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 207);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 208);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 209);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 210);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 211);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 212);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 213);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 214);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 215);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 216);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 217);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 218);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 219);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 220);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 221);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 222);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 223);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 224);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 225);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 226);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 227);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 228);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 229);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 230);

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "3D Artist/Animator");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Accessibility Specialist");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Android Developer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Back-End Developer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Big Data Engineer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Cloud Data Engineer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Computer Graphics Programmer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Computer Vision Engineer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Data Architect");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Data Scientist");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Database Developer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "DevOps Engineer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Front-End Developer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Full-Stack Developer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Games Designer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Games Programmer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Incident Responder");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "iOS Developer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Level Designer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Machine Learning Engineer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Mobile App Developer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Mobile UI/UX Designer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "N.L.P. Engineer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Network Administrator");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Network Engineer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Network Security Specialist");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Penetration Tester");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Robotics Engineer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Security Analyst");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Security Engineer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Software Consultant");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Software Developer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "UI/UX Designer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Virtual Reality Developer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Visual Designer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Web App Developer");

            migrationBuilder.DeleteData(
                table: "Careers",
                keyColumn: "Name",
                keyValue: "Web Designer");

            migrationBuilder.DeleteData(
                table: "Coefficients",
                keyColumn: "Name",
                keyValue: "AI_ML");

            migrationBuilder.DeleteData(
                table: "Coefficients",
                keyColumn: "Name",
                keyValue: "ComputerNetworks");

            migrationBuilder.DeleteData(
                table: "Coefficients",
                keyColumn: "Name",
                keyValue: "ComputerVisionAndGraphics");

            migrationBuilder.DeleteData(
                table: "Coefficients",
                keyColumn: "Name",
                keyValue: "DatabaseEngineering");

            migrationBuilder.DeleteData(
                table: "Coefficients",
                keyColumn: "Name",
                keyValue: "GameDev");

            migrationBuilder.DeleteData(
                table: "Coefficients",
                keyColumn: "Name",
                keyValue: "MobileAppDev");

            migrationBuilder.DeleteData(
                table: "Coefficients",
                keyColumn: "Name",
                keyValue: "Security");

            migrationBuilder.DeleteData(
                table: "Coefficients",
                keyColumn: "Name",
                keyValue: "SoftwareEngineering");

            migrationBuilder.DeleteData(
                table: "Coefficients",
                keyColumn: "Name",
                keyValue: "UI_UX");

            migrationBuilder.DeleteData(
                table: "Coefficients",
                keyColumn: "Name",
                keyValue: "WebDev");

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "MobileAppDev", 1 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "SoftwareEngineering", 1 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "MobileAppDev", 2 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "MobileAppDev", 3 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "GameDev", 4 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "AI_ML", 5 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "GameDev", 5 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "GameDev", 6 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "Security", 7 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "Security", 8 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "ComputerNetworks", 9 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "Security", 9 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "ComputerNetworks", 10 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "UI_UX", 10 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "WebDev", 10 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "UI_UX", 11 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "AI_ML", 12 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "ComputerVisionAndGraphics", 12 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "AI_ML", 13 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "AI_ML", 14 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "DatabaseEngineering", 14 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "DatabaseEngineering", 15 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "DatabaseEngineering", 16 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "WebDev", 17 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "WebDev", 18 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "ComputerNetworks", 19 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "ComputerVisionAndGraphics", 20 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "SoftwareEngineering", 21 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "SoftwareEngineering", 22 });

            migrationBuilder.DeleteData(
                table: "CourseHasCoefficients",
                keyColumns: new[] { "CoefficientName", "CourseId" },
                keyValues: new object[] { "ComputerVisionAndGraphics", 23 });

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "Courses",
                keyColumn: "Id",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "AI_ML", 1 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "DatabaseEngineering", 1 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "AI_ML", 2 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "DatabaseEngineering", 2 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "Security", 2 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "AI_ML", 3 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "SoftwareEngineering", 3 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "Networks", 4 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "Security", 4 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "WebDev", 4 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "Networks", 5 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "Security", 5 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "Security", 6 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "WebDev", 6 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "AI_ML", 7 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "DatabaseEngineering", 7 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "Networks", 8 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "AI_ML", 9 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "Networks", 9 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "WebDev", 9 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "AI_ML", 10 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "DatabaseEngineering", 10 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "SoftwareEngineering", 11 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "ComputerVisionAndGraphics", 12 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "GameDev", 12 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "MobileAppDev", 13 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "UI_UX", 13 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "WebDev", 13 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutionHasCoefficients",
                keyColumns: new[] { "CoefficientName", "PostGraduateInstitutionId" },
                keyValues: new object[] { "UI_UX", 14 });

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "PostGraduateInstitutions",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 1, 2 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 1, 22 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 2, 3 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 5, 6 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 5, 13 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 6, 4 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 8, 7 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 9, 8 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 9, 19 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 11, 10 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 13, 12 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 14, 13 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 14, 16 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 16, 15 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 17, 10 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 18, 17 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 19, 10 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 20, 23 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 22, 21 });

            migrationBuilder.DeleteData(
                table: "PrerequisiteCourses",
                keyColumns: new[] { "BaseCourseId", "PrerequisiteCourseId" },
                keyValues: new object[] { 23, 12 });

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 24);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 25);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 26);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 27);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 28);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 29);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 30);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 31);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 32);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 33);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 34);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 35);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 36);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 37);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 38);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 39);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 40);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 41);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 42);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 43);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 44);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 45);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 46);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 47);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 48);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 49);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 50);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 51);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 52);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 53);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 54);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 55);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 56);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 57);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 58);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 59);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 60);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 61);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 62);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 63);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 64);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 65);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 66);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 67);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 68);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 69);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 70);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 71);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 72);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 73);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 74);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 75);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 76);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 77);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 78);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 79);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 80);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 81);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 82);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 83);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 84);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 85);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 86);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 87);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 88);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 89);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 90);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 91);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 92);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 93);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 94);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 95);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 96);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 97);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 98);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 99);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 100);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 101);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 102);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 103);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 104);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 105);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 106);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 107);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 108);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 109);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 110);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 111);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 112);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 113);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 114);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 115);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 116);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 117);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 118);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 119);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 120);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 121);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 122);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 123);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 124);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 125);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 126);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 127);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 128);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 129);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 130);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 131);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 132);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 133);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 134);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 135);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 136);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 137);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 138);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 139);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 140);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 141);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 142);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 143);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 144);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 145);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 146);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 147);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 148);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 149);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 150);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 151);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 152);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 153);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 154);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 155);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 156);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 157);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 158);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 159);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 160);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 161);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 162);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 163);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 164);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 165);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 166);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 167);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 168);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 169);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 170);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 171);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 172);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 173);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 174);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 175);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 176);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 177);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 178);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 179);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 180);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 181);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 182);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 183);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 184);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 185);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 186);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 187);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 188);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 189);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 190);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 191);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 192);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 193);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 194);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 195);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 196);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 197);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 198);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 199);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 200);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 201);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 202);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 203);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 204);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 205);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 206);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 207);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 208);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 209);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 210);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 211);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 212);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 213);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 214);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 215);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 216);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 217);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 218);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 219);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 220);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 221);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 222);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 223);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 224);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 225);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 226);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 227);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 228);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 229);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 230);
        }
    }
}
